import 'package:balady_plus/app/core/utils/constants/paths/icon_paths.dart';
import 'package:balady_plus/app/features/athkar/domain/entities/athkar_category.dart';
import 'package:balady_plus/app/features/athkar/domain/entities/athkar_entity.dart';

final List<AthkarEntity> morningAthkarEntites = [
  const AthkarEntity(
    name:
        'اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.  [آية الكرسى - البقرة 255].',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description:
        'من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح. ',
    content:
        'الله لا إلٰه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يئوده حفظهما وهو العلي العظيم لا إكراه في الدين قد تبين الرشد من الغي فمن يكفر بالطاغوت ويؤمن بالله فقد استمسك بالعروة الوثقىٰ لا انفصام لها والله سميع عليم الله ولي الذين آمنوا يخرجهم من الظلمات إلى النور ۖ والذين كفروا أولياؤهم الطاغوت يخرجونهم من النور إلى الظلمات ۗ أولٰئك أصحاب النار ۖ هم فيها خالدون.',
  ),
  const AthkarEntity(
    name:
        'ۥقُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description:
        'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).',
    content:
        'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم  \n قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.',
  ),
  const AthkarEntity(
    name:
        'قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description:
        'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).',
    content:
        'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \n قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.',
  ),
  const AthkarEntity(
    name:
        'قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description:
        'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).',
    content:
        ' بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \n قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ ',
  ),
  const AthkarEntity(
    name:
        'أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.',
  ),
  const AthkarEntity(
    name:
        'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description:
        'من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.',
    content:
        'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ ',
  ),
  //
  const AthkarEntity(
    name: 'رضيـت بالله ربـا وبالإسلام ديـنا وبمحـمد صلى الله عليه وسلم نبيـا. ',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description:
        'من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.',
    content:
        'رضيـت بالله ربـا وبالإسلام ديـنا وبمحـمد صلى الله عليه وسلم نبيـا. ',
  ),
  const AthkarEntity(
      name:
          'اللهـم إنـي أصبـحت أشـهدك ، وأشـهد حملـة عـرشـك ، وملائكتك ، وجمـيع خلـقك ، أنـك أنـت الله لا إله إلا أنـت وحـدك لا شريك لـك ، وأن محمـدا عبـدك ورسـولـك. ',
      quantity: 4,
      quantityText: 'اربع مرات',
      description: 'من قالها أعتقه الله من النار.',
      content:
          'اللهـم إنـي أصبـحت أشـهدك ، وأشـهد حملـة عـرشـك ، وملائكتك ، وجمـيع خلـقك ، أنـك أنـت الله لا إله إلا أنـت وحـدك لا شريك لـك ، وأن محمـدا عبـدك ورسـولـك. '),
  const AthkarEntity(
    name:
        'اللهـم ما أصبـح بي مـن نعـمة أو بأحـد مـن خلـقك ، فمـنك وحـدك لا شريك لـك ، فلـك الحمـد ولـك الشكـر.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: 'من قالها حين يصبح أدى شكر يومه.',
    content:
        'اللهـم ما أصبـح بي مـن نعـمة أو بأحـد مـن خلـقك ، فمـنك وحـدك لا شريك لـك ، فلـك الحمـد ولـك الشكـر.',
  ),
  const AthkarEntity(
    name: 'حسبـي الله لا إله إلا هو علـيه توكـلت وهو رب العرش العظـيم. ',
    quantity: 7,
    quantityText: 'سبع مرات',
    description: 'من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.',
    content: 'حسبـي الله لا إله إلا هو علـيه توكـلت وهو رب العرش العظـيم. ',
  ),
  //12
  const AthkarEntity(
    name:
        'بسـم الله الذي لا يضـر مع اسمـه شيء في الأرض ولا في السمـاء وهـو السمـيع العلـيم. ',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: 'لم يضره من الله شيء.',
    content:
        'بسـم الله الذي لا يضـر مع اسمـه شيء في الأرض ولا في السمـاء وهـو السمـيع العلـيم. ',
  ),
  const AthkarEntity(
    name:
        'اللهـم بك أصـبحنا وبك أمسـينا ، وبك نحـيا وبك نمـوت وإلـيك النـشور. ',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'اللهـم بك أصـبحنا وبك أمسـينا ، وبك نحـيا وبك نمـوت وإلـيك النـشور. ',
  ),
  const AthkarEntity(
    name:
        'أصبـحـنا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم حنيفا مسلما وما كان من المشركين. ',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'أصبـحـنا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم حنيفا مسلما وما كان من المشركين. ',
  ),
  const AthkarEntity(
    name:
        'سبحـان الله وبحمـده عدد خلـقه ، ورضـا نفسـه ، وزنـة عـرشـه ، ومـداد كلمـاتـه. ',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content:
        'سبحـان الله وبحمـده عدد خلـقه ، ورضـا نفسـه ، وزنـة عـرشـه ، ومـداد كلمـاتـه. ',
  ),
  const AthkarEntity(
    name:
        'اللهـم عافـني في بدنـي ، اللهـم عافـني في سمـعي ، اللهـم عافـني في بصـري ، لا إله إلا أنـت. ',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content:
        'اللهـم عافـني في بدنـي ، اللهـم عافـني في سمـعي ، اللهـم عافـني في بصـري ، لا إله إلا أنـت. ',
  ),
  //17
  const AthkarEntity(
    name:
        'اللهـم إنـي أعـوذ بك من الكـفر ، والفـقر ، وأعـوذ بك من عذاب القـبر ، لا إله إلا أنـت.',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content:
        'اللهـم إنـي أعـوذ بك من الكـفر ، والفـقر ، وأعـوذ بك من عذاب القـبر ، لا إله إلا أنـت.',
  ),

  const AthkarEntity(
    name:
        'اللهـم إنـي أسـألـك العـفو والعـافـية في الدنـيا والآخـرة ، اللهـم إنـي أسـألـك العـفو والعـافـية في ديني ودنـياي وأهـلي ومالـي ، اللهـم استـر عـوراتي وآمـن روعاتـي ، اللهـم احفظـني من بـين يدي ومن خلفـي وعن يمـيني وعن شمـالي ، ومن فوقـي ، وأعـوذ بعظمـتك أن أغـتال من تحتـي. ',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'اللهـم إنـي أسـألـك العـفو والعـافـية في الدنـيا والآخـرة ، اللهـم إنـي أسـألـك العـفو والعـافـية في ديني ودنـياي وأهـلي ومالـي ، اللهـم استـر عـوراتي وآمـن روعاتـي ، اللهـم احفظـني من بـين يدي ومن خلفـي وعن يمـيني وعن شمـالي ، ومن فوقـي ، وأعـوذ بعظمـتك أن أغـتال من تحتـي. ',
  ),
  const AthkarEntity(
    name:
        'يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طـرفة عين. ',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content:
        'يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طـرفة عين. ',
  ),
  const AthkarEntity(
    name:
        'أصبـحـنا وأصبـح المـلك لله رب العـالمـين ، اللهـم إنـي أسـألـك خـير هـذا الـيوم ، فـتحه ، ونصـره ، ونـوره وبـركتـه ، وهـداه ، وأعـوذ بـك مـن شـر ما فـيه وشـر ما بعـده. ',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'أصبـحـنا وأصبـح المـلك لله رب العـالمـين ، اللهـم إنـي أسـألـك خـير هـذا الـيوم ، فـتحه ، ونصـره ، ونـوره وبـركتـه ، وهـداه ، وأعـوذ بـك مـن شـر ما فـيه وشـر ما بعـده. ',
  ),
  const AthkarEntity(
    name:
        'اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه ، أشهـد أن لا إلـه إلا أنت ، أعـوذ بك من شـر نفسـي ومن شـر الشيـطان وشركه ، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم. ',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه ، أشهـد أن لا إلـه إلا أنت ، أعـوذ بك من شـر نفسـي ومن شـر الشيـطان وشركه ، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم. ',
  ),
  const AthkarEntity(
      name: 'أعـوذ بكلمـات الله التـامـات من شـر ما خلـق. ',
      quantity: 3,
      quantityText: 'ثلاث مرات',
      description: '',
      content: 'أعـوذ بكلمـات الله التـامـات من شـر ما خلـق. '),
  const AthkarEntity(
    name: 'اللهم صل وسلم وبارك على نبينا محمد.',
    quantity: 10,
    quantityText: 'عشر مرات',
    description: 'من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.',
    content: 'اللهم صل وسلم وبارك على نبينا محمد.',
  ),
  const AthkarEntity(
    name:
        'اللهم إنا نعوذ بك من أن نشرك بك شيئا نعلمه ، ونستغفرك لما لا نعلمه. ',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content:
        'اللهم إنا نعوذ بك من أن نشرك بك شيئا نعلمه ، ونستغفرك لما لا نعلمه. ',
  ),
  const AthkarEntity(
    name:
        'اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدين، وقهر الرجال. ',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content:
        'اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدين، وقهر الرجال. ',
  ),
  const AthkarEntity(
      name: 'يا رب , لك الحمد كما ينبغي لجلال وجهك , ولعظيم سلطانك. ',
      quantity: 3,
      quantityText: 'ثلاث مرات',
      description: '',
      content: 'يا رب , لك الحمد كما ينبغي لجلال وجهك , ولعظيم سلطانك. '),
  const AthkarEntity(
    name: 'اللهم إني أسألك علما نافعا، ورزقا طيبا، وعملا متقبلا. ',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content: 'اللهم إني أسألك علما نافعا، ورزقا طيبا، وعملا متقبلا. ',
  ),
  const AthkarEntity(
    name:
        'اللهم أنت ربي لا إله إلا أنت ، عليك توكلت ، وأنت رب العرش العظيم , ما شاء الله كان ، وما لم يشأ لم يكن ، ولا حول ولا قوة إلا بالله العلي العظيم , أعلم أن الله على كل شيء قدير ، وأن الله قد أحاط بكل شيء علما , اللهم إني أعوذ بك من شر نفسي ، ومن شر كل دابة أنت آخذ بناصيتها ، إن ربي على صراط مستقيم. ',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: 'ذكر طيب.',
    content:
        'اللهم أنت ربي لا إله إلا أنت ، عليك توكلت ، وأنت رب العرش العظيم , ما شاء الله كان ، وما لم يشأ لم يكن ، ولا حول ولا قوة إلا بالله العلي العظيم , أعلم أن الله على كل شيء قدير ، وأن الله قد أحاط بكل شيء علما , اللهم إني أعوذ بك من شر نفسي ، ومن شر كل دابة أنت آخذ بناصيتها ، إن ربي على صراط مستقيم. ',
  ),
  const AthkarEntity(
    name:
        'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. ',
    quantity: 100,
    quantityText: 'مئة مرة',
    description:
        'كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.',
    content:
        'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. ',
  ),
  const AthkarEntity(
    name: 'سبحـان الله وبحمـده.',
    quantity: 100,
    quantityText: 'مئة مرة',
    description:
        'حطت خطاياه وإن كانت مثل زبد البحر. لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه.',
    content: 'سبحـان الله وبحمـده.',
  ),
  const AthkarEntity(
    name: 'أستغفر الله وأتوب إليه',
    quantity: 100,
    quantityText: 'مئة مرة',
    description:
        'مائة حسنة، ومحيت عنه مائة سيئة، وكانت له حرزا من الشيطان حتى يمسى.',
    content: 'أستغفر الله وأتوب إليه',
  ),
];
final List<AthkarEntity> sleepingAthkarEntites = [
  const AthkarEntity(
    name:
        'باسمك ربـي وضعـت جنـبي ، وبك أرفعـه، فإن أمسـكت نفسـي فارحـمها ، وإن أرسلتـها فاحفظـها بمـا تحفـظ به عبـادك الصـالحـين.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'باسمك ربـي وضعـت جنـبي ، وبك أرفعـه، فإن أمسـكت نفسـي فارحـمها ، وإن أرسلتـها فاحفظـها بمـا تحفـظ به عبـادك الصـالحـين.',
  ),
  const AthkarEntity(
    name:
        'اللهـم إنـك خلـقت نفسـي وأنـت توفـاهـا لك ممـاتـها ومحـياها ، إن أحييـتها فاحفظـها ، وإن أمتـها فاغفـر لـها . اللهـم إنـي أسـألـك العـافـية.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'اللهـم إنـك خلـقت نفسـي وأنـت توفـاهـا لك ممـاتـها ومحـياها ، إن أحييـتها فاحفظـها ، وإن أمتـها فاغفـر لـها . اللهـم إنـي أسـألـك العـافـية.',
  ),
  const AthkarEntity(
    name: 'اللهـم قنـي عذابـك يـوم تبـعث عبـادك.',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content: 'اللهـم قنـي عذابـك يـوم تبـعث عبـادك.',
  ),
  const AthkarEntity(
    name: 'باسـمك اللهـم أمـوت وأحـيا.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content: 'باسـمك اللهـم أمـوت وأحـيا.',
  ),
  const AthkarEntity(
    name:
        'الـحمد لله الذي أطـعمنا وسقـانا، وكفـانا، وآوانا، فكـم ممـن لا كـافي لـه ولا مـؤوي.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'الـحمد لله الذي أطـعمنا وسقـانا، وكفـانا، وآوانا، فكـم ممـن لا كـافي لـه ولا مـؤوي.',
  ),
  const AthkarEntity(
    name:
        'اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه، أشهـد أن لا إلـه إلا أنت، أعـوذ بك من شـر نفسـي، ومن شـر الشيـطان وشـركه، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم .',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه، أشهـد أن لا إلـه إلا أنت، أعـوذ بك من شـر نفسـي، ومن شـر الشيـطان وشـركه، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم .',
  ),
  const AthkarEntity(
    name:
        'اللهـم أسـلمت نفـسي إلـيك، وفوضـت أمـري إلـيك، ووجـهت وجـهي إلـيك، وألـجـات ظهـري إلـيك، رغبـة ورهـبة إلـيك، لا ملجـأ ولا منـجـا منـك إلا إلـيك، آمنـت بكتـابك الـذي أنزلـت وبنبـيـك الـذي أرسلـت.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'اللهـم أسـلمت نفـسي إلـيك، وفوضـت أمـري إلـيك، ووجـهت وجـهي إلـيك، وألـجـات ظهـري إلـيك، رغبـة ورهـبة إلـيك، لا ملجـأ ولا منـجـا منـك إلا إلـيك، آمنـت بكتـابك الـذي أنزلـت وبنبـيـك الـذي أرسلـت.',
  ),
  const AthkarEntity(
    name: 'سبحان الله.',
    quantity: 33,
    quantityText: 'ثلاث و ثلاثون مرة',
    description: '',
    content: 'سبحان الله.',
  ),
  const AthkarEntity(
    name: 'الحمد لله. ',
    quantity: 33,
    quantityText: 'ثلاث و ثلاثون مرة',
    description: '',
    content: 'الحمد لله. ',
  ),
  const AthkarEntity(
    name: 'الله أكبر.',
    quantity: 34,
    quantityText: 'اربع و ثلاثون مرة',
    description: '',
    content: 'الله أكبر.',
  ),
  const AthkarEntity(
    name:
        'يجمع كفيه ثم ينفث فيهما والقراءة : { هو الله }  أعوذ برب الفلق أعوذ برب ومسح ما استطاع من الجسد يبدأ بهما على رأسه ووجه وما أقبل من جسده.',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content:
        'يجمع كفيه ثم ينفث فيهما والقراءة : { هو الله }  أعوذ برب الفلق أعوذ برب ومسح ما استطاع من الجسد يبدأ بهما على رأسه ووجه وما أقبل من جسده.',
  ),
  const AthkarEntity(
    name:
        'سورة البقرة: أعوذ بالله من الشيطان الرجيآ \n  من الرسول بما أنزل إليه من ربه والمؤمنون ۚ كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله ۚ وقالوا سمعنا وأطعنا ۖ غفرانك ربنا وإليك المصير. لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ربنا ولا تحملنا ما لا طاقة لنا به واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين. [البقرة 285 - 286]',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: 'من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.',
    content:
        'سورة البقرة: أعوذ بالله من الشيطان الرجيآ \nمن الرسول بما أنزل إليه من ربه والمؤمنون ۚ كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله ۚ وقالوا سمعنا وأطعنا ۖ غفرانك ربنا وإليك المصير. لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ربنا ولا تحملنا ما لا طاقة لنا به واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين. [البقرة 285 - 286]',
  ),
  const AthkarEntity(
    name:
        'آية الكرسى: أعوذ بالله من الشيطان الرجيم\n  الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم. [البقرة 255] ',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: 'أجير من الجن حتى يصبح.',
    content:
        'آية الكرسى: أعوذ بالله من الشيطان الرجيم\n  الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم. [البقرة 255] ',
  ),
  const AthkarEntity(
    name:
        'أذكار من قلق في فراشه ولم ينم عن بريدة رضي الله عنه، : شكا خالد بن الوليد رضي الله عنه إلى النبي صلى الله عليه وسلم : يا رسول ! ما أنام الليل من الأرق، فقال النبي صلى الله عليه : " أويت إلى فراشك : اللهم رب السموات السبع وما أظلت، ورب الأرضين وما أقلت، ورب الشياطين وما أضلت، كن لي جارا من خلقك كلهم جميعا أن يفرط علي أحد منهم أو أن يبغي علي، عز جارك، وجل ثناؤك ولا إله غيرك، ولا إله إلا " عن عمرو بن شعيب، عن أبيه، عن جده: أن رسول الله صلى الله عليه وسلم كان يعلمهم من الفزع  " بكلمات الله التامة من غضبه وشر عباده، ومن همزات الشياطين وأن "',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content:
        'أذكار من قلق في فراشه ولم ينم عن بريدة رضي الله عنه، : شكا خالد بن الوليد رضي الله عنه إلى النبي صلى الله عليه وسلم : يا رسول ! ما أنام الليل من الأرق، فقال النبي صلى الله عليه : " أويت إلى فراشك : اللهم رب السموات السبع وما أظلت، ورب الأرضين وما أقلت، ورب الشياطين وما أضلت، كن لي جارا من خلقك كلهم جميعا أن يفرط علي أحد منهم أو أن يبغي علي، عز جارك، وجل ثناؤك ولا إله غيرك، ولا إله إلا " عن عمرو بن شعيب، عن أبيه، عن جده: أن رسول الله صلى الله عليه وسلم كان يعلمهم من الفزع  " بكلمات الله التامة من غضبه وشر عباده، ومن همزات الشياطين وأن "',
  ),
  const AthkarEntity(
    name:
        'أذكار الأحلام عن أبي قتادة رضي الله عنه : قال رسول الله صلى الله عليه : وفي رواية " الحسنة من الله، والحلم من الشيطان، فمن رأى شيئا يكرهه فلينفث عن شماله ثلاثا وليتعوذ من الشيطان، فإنها لا".',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'أذكار الأحلام عن أبي قتادة رضي الله عنه : قال رسول الله صلى الله عليه : وفي رواية " الحسنة من الله، والحلم من الشيطان، فمن رأى شيئا يكرهه فلينفث عن شماله ثلاثا وليتعوذ من الشيطان، فإنها لا".',
  ),
];

final List<AthkarEntity> nightAthkarEntites = [
  const AthkarEntity(
    name:
        'أعوذ بالله من الشيطان الرجيم\n  الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم. [آية الكرسى - البقرة 255].',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description:
        'من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح. ',
    content:
        'أعوذ بالله من الشيطان الرجيم \n الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم. [آية الكرسى - البقرة 255].',
  ),
  const AthkarEntity(
    name:
        'أعوذ بالله من الشيطان الرجيم \n آمن الرسول بما أنزل إليه من ربه والمؤمنون ۚ كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله ۚ وقالوا سمعنا وأطعنا ۖ غفرانك ربنا وإليك المصير. لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينآ أو أخطأنا ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ربنا ولا تحملنا ما لا طاقة لنا به واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين. [البقرة 285 - 286].',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: 'من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.',
    content:
        'أعوذ بالله من الشيطان الرجيم\n  آمن الرسول بما أنزل إليه من ربه والمؤمنون ۚ كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله ۚ وقالوا سمعنا وأطعنا ۖ غفرانك ربنا وإليك المصير. لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينآ أو أخطأنا ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ربنا ولا تحملنا ما لا طاقة لنا به واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين. [البقرة 285 - 286].',
  ),
  const AthkarEntity(
    name:
        'بسم الله الرحمن\n  الرحيم قل هو ٱلله أحد، ٱلله ٱلصمد، لم يلد ولم يولد، ولم يكن لهۥ كفوا أحدۢ.',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description:
        'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين). ',
    content:
        'بسم الله الرحمن الرحيم  \nقل هو ٱلله أحد، ٱلله ٱلصمد، لم يلد ولم يولد، ولم يكن لهۥ كفوا أحدۢ.',
  ),
  const AthkarEntity(
    name:
        'بسم الله الرحمن الرحيم قل أعوذ برب ٱلفلق، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر ٱلنفٰثٰت فى ٱلعقد، ومن شر حاسد إذا حسد.',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content:
        'بسم الله الرحمن الرحيم قل أعوذ برب ٱلفلق، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر ٱلنفٰثٰت فى ٱلعقد، ومن شر حاسد إذا حسد.',
  ),
  const AthkarEntity(
    name:
        'بسم الله الرحمن الرحيم\n قل أعوذ برب ٱلناس، ملك ٱلناس، إلٰه ٱلناس، من شر ٱلوسواس ٱلخناس، ٱلذى يوسوس فى صدور ٱلناس، من ٱلجنة وٱلناس. ',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content:
        'بسم الله الرحمن الرحيم  \nقل أعوذ برب ٱلناس، ملك ٱلناس، إلٰه ٱلناس، من شر ٱلوسواس ٱلخناس، ٱلذى يوسوس فى صدور ٱلناس، من ٱلجنة وٱلناس. ',
  ),
  const AthkarEntity(
    name:
        'أمسيـنا وأمسـى المـلك لله والحمد لله ، لا إله إلا الله وحده لا شريك له، له المـلك وله الحمـد، وهو على كل شيء قدير ، رب أسـألـك خـير ما في هـذه اللـيلة وخـير ما بعـدهـا ، وأعـوذ بك من شـر ما في هـذه اللـيلة وشر ما بعـدهـا ، رب أعـوذبك من الكسـل وسـوء الكـبر ، رب أعـوذ بك من عـذاب في النـار وعـذاب في القـبر. ',
    quantity: 1,
    description: 'مرة واحدة',
    quantityText: '',
    content:
        'أمسيـنا وأمسـى المـلك لله والحمد لله ، لا إله إلا الله وحده لا شريك له، له المـلك وله الحمـد، وهو على كل شيء قدير ، رب أسـألـك خـير ما في هـذه اللـيلة وخـير ما بعـدهـا ، وأعـوذ بك من شـر ما في هـذه اللـيلة وشر ما بعـدهـا ، رب أعـوذبك من الكسـل وسـوء الكـبر ، رب أعـوذ بك من عـذاب في النـار وعـذاب في القـبر. ',
  ),
  const AthkarEntity(
    name:
        'اللهـم أنت ربـي لا إله إلا أنت ، خلقتنـي وأنا عبـدك ، وأنا علـى عهـدك ووعـدك ما استـطعـت ، أعـوذبك من شـر ما صنـعت ، أبـوء لـك بنعـمتـك علـي وأبـوء بذنـبي فاغفـر لي فإنـه لا يغـفر الذنـوب إلا أنت .',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description:
        'من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.',
    content:
        'اللهـم أنت ربـي لا إله إلا أنت ، خلقتنـي وأنا عبـدك ، وأنا علـى عهـدك ووعـدك ما استـطعـت ، أعـوذبك من شـر ما صنـعت ، أبـوء لـك بنعـمتـك علـي وأبـوء بذنـبي فاغفـر لي فإنـه لا يغـفر الذنـوب إلا أنت .',
  ),
  const AthkarEntity(
    name: 'رضيـت بالله ربـا وبالإسلام ديـنا وبمحـمد صلى الله عليه وسلم نبيـا.',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description:
        'من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.',
    content:
        'رضيـت بالله ربـا وبالإسلام ديـنا وبمحـمد صلى الله عليه وسلم نبيـا.',
  ),
  const AthkarEntity(
    name:
        'اللهـم إنـي أمسيت أشـهدك ، وأشـهد حملـة عـرشـك ، وملائكتك ، وجمـيع خلـقك ، أنـك أنـت الله لا إله إلا أنـت وحـدك لا شريك لـك ، وأن محمـدا عبـدك ورسـولـك.',
    quantity: 4,
    quantityText: 'اربع مرات',
    description: 'من قالها أعتقه الله من النار.',
    content:
        'اللهـم إنـي أمسيت أشـهدك ، وأشـهد حملـة عـرشـك ، وملائكتك ، وجمـيع خلـقك ، أنـك أنـت الله لا إله إلا أنـت وحـدك لا شريك لـك ، وأن محمـدا عبـدك ورسـولـك.',
  ),
  const AthkarEntity(
    name:
        'اللهـم ما أمسى بي مـن نعـمة أو بأحـد مـن خلـقك ، فمـنك وحـدك لا شريك لـك ، فلـك الحمـد ولـك الشكـر. ',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: 'من قالها حين يمسى أدى شكر يومه.',
    content:
        'اللهـم ما أمسى بي مـن نعـمة أو بأحـد مـن خلـقك ، فمـنك وحـدك لا شريك لـك ، فلـك الحمـد ولـك الشكـر. ',
  ),
  //
  const AthkarEntity(
      name: 'حسبـي الله لا إله إلا هو علـيه توكـلت وهو رب العرش العظـيم.',
      quantity: 7,
      quantityText: 'سبع مرات',
      description: 'من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.',
      content: 'حسبـي الله لا إله إلا هو علـيه توكـلت وهو رب العرش العظـيم.'),
  const AthkarEntity(
    name:
        'بسـم الله الذي لا يضـر مع اسمـه شيء في الأرض ولا في السمـاء وهـو السمـيع العلـيم. ',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: 'لم يضره من الله شيء.',
    content:
        'بسـم الله الذي لا يضـر مع اسمـه شيء في الأرض ولا في السمـاء وهـو السمـيع العلـيم. ',
  ),
  const AthkarEntity(
    name: 'اللهـم بك أمسـينا وبك أصـبحنا، وبك نحـيا وبك نمـوت وإلـيك المصير.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'اللهـم بك أمسـينا وبك أصـبحنا، وبك نحـيا وبك نمـوت وإلـيك المصير.',
  ),

  const AthkarEntity(
    name:
        'أمسينا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم حنيفا مسلما وما كان من المشركين. ',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'أمسينا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم حنيفا مسلما وما كان من المشركين.',
  ),
  const AthkarEntity(
    name:
        'سبحـان الله وبحمـده عدد خلـقه ، ورضـا نفسـه ، وزنـة عـرشـه ، ومـداد كلمـاتـه. ',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content:
        'سبحـان الله وبحمـده عدد خلـقه ، ورضـا نفسـه ، وزنـة عـرشـه ، ومـداد كلمـاتـه. ',
  ),
  const AthkarEntity(
    name:
        'اللهـم عافـني في بدنـي ، اللهـم عافـني في سمـعي ، اللهـم عافـني في بصـري ، لا إله إلا أنـت.',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content:
        'اللهـم عافـني في بدنـي ، اللهـم عافـني في سمـعي ، اللهـم عافـني في بصـري ، لا إله إلا أنـت.',
  ),
  const AthkarEntity(
    name:
        'اللهـم إنـي أعـوذ بك من الكـفر ، والفـقر ، وأعـوذ بك من عذاب القـبر ، لا إله إلا أنـت. ',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content:
        'اللهـم إنـي أعـوذ بك من الكـفر ، والفـقر ، وأعـوذ بك من عذاب القـبر ، لا إله إلا أنـت. ',
  ),
  const AthkarEntity(
    name:
        'اللهـم إنـي أسـألـك العـفو والعـافـية في الدنـيا والآخـرة ، اللهـم إنـي أسـألـك العـفو والعـافـية في ديني ودنـياي وأهـلي ومالـي ، اللهـم استـر عـوراتي وآمـن روعاتـي ، اللهـم احفظـني من بـين يدي ومن خلفـي وعن يمـيني وعن شمـالي ، ومن فوقـي ، وأعـوذ بعظمـتك أن أغـتال من تحتـي.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'اللهـم إنـي أسـألـك العـفو والعـافـية في الدنـيا والآخـرة ، اللهـم إنـي أسـألـك العـفو والعـافـية في ديني ودنـياي وأهـلي ومالـي ، اللهـم استـر عـوراتي وآمـن روعاتـي ، اللهـم احفظـني من بـين يدي ومن خلفـي وعن يمـيني وعن شمـالي ، ومن فوقـي ، وأعـوذ بعظمـتك أن أغـتال من تحتـي.',
  ),
  const AthkarEntity(
    name:
        'يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طـرفة عين.',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content:
        'يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طـرفة عين.',
  ),
  //
  const AthkarEntity(
    name:
        'أمسينا وأمسى الملك لله رب العالمين، اللهم إني أسألك خير هذه الليلة فتحها ونصرها، ونورها وبركتها، وهداها، وأعوذ بك من شر ما فيها وشر ما بعدها.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'أمسينا وأمسى الملك لله رب العالمين، اللهم إني أسألك خير هذه الليلة فتحها ونصرها، ونورها وبركتها، وهداها، وأعوذ بك من شر ما فيها وشر ما بعدها.',
  ),
  const AthkarEntity(
    name:
        'اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه ، أشهـد أن لا إلـه إلا أنت ، أعـوذ بك من شـر نفسـي ومن شـر الشيـطان وشركه ، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم. ',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه ، أشهـد أن لا إلـه إلا أنت ، أعـوذ بك من شـر نفسـي ومن شـر الشيـطان وشركه ، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم. ',
  ),
  const AthkarEntity(
    name: 'أعـوذ بكلمـات الله التـامـات من شـر ما خلـق. ',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content: 'أعـوذ بكلمـات الله التـامـات من شـر ما خلـق. ',
  ),
  const AthkarEntity(
    name: 'اللهم صل وسلم وبارك على نبينا محمد. ',
    quantity: 10,
    quantityText: 'عشر مرات',
    description: 'من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.',
    content: 'اللهم صل وسلم وبارك على نبينا محمد. ',
  ),
  const AthkarEntity(
    name: 'اللهم إنا نعوذ بك من أن نشرك بك شيئا نعلمه ، ونستغفرك لما لا نعلمه.',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content:
        'اللهم إنا نعوذ بك من أن نشرك بك شيئا نعلمه ، ونستغفرك لما لا نعلمه.',
  ),
  //
  const AthkarEntity(
    name:
        'اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدين، وقهر الرجال. ',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content:
        'اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدين، وقهر الرجال. ',
  ),
  const AthkarEntity(
    name: 'أستغفر الله العظيم الذي لا إله إلا هو، الحي القيوم، وأتوب إليه. ',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content: 'أستغفر الله العظيم الذي لا إله إلا هو، الحي القيوم، وأتوب إليه. ',
  ),
  const AthkarEntity(
    name: 'يا رب , لك الحمد كما ينبغي لجلال وجهك , ولعظيم سلطانك. ',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: '',
    content: 'يا رب , لك الحمد كما ينبغي لجلال وجهك , ولعظيم سلطانك. ',
  ),
  const AthkarEntity(
    name:
        'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. ',
    quantity: 100,
    quantityText: 'مئة مرة',
    description:
        'كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان. ',
    content:
        'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. ',
  ),
  const AthkarEntity(
    name:
        'اللهم أنت ربي لا إله إلا أنت ، عليك توكلت ، وأنت رب العرش العظيم , ما شاء الله كان ، وما لم يشأ لم يكن ، ولا حول ولا قوة إلا بالله العلي العظيم , أعلم أن الله على كل شيء قدير ، وأن الله قد أحاط بكل شيء علما , اللهم إني أعوذ بك من شر نفسي ، ومن شر كل دابة أنت آخذ بناصيتها ، إن ربي على صراط مستقيم. ',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: 'ذكر طيب.',
    content:
        'اللهم أنت ربي لا إله إلا أنت ، عليك توكلت ، وأنت رب العرش العظيم , ما شاء الله كان ، وما لم يشأ لم يكن ، ولا حول ولا قوة إلا بالله العلي العظيم , أعلم أن الله على كل شيء قدير ، وأن الله قد أحاط بكل شيء علما , اللهم إني أعوذ بك من شر نفسي ، ومن شر كل دابة أنت آخذ بناصيتها ، إن ربي على صراط مستقيم. ',
  ),
  const AthkarEntity(
    name: 'سبحـان الله وبحمـده.',
    quantity: 100,
    quantityText: 'مئة مرة',
    description:
        'حطت خطاياه وإن كانت مثل زبد البحر. لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه.',
    content: 'سبحـان الله وبحمـده.',
  ),
];
final List<AthkarEntity> afterPrayerAthkarEntites = [
  const AthkarEntity(
    name:
        'أسـتغفر الله، أسـتغفر الله، أسـتغفر الله. اللهـم أنـت السلام ، ومـنك السلام ، تباركت يا ذا الجـلال والإكـرام .',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'أسـتغفر الله، أسـتغفر الله، أسـتغفر الله. اللهـم أنـت السلام ، ومـنك السلام ، تباركت يا ذا الجـلال والإكـرام .',
  ),
  const AthkarEntity(
    name:
        'لا إله إلا الله وحده لا شريك له، له المـلك وله الحمد، وهو على كل شيء قدير، اللهـم لا مانع لما أعطـيت، ولا معطـي لما منـعت، ولا ينفـع ذا الجـد منـك الجـد.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'لا إله إلا الله وحده لا شريك له، له المـلك وله الحمد، وهو على كل شيء قدير، اللهـم لا مانع لما أعطـيت، ولا معطـي لما منـعت، ولا ينفـع ذا الجـد منـك الجـد.',
  ),
  const AthkarEntity(
    name:
        'لا إله إلا الله, وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، لا حـول ولا قـوة إلا بالله، لا إله إلا اللـه، ولا نعـبـد إلا إيـاه, له النعـمة وله الفضل وله الثـناء الحـسن، لا إله إلا الله مخلصـين لـه الدين ولو كـره الكـافرون.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'لا إله إلا الله, وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، لا حـول ولا قـوة إلا بالله، لا إله إلا اللـه، ولا نعـبـد إلا إيـاه, له النعـمة وله الفضل وله الثـناء الحـسن، لا إله إلا الله مخلصـين لـه الدين ولو كـره الكـافرون.',
  ),
  const AthkarEntity(
    name: 'سـبحان الله، والحمـد لله ، والله أكـبر.',
    quantity: 33,
    quantityText: 'تلاث و ثلاثون مرة',
    description: '',
    content: 'سـبحان الله، والحمـد لله ، والله أكـبر.',
  ),
  const AthkarEntity(
    name:
        'لا إله إلا الله وحـده لا شريك له، له الملك وله الحمد، وهو على كل شيء قـدير. ',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'لا إله إلا الله وحـده لا شريك له، له الملك وله الحمد، وهو على كل شيء قـدير. ',
  ),
  const AthkarEntity(
    name:
        'بسم الله الرحمن الرحيم\n قل هو ٱلله أحد، ٱلله ٱلصمد، لم يلد ولم يولد، ولم يكن لهۥ كفوا أحدۢ. بسم الله الرحمن الرحيم\n قل أعوذ برب ٱلفلق، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر ٱلنفٰثٰت فى ٱلعقد، ومن شر حاسد إذا حسد. بسم الله الرحمن الرحيم\n قل أعوذ برب ٱلناس، ملك ٱلناس، إلٰه ٱلناس، من شر ٱلوسواس ٱلخناس، ٱلذى يوسوس فى صدور ٱلناس، من ٱلجنة وٱلناس.',
    quantity: 3,
    quantityText: 'ثلاث مرات',
    description: 'ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى.',
    content:
        'بسم الله الرحمن الرحيم\n قل هو ٱلله أحد، ٱلله ٱلصمد، لم يلد ولم يولد، ولم يكن لهۥ كفوا أحدۢ. بسم الله الرحمن الرحيم\n قل أعوذ برب ٱلفلق، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر ٱلنفٰثٰت فى ٱلعقد، ومن شر حاسد إذا حسد. بسم الله الرحمن الرحيم\n قل أعوذ برب ٱلناس، ملك ٱلناس، إلٰه ٱلناس، من شر ٱلوسواس ٱلخناس، ٱلذى يوسوس فى صدور ٱلناس، من ٱلجنة وٱلناس.',
  ),
  const AthkarEntity(
    name:
        'أعوذ بالله من الشيطان الرجيم\n الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم. [آية الكرسى - البقرة 255]',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'أعوذ بالله من الشيطان الرجيم\n الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم. [آية الكرسى - البقرة 255]',
  ),
  const AthkarEntity(
    name:
        'لا إله إلا الله وحـده لا شريك له، له الملك وله الحمد، يحيـي ويمـيت وهو على كل شيء قدير. ',
    quantity: 10,
    quantityText: 'عشر مرات',
    description: 'عشر مرات بعد المغرب والصـبح.',
    content:
        'لا إله إلا الله وحـده لا شريك له، له الملك وله الحمد، يحيـي ويمـيت وهو على كل شيء قدير. ',
  ),
  const AthkarEntity(
    name: 'اللهـم إنـي أسألـك علمـا نافعـا ورزقـا طيـبا ، وعمـلا متقـبلا.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: 'بعد السلام من صلاة الفجر.',
    content: 'اللهـم إنـي أسألـك علمـا نافعـا ورزقـا طيـبا ، وعمـلا متقـبلا.',
  ),
  const AthkarEntity(
    name: 'اللهم أجرني من النار.',
    quantity: 7,
    quantityText: 'سبع مرات',
    description: 'بعد صلاة الصبح والمغرب.',
    content: 'اللهم أجرني من النار.',
  ),
  const AthkarEntity(
    name: 'اللهم أعني على ذكرك وشكرك وحسن عبادتك.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content: 'اللهم أعني على ذكرك وشكرك وحسن عبادتك.',
  ),
];

final List<AthkarEntity> praisesAthkarEntities = [
  const AthkarEntity(
    name: 'سبحان الله',
    quantity: 100,
    quantityText: 'مئة مرة',
    description: 'يكتب له ألف حسنة أو يحط عنه ألف خطيئة.',
    content: 'سبحان الله',
  ),
  const AthkarEntity(
    name: 'سبحان الله وبحمده ',
    quantity: 100,
    quantityText: 'مئة مرة',
    description:
        'حطت خطاياه وإن كانت مثل زبد البحر. لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه.',
    content: 'سبحان الله وبحمده ',
  ),
  const AthkarEntity(
    name: 'سبحان الله والحمد لله',
    quantity: 100,
    quantityText: 'مئة مرة',
    description: 'تملآن ما بين السماوات والأرض.',
    content: 'سبحان الله والحمد لله',
  ),
  const AthkarEntity(
    name: 'سبحان الله العظيم وبحمده',
    quantity: 100,
    quantityText: 'مئة مرة',
    description: 'غرست له نخلة في الجنة (أى عدد).',
    content: 'سبحان الله العظيم وبحمده',
  ),
  const AthkarEntity(
    name: 'سبحان الله وبحمده ، سبحان الله العظيم',
    quantity: 100,
    quantityText: 'مئة مرة',
    description: 'ثقيلتان في الميزان حبيبتان إلى الرحمن (أى عدد).',
    content: 'سبحان الله وبحمده ، سبحان الله العظيم',
  ),
  const AthkarEntity(
    name:
        'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير.',
    quantity: 100,
    quantityText: 'مئة مرة',
    description:
        'كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.',
    content:
        'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير.',
  ),
  const AthkarEntity(
    name: 'لا حول ولا قوة إلا بالله',
    quantity: 100,
    quantityText: 'مئة مرة ',
    description: 'كنز من كنوز الجنة (أى عدد).',
    content: 'لا حول ولا قوة إلا بالله',
  ),
  const AthkarEntity(
    name: 'الحمد لله رب العالمين',
    quantity: 100,
    quantityText: 'مئة مرة',
    description: 'تملأ ميزان العبد بالحسنات.',
    content: 'الحمد لله رب العالمين',
  ),
  const AthkarEntity(
    name: 'اللهم صل وسلم وبارك على سيدنا محمد',
    quantity: 100,
    quantityText: 'مئة مرة',
    description: 'من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.',
    content: 'اللهم صل وسلم وبارك على سيدنا محمد',
  ),
  const AthkarEntity(
    name: 'أستغفر الله',
    quantity: 100,
    quantityText: 'مئة مرة',
    description: 'لفعل الرسول صلى الله عليه وسلم.',
    content: 'أستغفر الله',
  ),
  const AthkarEntity(
    name: 'سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر',
    quantity: 100,
    quantityText: 'مئة مرة',
    description:
        'أنهن أحب الكلام الى الله، ومكفرات للذنوب، وغرس الجنة، وجنة لقائلهن من النار، وأحب الى النبي عليه السلام مما طلعت عليه الشمس، والباقيات الصالحات.',
    content: 'سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر',
  ),
  const AthkarEntity(
    name: 'لا إله إلا الله',
    quantity: 100,
    quantityText: 'مئة مرة',
    description: 'أفضل الذكر لا إله إلا الله.',
    content: 'لا إله إلا الله',
  ),
  const AthkarEntity(
    name: 'الله أكبر',
    quantity: 100,
    quantityText: 'مئة مرة',
    description:
        'من قال الله أكبر كتبت له عشرون حسنة وحطت عنه عشرون سيئة. الله أكبر من كل شيء.',
    content: 'الله أكبر',
  ),
  const AthkarEntity(
    name:
        'سبحان الله ، والحمد لله ، ولا إله إلا الله ، والله أكبر ، اللهم اغفر لي ، اللهم ارحمني ، اللهم ارزقني. ',
    quantity: 100,
    quantityText: 'مئة مرة',
    description: 'خير الدنيا والآخرة',
    content:
        'سبحان الله ، والحمد لله ، ولا إله إلا الله ، والله أكبر ، اللهم اغفر لي ، اللهم ارحمني ، اللهم ارزقني. ',
  ),
  const AthkarEntity(
    name: 'الحمد لله حمدا كثيرا طيبا مباركا فيه.',
    quantity: 100,
    quantityText: 'مئة مرة',
    description:
        'قال النبي صلى الله عليه وسلم " رأيت اثني عشر ملكا يبتدرونها، أيهم يرفعها".',
    content: 'الحمد لله حمدا كثيرا طيبا مباركا فيه.',
  ),
  const AthkarEntity(
    name:
        'اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم , وعلى آل إبراهيم إنك حميد مجيد , اللهم بارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد. ',
    quantity: 100,
    quantityText: 'مئة مرة',
    description:
        'في كل مره تحط عنه عشر خطايا ويرفع له عشر درجات ويصلي الله عليه عشرا وتعرض على الرسول صلى الله عليه وسلم (أى عدد).',
    content:
        'اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم , وعلى آل إبراهيم إنك حميد مجيد , اللهم بارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد. ',
  ),
];
final List<AthkarEntity> wakeUpAthkarEntities = [
  const AthkarEntity(
    name: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور. ',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور. ',
  ),
  const AthkarEntity(
    name: 'الحمد لله الذي عافاني في جسدي ورد علي روحي وأذن لي بذكره.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content: 'الحمد لله الذي عافاني في جسدي ورد علي روحي وأذن لي بذكره.',
  ),
  const AthkarEntity(
    name:
        'لا إله إلا الله وحـده لا شـريك له، له الملـك وله الحمـد، وهو على كل شيء قدير، سـبحان الله، والحمـد لله ، ولا إله إلا الله والله أكبر، ولا حول ولا قوة إلا بالله العلي العظيم. رب اغفر لي.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'لا إله إلا الله وحـده لا شـريك له، له الملـك وله الحمـد، وهو على كل شيء قدير، سـبحان الله، والحمـد لله ، ولا إله إلا الله والله أكبر، ولا حول ولا قوة إلا بالله العلي العظيم. رب اغفر لي.',
  ),
];
final List<AthkarEntity> prayerAthkarEntities = [
  const AthkarEntity(
    name:
        'أدعية استفتاح الصلاة اللَّهُمَّ بَاعِدْ بَيْنِيْ وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللهم نَقِّنِيْ مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الْأبْيَضُ مِنَ الدَّنَسِ، اللهم اغْسِلْنِيْ مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْمَاءِ والْبَرَدِ. سُبْحَانَكَ سُبْحَانَكَ اللهم وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلَا إِلَهَ غَيْرُكَ. الْحَمْدُ الْحَمْدُ للّهِ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ. اللهُ أكْبَرُ كَبِيْرًا، وَالْحَمْدُ لِلهِ كَثِيْرًا، وَسُبْحَانَ اللهِ بُكْرَةً وَّاصِيْلًا. أعُوْذُ بِاللهِ مِنَ الشَّيْطَانِ: مِنْ نَفْخِهِ، وَنَفْثِهِ، وَهَمْزِهِ. اللَّهُمَّ رَبَّ جَبْرَائِيلَ، وَمِيْكَائِيلَ، وَإِسْرَافِيْلَ، فَاطِرَ السَّمَوَاتِ وَالْأرْضِ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ أنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيْمَا كَانُوا فِيْهِ يَخْتَلِفُونَ، اِهْدِنِيْ لِمَا اخْتُلِفَ فِيْهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِيْ مَنْ تَشَاءُ إِلَى صِرَاطٍ مُّسْتَقِيْمٍ. وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمَوَاتِ وَالْأرْضَ حَنِيْفًا وَّمَا أنَا مِنَ الْمُشْرِكِيْنَ، إِنَّ صَلَاتِيْ، وَنُسُكِيْ، وَمَحْيَايَ، وَمَمَاتِيْ لِلهِ رَبِّ الْعَالَمِيْنَ، لَا شَرِيْكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَانَا مِنَ الْمُسْلِمِيْنَ، اللهم أنْتَ الْمَلِكُ لَا إِلَهَ إِلَّا أنْتَ، أنْتَ رَبِّيْ وَأنَا عَبْدُكَ، ظَلَمْتُ نَفْسِيْ وَاعْتَرَفْتُ بِذَنْبِيْ فَاغْفِرْ لِيْ ذُنُوْبِيْ جَمِيْعًا إِنَّهُ لَا يَغْفِرُ الذُّنوبَ إِلَّا أنْتَ. وَاهْدِنِيْ لِأحْسَنِ الْأخْلَاقِ لَا يَهْدِيْ لِأحْسَنِهَا إِلَّا أنْتَ، وَاصْرِفْ عَنِّيْ سَيِّئَهَا، لَا يَصْرِفُ عَنِّيْ سَيِّئَهَا إِلَّا أنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْسَ إِلَيْكَ، أنَا بِكَ وَإِلَيْكَ، تَبارَكْتَ وَتَعَالَيْتَ، أسْتَغْفِرُكَ وَأتُوْبُ إِلَيْكَ.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'أدعية استفتاح الصلاة اللَّهُمَّ بَاعِدْ بَيْنِيْ وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللهم نَقِّنِيْ مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الْأبْيَضُ مِنَ الدَّنَسِ، اللهم اغْسِلْنِيْ مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْمَاءِ والْبَرَدِ. سُبْحَانَكَ سُبْحَانَكَ اللهم وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلَا إِلَهَ غَيْرُكَ. الْحَمْدُ الْحَمْدُ للّهِ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ. اللهُ أكْبَرُ كَبِيْرًا، وَالْحَمْدُ لِلهِ كَثِيْرًا، وَسُبْحَانَ اللهِ بُكْرَةً وَّاصِيْلًا. أعُوْذُ بِاللهِ مِنَ الشَّيْطَانِ: مِنْ نَفْخِهِ، وَنَفْثِهِ، وَهَمْزِهِ. اللَّهُمَّ رَبَّ جَبْرَائِيلَ، وَمِيْكَائِيلَ، وَإِسْرَافِيْلَ، فَاطِرَ السَّمَوَاتِ وَالْأرْضِ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ أنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيْمَا كَانُوا فِيْهِ يَخْتَلِفُونَ، اِهْدِنِيْ لِمَا اخْتُلِفَ فِيْهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِيْ مَنْ تَشَاءُ إِلَى صِرَاطٍ مُّسْتَقِيْمٍ. وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمَوَاتِ وَالْأرْضَ حَنِيْفًا وَّمَا أنَا مِنَ الْمُشْرِكِيْنَ، إِنَّ صَلَاتِيْ، وَنُسُكِيْ، وَمَحْيَايَ، وَمَمَاتِيْ لِلهِ رَبِّ الْعَالَمِيْنَ، لَا شَرِيْكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَانَا مِنَ الْمُسْلِمِيْنَ، اللهم أنْتَ الْمَلِكُ لَا إِلَهَ إِلَّا أنْتَ، أنْتَ رَبِّيْ وَأنَا عَبْدُكَ، ظَلَمْتُ نَفْسِيْ وَاعْتَرَفْتُ بِذَنْبِيْ فَاغْفِرْ لِيْ ذُنُوْبِيْ جَمِيْعًا إِنَّهُ لَا يَغْفِرُ الذُّنوبَ إِلَّا أنْتَ. وَاهْدِنِيْ لِأحْسَنِ الْأخْلَاقِ لَا يَهْدِيْ لِأحْسَنِهَا إِلَّا أنْتَ، وَاصْرِفْ عَنِّيْ سَيِّئَهَا، لَا يَصْرِفُ عَنِّيْ سَيِّئَهَا إِلَّا أنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْسَ إِلَيْكَ، أنَا بِكَ وَإِلَيْكَ، تَبارَكْتَ وَتَعَالَيْتَ، أسْتَغْفِرُكَ وَأتُوْبُ إِلَيْكَ.',
  ),
  const AthkarEntity(
    name:
        'أدعية الركوع سُبْحانَ رَبِّيَ الْعَظِيْمِ. ثلاث مراتٍ أو أكثر. سُبْحَانَ رَبِّيَ العَظِيمِ وَبِحَمْدِهِ. ثلاث مراتٍ. سُبحانَكَ اللّهمَّ ربَّنا وَبِحمدِكَ، اللّهمَّ اغفِرْ لي. سُبُّوُحٌ، قُدُّوسٌ، رَبُّ المَلَائِكَةِ وَالرُّوْحِ. سُبْحَانَ ذِيْ الْجَبَرُوْتِ، وَالْمَلَكُوْتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ. اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، خَشَعَ لَكَ سَمْعِي وَبَصَرِي، وَمُخِّي وَعَظْمِي وَعَصَبِي.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'أدعية الركوع سُبْحانَ رَبِّيَ الْعَظِيْمِ. ثلاث مراتٍ أو أكثر. سُبْحَانَ رَبِّيَ العَظِيمِ وَبِحَمْدِهِ. ثلاث مراتٍ. سُبحانَكَ اللّهمَّ ربَّنا وَبِحمدِكَ، اللّهمَّ اغفِرْ لي. سُبُّوُحٌ، قُدُّوسٌ، رَبُّ المَلَائِكَةِ وَالرُّوْحِ. سُبْحَانَ ذِيْ الْجَبَرُوْتِ، وَالْمَلَكُوْتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ. اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، خَشَعَ لَكَ سَمْعِي وَبَصَرِي، وَمُخِّي وَعَظْمِي وَعَصَبِي.',
  ),
  const AthkarEntity(
    name:
        'أدعية الرفع من الركوع سَمِعَ اللهُ لِمَنْ حَمِدَهُ. رَبَّنَا وَلَكَ الْحَمْدُ، حَمْدًا كَثِيْرًا طَيِّبًا مُبارَكًا فِيْهِ. اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ اسْلَمْتُ، خَشَعَ لَكَ سَمْعِيْ، و بَصَـرِيْ، وَمُخِّيْ، وَعَظْمِيْ، وَعَصَبِيْ، وَمَا استَقَلَّتْ بِهِ قَدَمِيْ لِلهِ رَبِّ الْعَالَمِيْنَ. اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَاوَاتِ وَمِلْءَ الْارْضِ، وَمَا بَيْنَهُمَا، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ، أهْلَ الثَّنَاءِ وَالْمَجْدِ، أحَقُّ مَا قَالَ الْعَبْدُ، وَكُلُّنَا لَكَ عَبْدٌ، اللهم لَا مَانِعَ لِمَا أعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الجَدِّ مِنْكَ الْجَدُّ. اللَّهُمَّ لَكَ الْحَمْدُ مِلْءَ السَّمَاءِ، وَمِلْءَ الْارْضِ، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ، اللَّهُمَّ طَهِّرْنِي بِالثَّلْجِ وَالْبَرَدِ، وَالْمَاءِ الْبَارِدِ، اللَّهُمَّ طَهِّرْنِي مِنَ الذُّنُوبِ وَالْخَطَايَا، كَمَا يُنَقَّى الثَّوْبُ الْابْيَضُ مِنَ الْوَسَخِ.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'أدعية الرفع من الركوع سَمِعَ اللهُ لِمَنْ حَمِدَهُ. رَبَّنَا وَلَكَ الْحَمْدُ، حَمْدًا كَثِيْرًا طَيِّبًا مُبارَكًا فِيْهِ. اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ اسْلَمْتُ، خَشَعَ لَكَ سَمْعِيْ، و بَصَـرِيْ، وَمُخِّيْ، وَعَظْمِيْ، وَعَصَبِيْ، وَمَا استَقَلَّتْ بِهِ قَدَمِيْ لِلهِ رَبِّ الْعَالَمِيْنَ. اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَاوَاتِ وَمِلْءَ الْارْضِ، وَمَا بَيْنَهُمَا، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ، أهْلَ الثَّنَاءِ وَالْمَجْدِ، أحَقُّ مَا قَالَ الْعَبْدُ، وَكُلُّنَا لَكَ عَبْدٌ، اللهم لَا مَانِعَ لِمَا أعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الجَدِّ مِنْكَ الْجَدُّ. اللَّهُمَّ لَكَ الْحَمْدُ مِلْءَ السَّمَاءِ، وَمِلْءَ الْارْضِ، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ، اللَّهُمَّ طَهِّرْنِي بِالثَّلْجِ وَالْبَرَدِ، وَالْمَاءِ الْبَارِدِ، اللَّهُمَّ طَهِّرْنِي مِنَ الذُّنُوبِ وَالْخَطَايَا، كَمَا يُنَقَّى الثَّوْبُ الْابْيَضُ مِنَ الْوَسَخِ.',
  ),
  const AthkarEntity(
    name:
        'أدعية السجود سُبْحَانَ رَبِّيَ الأَعْلَى. ثلاث مرات أو أكثر. سُبْحَانَ رَبِّيَ الأعْلَى وَبِحَمْدِهِ. ثلاث مرات. سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلاَئِكَةِ وَالرُّوحِ. سُبحانَكَ اللّهمَّ ربَّنا وَبِحمدِكَ، اللّهمَّ اغفِرْ لي. سُبْحَانَ ذِي الْجَبْرُوتِ وَالْمَلَكُوتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ. اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلاَنِيَتَهُ وَسِرَّهُ. اللَّهُمَّ لَكَ سَجَدْتُّ وَبِكَ آمَنْتُ، وَلَكَ أسْلَمْتُ، سَجَدَ وَجْهِي لِلَّذِيْ خَلَقَهُ، وَصَوَّرَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللهُ أحْسَنُ الْخَالِقيْنَ. اللَّهُمَّ إِنِّيْ أعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقوْبَتِكَ، وَأعُوْذُ بِكَ مِنْكَ، لَا أُحْصِـي ثَنَاءً عَلَيْكَ، أنْتَ كَمَا أثْنَيْتَ عَلَى نَفْسِكَ. رَبِّ اعْطِ نَفْسِي تَقْوَاهَا زَكِّهَا أنْتَ خَيْرُ مَنْ زَكَّاهَا أنْتَ وَلِيُّهَا وَمَوْلَاهَا. اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا وَاجْعَلْ فِيْ سَمْعِيْ نُورًا وَاجْعَلْ فِيْ بَصَرِيْ نُورًا وَاجْعَلْ مِنْ تَحْتِي نُورًا وَاجْعَلْ مِنْ فَوْقِي نُورًا وَعَنْ يَمِينِي نُورًا وَعَنْ يَسَارِي نُورًا وَاجْعَلْ أمَامِي نُورًا وَاجْعَلْ خَلْفِي نُورًا وَأعْظِمْ لِيْ نُورًا.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description:
        'بعد أن يختار أحد أدعية السجود ، يسن له أن يدعوا بما شاء ،لأن "أقرب ما يكون العبد من ربه وهو ساجد، فأكثروا الدعاء".',
    content:
        'أدعية السجود سُبْحَانَ رَبِّيَ الأَعْلَى. ثلاث مرات أو أكثر. سُبْحَانَ رَبِّيَ الأعْلَى وَبِحَمْدِهِ. ثلاث مرات. سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلاَئِكَةِ وَالرُّوحِ. سُبحانَكَ اللّهمَّ ربَّنا وَبِحمدِكَ، اللّهمَّ اغفِرْ لي. سُبْحَانَ ذِي الْجَبْرُوتِ وَالْمَلَكُوتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ. اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلاَنِيَتَهُ وَسِرَّهُ. اللَّهُمَّ لَكَ سَجَدْتُّ وَبِكَ آمَنْتُ، وَلَكَ أسْلَمْتُ، سَجَدَ وَجْهِي لِلَّذِيْ خَلَقَهُ، وَصَوَّرَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللهُ أحْسَنُ الْخَالِقيْنَ. اللَّهُمَّ إِنِّيْ أعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقوْبَتِكَ، وَأعُوْذُ بِكَ مِنْكَ، لَا أُحْصِـي ثَنَاءً عَلَيْكَ، أنْتَ كَمَا أثْنَيْتَ عَلَى نَفْسِكَ. رَبِّ اعْطِ نَفْسِي تَقْوَاهَا زَكِّهَا أنْتَ خَيْرُ مَنْ زَكَّاهَا أنْتَ وَلِيُّهَا وَمَوْلَاهَا. اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا وَاجْعَلْ فِيْ سَمْعِيْ نُورًا وَاجْعَلْ فِيْ بَصَرِيْ نُورًا وَاجْعَلْ مِنْ تَحْتِي نُورًا وَاجْعَلْ مِنْ فَوْقِي نُورًا وَعَنْ يَمِينِي نُورًا وَعَنْ يَسَارِي نُورًا وَاجْعَلْ أمَامِي نُورًا وَاجْعَلْ خَلْفِي نُورًا وَأعْظِمْ لِيْ نُورًا.',
  ),
  const AthkarEntity(
    name:
        'أدعية الجلوس بين السجدتين رَبِّ رَبِّ اغْفِرْ لِيْ، رَبِّ اغْفِرْ لِيْ. اللَّهُمَّ اغْفِرْ لِيْ، وَارْحَمْنِيْ، وَاهْدِنِيْ، وَاجْبُرْنِيْ، وَعَافِنِيْ، وَارْزُقْنِيْ، وَارْفَعْنِيْ.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: 'كان النبي صلى الله عليه وسلم يطيل هذا الركن بقدر السجود.',
    content:
        'أدعية الجلوس بين السجدتين رَبِّ رَبِّ اغْفِرْ لِيْ، رَبِّ اغْفِرْ لِيْ. اللَّهُمَّ اغْفِرْ لِيْ، وَارْحَمْنِيْ، وَاهْدِنِيْ، وَاجْبُرْنِيْ، وَعَافِنِيْ، وَارْزُقْنِيْ، وَارْفَعْنِيْ.',
  ),
  const AthkarEntity(
    name:
        'دعاء سجود التلاوة سَجَدَ وَجْهِيَ للَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وبَصَرَهُ، بِحَوْلِهِ وَقُوَّتِهِ، فَتَبَارَكَ اللَّهُ أَحْسَنُ الْـخَالِقِينَ. اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أجْراً، وَضَعْ عَنِّي بِهَا وِزْرَاً، واْجعَلْهَا لِي عِنْدِكَ ذُخْراً، وتَقَبَّلَهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'دعاء سجود التلاوة سَجَدَ وَجْهِيَ للَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وبَصَرَهُ، بِحَوْلِهِ وَقُوَّتِهِ، فَتَبَارَكَ اللَّهُ أَحْسَنُ الْـخَالِقِينَ. اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أجْراً، وَضَعْ عَنِّي بِهَا وِزْرَاً، واْجعَلْهَا لِي عِنْدِكَ ذُخْراً، وتَقَبَّلَهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ.',
  ),
  const AthkarEntity(
    name:
        'التشهد الأول التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: 'وردت صيغ أخرى للتشهد قريبة من هذا.',
    content:
        'التشهد الأول التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ.',
  ),
  const AthkarEntity(
    name:
        'التشهد الأخير التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين ، أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله. اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد ، اللهم بارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'التشهد الأخير التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين ، أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله. اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد ، اللهم بارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد.',
  ),
  const AthkarEntity(
    name:
        'أدعية بعد التشهد الأخير وقبل السلام اللَّهُمَّ إِنِّيْ أعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيْحِ الدَّجَّالِ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ. وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ. وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَم ِ. اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً ، وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ. فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ. اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ. وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ. وَمَا أَسْرَفْتُ. وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي. أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ. لاَ إِلهَ إِلاَّ أَنْتَ. رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ. اللَّهُمَّ إِنِّيْ أسْألُكَ الْجَنَّةَ وَأعُوْذُ بِكَ مِنَ النَّارِ. اللَّهُمَّ إِنِّيْ أسْألُكَ يَا أللهُ بِأنَّكَ الْوَاحِدُ الْأحَدُ الصَّمَدُ الَّذِيْ لَمْ يَلِدْ وَلَمْ يُوْلَدْ، وَلَمْ يَكنْ لَهُ كُفُوًا أحَدٌ، أنْ تَغْفِرَ لِيْ ذُنُوْبِيْ إِنَّكَ أنْتَ الْغَفُوْرُ الرَّحِيْمُ. اللَّهُمَّ حَاسِبْنِيْ حِسَابَاً يَسِيراً. اللَّهُمَّ إِنِّيْ أسْألُكَ بِأنَّ لَكَ الْحَمْدُ لَا إِلَهَ إِلَّا أنْتَ وَحْدَكَ لَا شَرِيْكَ لَكَ، الْمَنَّانُ، يَا بَدِيعَ السَّمَوَاتِ وَالْارْضِ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ، يَا حَيُّ يَا قَيُّومُ إِنِّيْ أسْألُكَ الْجَنَّةَ وَأعُوْذُ بِكَ مِنَ النَّارِ. اللَّهُمَّ إِنِّيْ أسْألُكَ بِأنَّيْ أشْهَدُ أنَّكَ أنْتَ اللهُ لَا إِلَهَ إِلَّا أنْتَ الْأحَدُ الصَّمَدُ الَّذِيْ لَمْ يَلِدْ وَلَمْ يُوْلَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أحَدٌ. اللَّهُمَّ بِعِلْمِكَ الغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ أحْيِنِيْ مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِيْ، وَتَوَفَّنِيْ إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِيْ، اللهم إِنِّيْ أسْألُكَ خَشْيَتَكَ فِيْ الْغَيْبِ وَالشَّهَادَةِ، وَأسْألُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأسْألُكَ الْقَصْدَ فِيْ الْغِنَى وَالْفَقْرِ، وَأسْألُكَ نَعِيْمًا لَا يَنْفَدُ، وَأسْألُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعُ، وَأسْألُكَ الرِّضَا بَعْدَ الْقَضَاءِ، وَأسْألُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأسْألُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقائِكَ فِيْ غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلَا فِتْنَةٍ مُضِلَّةٍ، اللهم زَيِّنَّا بِزِينَةِ الْإِيْمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِيْنَ.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'أدعية بعد التشهد الأخير وقبل السلام اللَّهُمَّ إِنِّيْ أعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيْحِ الدَّجَّالِ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ. وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ. وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَم ِ. اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً ، وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ. فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ. اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ. وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ. وَمَا أَسْرَفْتُ. وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي. أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ. لاَ إِلهَ إِلاَّ أَنْتَ. رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ. اللَّهُمَّ إِنِّيْ أسْألُكَ الْجَنَّةَ وَأعُوْذُ بِكَ مِنَ النَّارِ. اللَّهُمَّ إِنِّيْ أسْألُكَ يَا أللهُ بِأنَّكَ الْوَاحِدُ الْأحَدُ الصَّمَدُ الَّذِيْ لَمْ يَلِدْ وَلَمْ يُوْلَدْ، وَلَمْ يَكنْ لَهُ كُفُوًا أحَدٌ، أنْ تَغْفِرَ لِيْ ذُنُوْبِيْ إِنَّكَ أنْتَ الْغَفُوْرُ الرَّحِيْمُ. اللَّهُمَّ حَاسِبْنِيْ حِسَابَاً يَسِيراً. اللَّهُمَّ إِنِّيْ أسْألُكَ بِأنَّ لَكَ الْحَمْدُ لَا إِلَهَ إِلَّا أنْتَ وَحْدَكَ لَا شَرِيْكَ لَكَ، الْمَنَّانُ، يَا بَدِيعَ السَّمَوَاتِ وَالْارْضِ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ، يَا حَيُّ يَا قَيُّومُ إِنِّيْ أسْألُكَ الْجَنَّةَ وَأعُوْذُ بِكَ مِنَ النَّارِ. اللَّهُمَّ إِنِّيْ أسْألُكَ بِأنَّيْ أشْهَدُ أنَّكَ أنْتَ اللهُ لَا إِلَهَ إِلَّا أنْتَ الْأحَدُ الصَّمَدُ الَّذِيْ لَمْ يَلِدْ وَلَمْ يُوْلَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أحَدٌ. اللَّهُمَّ بِعِلْمِكَ الغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ أحْيِنِيْ مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِيْ، وَتَوَفَّنِيْ إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِيْ، اللهم إِنِّيْ أسْألُكَ خَشْيَتَكَ فِيْ الْغَيْبِ وَالشَّهَادَةِ، وَأسْألُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأسْألُكَ الْقَصْدَ فِيْ الْغِنَى وَالْفَقْرِ، وَأسْألُكَ نَعِيْمًا لَا يَنْفَدُ، وَأسْألُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعُ، وَأسْألُكَ الرِّضَا بَعْدَ الْقَضَاءِ، وَأسْألُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأسْألُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقائِكَ فِيْ غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلَا فِتْنَةٍ مُضِلَّةٍ، اللهم زَيِّنَّا بِزِينَةِ الْإِيْمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِيْنَ.',
  ),
  const AthkarEntity(
    name:
        'دعاء القنوت اللَّهُمَّ اهْدِني فيمَنْ هدَيْت، وعَافِنِي فيمَنْ عافيتَ، وتَوَلَّني فيمن تَولَّيت، وبارِك لي فيمَا أعطيت، وقِني شرَّ ما قَضَيْت، فإنَّك تقضي ولا يُقْضَى عَليك، إنَّه لا يَذلُّ من واليت، تباركت ربنا وتعاليت. اللَّهُمَّ إني أعُوذُ بِرضَاك من سَخَطِك وأعُوذُ بمُعافاتك مِنْ عُقوبَتِك، وأعُوذُ بِكَ مِنْكَ لا أُحْصِي ثناءً عليكَ، أنْتَ كما أثنيت على نفسك. اللَّهُمَّ إيَّاك نعبُدُ، ولك نُصلِّي ونسجُدُ، وإليك نسعَى ونَحْفِد، نرجُو رحمتك، ونخشى عذابَكَ، إنَّ عذابَكَ بالكافرين مُلْحِقٌ، اللَّهُمَّ إنَّا نستعينُكَ، ونستغفرك، ونُثْنِي عليكَ الخيرَ، ولا نَكْفُرُك، ونُؤمِنُ بِكَ ونَخْضَعُ لَك، ونَخْلَعُ من يكفُرُك. اللَّهُمَّ تَقَبَّلْ مِنَّا إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ وَتُبْ عَلَيْنَآ إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ. وَصَلَّى اللهُ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلى آلِهِ وَصَحْبِهِ وَسَلمَ.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description:
        'دعاء القنوت يكون في الركعة الأخيرة من صلاة الوتر بعد الركوع ، وإذا جعله قبل الركوع فلا بأس ، إلا أنه بعد الركوع أفضل ، ويرفع يديه إلى صدره ولا يرفعها كثيرا . القنوت عند النوازل سنة في جميع الصلوات الخمس وهو في صلاة المغرب والفجر آكد.',
    content:
        'دعاء القنوت اللَّهُمَّ اهْدِني فيمَنْ هدَيْت، وعَافِنِي فيمَنْ عافيتَ، وتَوَلَّني فيمن تَولَّيت، وبارِك لي فيمَا أعطيت، وقِني شرَّ ما قَضَيْت، فإنَّك تقضي ولا يُقْضَى عَليك، إنَّه لا يَذلُّ من واليت، تباركت ربنا وتعاليت. اللَّهُمَّ إني أعُوذُ بِرضَاك من سَخَطِك وأعُوذُ بمُعافاتك مِنْ عُقوبَتِك، وأعُوذُ بِكَ مِنْكَ لا أُحْصِي ثناءً عليكَ، أنْتَ كما أثنيت على نفسك. اللَّهُمَّ إيَّاك نعبُدُ، ولك نُصلِّي ونسجُدُ، وإليك نسعَى ونَحْفِد، نرجُو رحمتك، ونخشى عذابَكَ، إنَّ عذابَكَ بالكافرين مُلْحِقٌ، اللَّهُمَّ إنَّا نستعينُكَ، ونستغفرك، ونُثْنِي عليكَ الخيرَ، ولا نَكْفُرُك، ونُؤمِنُ بِكَ ونَخْضَعُ لَك، ونَخْلَعُ من يكفُرُك. اللَّهُمَّ تَقَبَّلْ مِنَّا إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ وَتُبْ عَلَيْنَآ إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ. وَصَلَّى اللهُ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلى آلِهِ وَصَحْبِهِ وَسَلمَ.',
  ),
  const AthkarEntity(
    name:
        'دعاء خطبة الجمعة ربناَّ  لا تزغ قلوبنا بعد إذ هديتنا وهب لنا من لدنك رحمة انك أنت الوهاب وأصلح اللهم أحوالنا في الأمور كلها وبلغنا بما يرضيك أمالنا واختم اللهم بالصالحات أعمالنا وبالسعادة أجالنا وتوفنا يا رب وأنت راض عنا. اللَّهُمَّ اجعل جمعنا هذا جمعا مباركا مرحوما وتفرقنا من كل شر معصوما. ربنا لا تدع لنا ذنبا إلا غفرته ولا هما إلا فرجته ولا مريضا إلا شفيته ولا ميتا إلا رحمته ولا طالبا أمرا من أمور الخير إلا سهلته له ويسرته. اللَّهُمَّ وحد كلمة المسلمين واجمع شملهم واجعلهم يدا واحدة على من سواهم وانصر اللهم المسلمين واخذل الكفرة المشركين أعدائك أعداء الدين. اللَّهُمَّ إنا نسألك لولاة أمورنا الصلاح والسداد. اللَّهُمَّ كن لهم عونا وخذ بأيديهم إلى الحق والصواب والسداد والرشاد ووفقهم للعمل لما فيه رضاك وما فيه صالح العباد والبلاد. اللَّهُمَّ إنا نسألك لبلدنا هذا اللهم اجعله بلدا ءامنا وارزقه من كل الخيرات وجنبه الفتن ما ظهر منها وما بطن وألف اللهم ما بين قلوبنا وبين قلوب أبناء هذا الوطن واجعلهم اللهم يا ربنا باسمك متحابين وعلى نصرة دينك متعاونين. اللَّهُمَّ إنا نستعيذ بك من شر ما خلقت ومن كل عين حاسد و نسألك اللهم التوفيق والسداد والهداية والرشاد وحسن العقبى وحسن الميعاد. اللَّهُمَّ أسبغ علينا نعمتك وعلى جميع المسلمين واملء اللهم قلوبنا بالإيمان والقناعة والزم جوارحنا العبادة والطاعة واغفر اللهم لنا ولوالدينا ولإخواننا وأشياخنا ولجميع من سبقنا بالإيمان واتنا من لدنك رحمة وهيئ لنا من امرنا رشدا واتنا ربنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار. سبحان ربك رب العزة عما يصفون وسلام على المرسلين والحمد لله رب العالمين.',
    quantity: 1,
    quantityText: 'مرة واحدة',
    description: '',
    content:
        'دعاء خطبة الجمعة ربناَّ  لا تزغ قلوبنا بعد إذ هديتنا وهب لنا من لدنك رحمة انك أنت الوهاب وأصلح اللهم أحوالنا في الأمور كلها وبلغنا بما يرضيك أمالنا واختم اللهم بالصالحات أعمالنا وبالسعادة أجالنا وتوفنا يا رب وأنت راض عنا. اللَّهُمَّ اجعل جمعنا هذا جمعا مباركا مرحوما وتفرقنا من كل شر معصوما. ربنا لا تدع لنا ذنبا إلا غفرته ولا هما إلا فرجته ولا مريضا إلا شفيته ولا ميتا إلا رحمته ولا طالبا أمرا من أمور الخير إلا سهلته له ويسرته. اللَّهُمَّ وحد كلمة المسلمين واجمع شملهم واجعلهم يدا واحدة على من سواهم وانصر اللهم المسلمين واخذل الكفرة المشركين أعدائك أعداء الدين. اللَّهُمَّ إنا نسألك لولاة أمورنا الصلاح والسداد. اللَّهُمَّ كن لهم عونا وخذ بأيديهم إلى الحق والصواب والسداد والرشاد ووفقهم للعمل لما فيه رضاك وما فيه صالح العباد والبلاد. اللَّهُمَّ إنا نسألك لبلدنا هذا اللهم اجعله بلدا ءامنا وارزقه من كل الخيرات وجنبه الفتن ما ظهر منها وما بطن وألف اللهم ما بين قلوبنا وبين قلوب أبناء هذا الوطن واجعلهم اللهم يا ربنا باسمك متحابين وعلى نصرة دينك متعاونين. اللَّهُمَّ إنا نستعيذ بك من شر ما خلقت ومن كل عين حاسد و نسألك اللهم التوفيق والسداد والهداية والرشاد وحسن العقبى وحسن الميعاد. اللَّهُمَّ أسبغ علينا نعمتك وعلى جميع المسلمين واملء اللهم قلوبنا بالإيمان والقناعة والزم جوارحنا العبادة والطاعة واغفر اللهم لنا ولوالدينا ولإخواننا وأشياخنا ولجميع من سبقنا بالإيمان واتنا من لدنك رحمة وهيئ لنا من امرنا رشدا واتنا ربنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار. سبحان ربك رب العزة عما يصفون وسلام على المرسلين والحمد لله رب العالمين.',
  ),
];
final List<AthkarEntity> allAthkarEntities = [
  const AthkarEntity(
      name:
          'اللَّهُمَّ يَا بَارِئَ البَرِيَّاتِ ، وَغَافِرَ الخَـطِيَّاتِ ، وَعَالِمَ الخَفِيَّاتِ ، المُطَّلِعُ عَلَى الضَّمَائِرِ وَالنِّيَّاتِ ، يَا مَنْ أَحَاطَ بِكُلِّ شَيءٍ عِلْماً ، وَوَسِعَ كُلّ شَيْءٍ رَحْمَةً ، وَقَهَرَ كُلّ مَخْلُوقٍ عِزَّةً وَحُكْماً ، اغْفِرْ لِي ذُنُوبِي ، وَاسْتُرْ عُيُوبِيَ ، وَتَجَاوَزْ عَنْ سَيِّئَاتِيَ إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ. اللَّهُمَّ يَا سَمِيعَ الدَّعَوَاتِ ، يَا مُقِيلَ العَثَرَاتِ ، يَاقَاضِيَ الحَاجَاتِ ، يَا كَاشِفَ الكَرُبَاتِ ، يَا رَفِيعَ الدَّرَجَاتِ ، وَيَا غَافِرَ الزَّلاَّتِ ، اغْفِرْ لِلْمُسْلِمِينَ وَالمُسْلِمَاتِ ، وَالمُؤْمِنِينَ وَالمُؤْمِنَاتِ، الأحْيَاءِ مِنْهُم وَالأمْوَاتِ ، إِنَّكَ سَمِيعٌ قَرِيبٌ مُجِيبُ الدَّعَوَاتِ. اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الأَعْظَمِ ، الَّذِي إِذَا دُعِيتَ بِهِ أَجَبْتَ ، وَإِذَا سُئِلْتَ بِهِ أَعْطَـيْتَ ، أَسْأَلُكَ بِأَنِّي أَشُهَدُ أَنَّكَ أَنْتَ اللهُ لا إِلَهَ إِلاَّ أَنْتَ ، الأَحَدُ الصَّمَدُ ، الَّذِي لَمْ يَلِدْ، وَلَمْ يَولَدْ ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ؛ أَنْ تَغْفِرَ لِي ذُنُوبِي ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ. اللَّهُمَّ إِنَّكَ عَفُوٌّ كَرِيمٌ تُحِبُّ العّفْوَ فَاعْفُ عَنِّي. اللَّهُمَّ رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالمُؤْمِنَاتِ.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ يَا بَارِئَ البَرِيَّاتِ ، وَغَافِرَ الخَـطِيَّاتِ ، وَعَالِمَ الخَفِيَّاتِ ، المُطَّلِعُ عَلَى الضَّمَائِرِ وَالنِّيَّاتِ ، يَا مَنْ أَحَاطَ بِكُلِّ شَيءٍ عِلْماً ، وَوَسِعَ كُلّ شَيْءٍ رَحْمَةً ، وَقَهَرَ كُلّ مَخْلُوقٍ عِزَّةً وَحُكْماً ، اغْفِرْ لِي ذُنُوبِي ، وَاسْتُرْ عُيُوبِيَ ، وَتَجَاوَزْ عَنْ سَيِّئَاتِيَ إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ. اللَّهُمَّ يَا سَمِيعَ الدَّعَوَاتِ ، يَا مُقِيلَ العَثَرَاتِ ، يَاقَاضِيَ الحَاجَاتِ ، يَا كَاشِفَ الكَرُبَاتِ ، يَا رَفِيعَ الدَّرَجَاتِ ، وَيَا غَافِرَ الزَّلاَّتِ ، اغْفِرْ لِلْمُسْلِمِينَ وَالمُسْلِمَاتِ ، وَالمُؤْمِنِينَ وَالمُؤْمِنَاتِ، الأحْيَاءِ مِنْهُم وَالأمْوَاتِ ، إِنَّكَ سَمِيعٌ قَرِيبٌ مُجِيبُ الدَّعَوَاتِ. اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الأَعْظَمِ ، الَّذِي إِذَا دُعِيتَ بِهِ أَجَبْتَ ، وَإِذَا سُئِلْتَ بِهِ أَعْطَـيْتَ ، أَسْأَلُكَ بِأَنِّي أَشُهَدُ أَنَّكَ أَنْتَ اللهُ لا إِلَهَ إِلاَّ أَنْتَ ، الأَحَدُ الصَّمَدُ ، الَّذِي لَمْ يَلِدْ، وَلَمْ يَولَدْ ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ؛ أَنْ تَغْفِرَ لِي ذُنُوبِي ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ. اللَّهُمَّ إِنَّكَ عَفُوٌّ كَرِيمٌ تُحِبُّ العّفْوَ فَاعْفُ عَنِّي. اللَّهُمَّ رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالمُؤْمِنَاتِ.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي ، وَإِسْرَافِي فِي أَمْرِي ، وَمَا أَنْتَ أَعْـلَمُ بِهِ مِنّـِي ، اللَّهُمَّ اغْفِرْ لِي هَزْلِي وَجِدِّي ، وَخَطَئِي وَعَمْدِي ، وَكُلُّ ذَلِكَ عِنْدِي. اللَّهُمَّ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي. اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَااسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي فَإنَّهُ لا يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ. اللَّهُمَّ اغْفِرْ لِي ، وَارْحَمْنِي وَاهْدِنِي ، وَعَافِنِي وَارْزُقْنِي ، وَاجْبُرْنِي ، وَارْفَعْنِي. اللَّهُمَّ يَا مَنْ لا تَضُرُّهُ الذُّنُوبُ ، وَلا تُنْقِصُهُ المَغْفِرَةُ ، اغْفِرْ لَنَا مَا لا يَضُرُّكَ ، وَهَبْ لَنَا مَالا يُنْقِصُكَ.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي ، وَإِسْرَافِي فِي أَمْرِي ، وَمَا أَنْتَ أَعْـلَمُ بِهِ مِنّـِي ، اللَّهُمَّ اغْفِرْ لِي هَزْلِي وَجِدِّي ، وَخَطَئِي وَعَمْدِي ، وَكُلُّ ذَلِكَ عِنْدِي. اللَّهُمَّ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي. اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَااسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي فَإنَّهُ لا يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ. اللَّهُمَّ اغْفِرْ لِي ، وَارْحَمْنِي وَاهْدِنِي ، وَعَافِنِي وَارْزُقْنِي ، وَاجْبُرْنِي ، وَارْفَعْنِي. اللَّهُمَّ يَا مَنْ لا تَضُرُّهُ الذُّنُوبُ ، وَلا تُنْقِصُهُ المَغْفِرَةُ ، اغْفِرْ لَنَا مَا لا يَضُرُّكَ ، وَهَبْ لَنَا مَالا يُنْقِصُكَ.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلّهُ ، دِقَّهُ وَجُلَّهُ ، وَأَوَّلَهُ وَآخِرَهَ ، وَعَلاَنِيَتَهَ وَسِرَّهُ. اللَّهُمَّ إِنَّ ذُنُوبِي عِظَامٌ وَهِي صِغَارٌ فِي جَنْبِ عَفْوِكَ يَا كَرِيمُ ، فَاغْفِرْهَا لِي. اللَّهُمَّ اغْفِرْ لِي ذَنْبِي ، وَوَسِّعْ لِي فِي دَارِي ، وَبَارِكْ لِي فِي رِزْقِي. اللَّهُمَّ رَبَّنَا لا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا ، رَبَّنَا وَلا تَحْمِلْ عَلَينَا إِصْرَاً كَمَا حَمَلْتَهَ عَلَى الَّذِينَ مِنْ قَبْلِنَا ، رَبَّنَا وَلا تُحَمِّلْنَا مَا لا طَاقَةَ لَنَا بِهِ ، وَاعْفُ عَنَّا وّاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلانَا فَانْصُرْنَا عَلَى القَوْمِ الكَافِرِينَ. اللَّهُمَّ إِنَّا قَدْ أَطَعْنَاكَ فِي أَحَبِّ الأشْيَاءِ إِلَيْكَ أَنْ تُطَاعَ فِيْهِ ، الإيمَانِ بِكَ ، وَالإِقْرَارِ بِكَ ، وَلَمْ نَعْصِكَ فِي أَبْغَضِ الأَشْيَاءِ أَنْ تُعْصَى فِيْهِ ؛ الكُفْرِ وَالجَحْدِ بِكَ ، اللَّهُمَّ فَاغْفِرْ لَنَا مَا بَيْنَهُمَا.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلّهُ ، دِقَّهُ وَجُلَّهُ ، وَأَوَّلَهُ وَآخِرَهَ ، وَعَلاَنِيَتَهَ وَسِرَّهُ. اللَّهُمَّ إِنَّ ذُنُوبِي عِظَامٌ وَهِي صِغَارٌ فِي جَنْبِ عَفْوِكَ يَا كَرِيمُ ، فَاغْفِرْهَا لِي. اللَّهُمَّ اغْفِرْ لِي ذَنْبِي ، وَوَسِّعْ لِي فِي دَارِي ، وَبَارِكْ لِي فِي رِزْقِي. اللَّهُمَّ رَبَّنَا لا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا ، رَبَّنَا وَلا تَحْمِلْ عَلَينَا إِصْرَاً كَمَا حَمَلْتَهَ عَلَى الَّذِينَ مِنْ قَبْلِنَا ، رَبَّنَا وَلا تُحَمِّلْنَا مَا لا طَاقَةَ لَنَا بِهِ ، وَاعْفُ عَنَّا وّاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلانَا فَانْصُرْنَا عَلَى القَوْمِ الكَافِرِينَ. اللَّهُمَّ إِنَّا قَدْ أَطَعْنَاكَ فِي أَحَبِّ الأشْيَاءِ إِلَيْكَ أَنْ تُطَاعَ فِيْهِ ، الإيمَانِ بِكَ ، وَالإِقْرَارِ بِكَ ، وَلَمْ نَعْصِكَ فِي أَبْغَضِ الأَشْيَاءِ أَنْ تُعْصَى فِيْهِ ؛ الكُفْرِ وَالجَحْدِ بِكَ ، اللَّهُمَّ فَاغْفِرْ لَنَا مَا بَيْنَهُمَا.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ ، وَمَا أَعْلَنْتُ وَمَا أَسْرَرْتُ ، وما أنت أعلم به مني ، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ لا إِلَهَ إِلاَّ أَنْـتَ. اللَّهُمَّ رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأَبْرَارِ. اللَّهُمَّ رَبَّنَا اغْفِرْ لَنَا وَلإخْوَانِنَا الَّذِينَ سَبَقُونَا بِالإِيْمَانِ ، رَبَّنَا وَسِعْتَ كُلّ شَيءٍ رَحْمَةً وَعِلْماً فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَاب الجَحِيمِ. اللَّهُمَّ أَقِلْ عَثَرَاتِنَا ، وَاغْفِرْ زَلاَّتِنَا ، وَكَفِّرْ عَنَّا سَيِّئَاتِنَا ، وَتَوَفَّنَا مَعَ الأَبْرَارِ. اللَّهُمَّ بَاعِدْ بَيْنِي وَبَينَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ المَشْرِقِ وَالمَغْرِبْ ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ بِالمَاءِ وَالثَّلْجِ وَالبَرَدِ ، اللَّهُمَّ نَقِّنِي مِنْ الخَطَايَا كَمَا يُنَقَّى الثَّوبُ الأَبْيَضُ مِـنَ الدَّنَسِ.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ ، وَمَا أَعْلَنْتُ وَمَا أَسْرَرْتُ ، وما أنت أعلم به مني ، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ لا إِلَهَ إِلاَّ أَنْـتَ. اللَّهُمَّ رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأَبْرَارِ. اللَّهُمَّ رَبَّنَا اغْفِرْ لَنَا وَلإخْوَانِنَا الَّذِينَ سَبَقُونَا بِالإِيْمَانِ ، رَبَّنَا وَسِعْتَ كُلّ شَيءٍ رَحْمَةً وَعِلْماً فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَاب الجَحِيمِ. اللَّهُمَّ أَقِلْ عَثَرَاتِنَا ، وَاغْفِرْ زَلاَّتِنَا ، وَكَفِّرْ عَنَّا سَيِّئَاتِنَا ، وَتَوَفَّنَا مَعَ الأَبْرَارِ. اللَّهُمَّ بَاعِدْ بَيْنِي وَبَينَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ المَشْرِقِ وَالمَغْرِبْ ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ بِالمَاءِ وَالثَّلْجِ وَالبَرَدِ ، اللَّهُمَّ نَقِّنِي مِنْ الخَطَايَا كَمَا يُنَقَّى الثَّوبُ الأَبْيَضُ مِـنَ الدَّنَسِ.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظلْماً كَثِيراً ، وَلا يَغْفِرُ الذُّنُوب إِلاَّ أَنْتَ. فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدَكَ ، وَارْحَمْنِي إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ. اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللهُ بِأَنَّكَ الوَاحِدُ الأَحَدُ ، الصَّمَدُ ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ ، أَنْ تَغْفِرَ لِي ذُنُـوبِي ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ. اللَّهُمَّ إِلَهِي : حُجَّتِي حَاجَتِي ، وَعُدَّتِي فَاقَتِي ، فَارْحَمْنِي. اللَّهُمَّ إِلَهِي : كَيْفَ أمْتَنِعُ بِالذَّنْبِ مِنَ الدُّعَاءِ ، وَلا أَرَاكَ تَمْنَعُ مَعَ الذَّنْبِ مِنَ العَطَاءِ ، فَإِنْ غَفَرْتَ فَخَيرُ رَاحِمٍ أَنْتَ ، وَإِنْ عَذَّبْتَ فَغَيْرُ ظَالِمٍ أَنْتَ. اللَّهُمَّ إِلَهِي: أَسْأَلُكَ تَذَلُّلاً فَأَعْطِنِي تَفَضُّلاً.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظلْماً كَثِيراً ، وَلا يَغْفِرُ الذُّنُوب إِلاَّ أَنْتَ. فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدَكَ ، وَارْحَمْنِي إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ. اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللهُ بِأَنَّكَ الوَاحِدُ الأَحَدُ ، الصَّمَدُ ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ ، أَنْ تَغْفِرَ لِي ذُنُـوبِي ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ. اللَّهُمَّ إِلَهِي : حُجَّتِي حَاجَتِي ، وَعُدَّتِي فَاقَتِي ، فَارْحَمْنِي. اللَّهُمَّ إِلَهِي : كَيْفَ أمْتَنِعُ بِالذَّنْبِ مِنَ الدُّعَاءِ ، وَلا أَرَاكَ تَمْنَعُ مَعَ الذَّنْبِ مِنَ العَطَاءِ ، فَإِنْ غَفَرْتَ فَخَيرُ رَاحِمٍ أَنْتَ ، وَإِنْ عَذَّبْتَ فَغَيْرُ ظَالِمٍ أَنْتَ. اللَّهُمَّ إِلَهِي: أَسْأَلُكَ تَذَلُّلاً فَأَعْطِنِي تَفَضُّلاً.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ يَامَنْ عَلَى العَرْشِ اسْتَوَى ، يَامَنْ خَلَقَ فَسَوَّى وَقدَّرَ فَهَدَى ، وَأَعْطَى كُلّ شَيءٍ خَلْقَهُ ثُمَّ هَدَى ، يَامَنْ أَضْحَكَ وَأَبْكَى، وَأَمَاتَ وَأَحْيَا ، وَأَسْعَدَ وَأَشْقَى ، وَأَوْجَدَ وَأَبْلَى ، وَرَفَعَ وَخَفَضَ ، وَأَعَزَّ وَأَذَلَّ، وَأَعْطَى وَمَنَعَ ، وَرَفَعَ وَوَضَعَ. اللَّهُمَّ يَا مَنْ شَقَّ البِحَارَ ، وَأَجْرَى الأَنْهَارَ ، وَكَوَّرَ النَّهَارَ عَلَى اللَّيلِ وَاللَّيلَ عَلَى النَّهَارِ ، يَا مَنْ هَدَى مِنْ ضَلالَةٍ ، وَأَنْقَذَ مِنْ جَهَالَةٍ ، وَأَنَارَ الأَبْصَارَ ، وَأَحْيَا الضَّمَائِرَ وَالأَفْكَارَ. اللَّهُمَّ اهْدِنَا فِيمَنْ هَدَيْتَ ، وَعَافِنَا فِيمَنْ عَافَيتَ ، وَتَوَلَّنَا فِيمَنْ تَوَلَّيْتَ. اللَّهُمَّ اهْدِنَا الصِّرَاطَ المُسْتَقِيمَ ، صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيهِم مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ. اللَّهُمَّ وَفِّقْنَا لِهُدَاكَ وَاجْعَلْ عَمَلَنَا فِي رِضَاكَ.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ يَامَنْ عَلَى العَرْشِ اسْتَوَى ، يَامَنْ خَلَقَ فَسَوَّى وَقدَّرَ فَهَدَى ، وَأَعْطَى كُلّ شَيءٍ خَلْقَهُ ثُمَّ هَدَى ، يَامَنْ أَضْحَكَ وَأَبْكَى، وَأَمَاتَ وَأَحْيَا ، وَأَسْعَدَ وَأَشْقَى ، وَأَوْجَدَ وَأَبْلَى ، وَرَفَعَ وَخَفَضَ ، وَأَعَزَّ وَأَذَلَّ، وَأَعْطَى وَمَنَعَ ، وَرَفَعَ وَوَضَعَ. اللَّهُمَّ يَا مَنْ شَقَّ البِحَارَ ، وَأَجْرَى الأَنْهَارَ ، وَكَوَّرَ النَّهَارَ عَلَى اللَّيلِ وَاللَّيلَ عَلَى النَّهَارِ ، يَا مَنْ هَدَى مِنْ ضَلالَةٍ ، وَأَنْقَذَ مِنْ جَهَالَةٍ ، وَأَنَارَ الأَبْصَارَ ، وَأَحْيَا الضَّمَائِرَ وَالأَفْكَارَ. اللَّهُمَّ اهْدِنَا فِيمَنْ هَدَيْتَ ، وَعَافِنَا فِيمَنْ عَافَيتَ ، وَتَوَلَّنَا فِيمَنْ تَوَلَّيْتَ. اللَّهُمَّ اهْدِنَا الصِّرَاطَ المُسْتَقِيمَ ، صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيهِم مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ. اللَّهُمَّ وَفِّقْنَا لِهُدَاكَ وَاجْعَلْ عَمَلَنَا فِي رِضَاكَ.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ أَرِنَا الحَقَّ حقَّاً وَارْزُقْنَا اتِّبَاعَهُ، وَأَرِنَا البَاطِلَ بَاطِلاً وَارْزُقْنَا اجْتِنَابَهُ. اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا ، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلاهَا. اللَّهُمَّ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلّ شَيءٍ قَدِيرٌ. اللَّهُمَّ حَبِّبْ إلَينَا الإيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا ، وَكَرِّهِ إلَينَا الكُفْرَ وَالفُسُوقَ وَالعِصْيَانِ ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ. اللَّهُمَّ مُصَرِّفَ القُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ أَرِنَا الحَقَّ حقَّاً وَارْزُقْنَا اتِّبَاعَهُ، وَأَرِنَا البَاطِلَ بَاطِلاً وَارْزُقْنَا اجْتِنَابَهُ. اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا ، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلاهَا. اللَّهُمَّ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلّ شَيءٍ قَدِيرٌ. اللَّهُمَّ حَبِّبْ إلَينَا الإيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا ، وَكَرِّهِ إلَينَا الكُفْرَ وَالفُسُوقَ وَالعِصْيَانِ ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ. اللَّهُمَّ مُصَرِّفَ القُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ خُذْ بِنَوَاصِينَا لِِلْبِرِّ وَالتَّقْوَى ، وَلِمَا تُحِبُّ مِنَ العَمَلِ وَتَرْضَى. اللَّهُمَّ رَبِّ جِبْرَائِيلَ وَمِيكَائِيلَ ، وَإسْرَافِيلَ ، فَاطِرَ السَّمَاوَاتِ وَالأَرْضَ ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ ، أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيْهِ يَخْتَلِفُونَ ، اهْدِنَا لِمَا اخْتُلِفَ فِيْهِ مِنَ الحَقِّ بِإذْنِكَ ، إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ. اللَّهُمَّ إِنِّي عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ ، نَاصِيَتِي بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤكَ ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ ، سَمَّيتَ بِهِ نَفْسَكَ ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ ، أَوْ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيبِ عِنْدَكَ ، أَنْ تَجْعَلَ القُرْآنَ رَبِيعَ قَلْبِي ، وَنُورَ صَدْرِي ، وَجَلاءَ حَزَنِي ، وَذَهَابَ هَمِّي. اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوراً ، وَفِي سَمْعِي نُوراً ، وَفِي بَصَرِي نُوراً ، وَعَنْ يَمِينِي نُوراً ، وَعَنْ شِمَالِي نُوراً ، وَمِنْ بَيْنَ يَدَيَّ نُوراً ، وَمِنْ خَلْفِي نُوراً ، وَمِنْ فَوقِي نُوراً ، وَمِنْ تَحْتِي نُوراً ، وَاجْعَلْ لِي نُوراً ، وَأَعْظِمْ لِي نُوراً. اللَّهُمَّ أَغْنِنِي بِالعِلْمِ ، وَزَيِّنِّي بِالحِلْمِ ، وَأَكْرِمْنِي بِالتَّقْوَى ، وَجَمِّلْنِي بِالعَافِيَةِ.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ خُذْ بِنَوَاصِينَا لِِلْبِرِّ وَالتَّقْوَى ، وَلِمَا تُحِبُّ مِنَ العَمَلِ وَتَرْضَى. اللَّهُمَّ رَبِّ جِبْرَائِيلَ وَمِيكَائِيلَ ، وَإسْرَافِيلَ ، فَاطِرَ السَّمَاوَاتِ وَالأَرْضَ ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ ، أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيْهِ يَخْتَلِفُونَ ، اهْدِنَا لِمَا اخْتُلِفَ فِيْهِ مِنَ الحَقِّ بِإذْنِكَ ، إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ. اللَّهُمَّ إِنِّي عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ ، نَاصِيَتِي بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤكَ ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ ، سَمَّيتَ بِهِ نَفْسَكَ ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ ، أَوْ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيبِ عِنْدَكَ ، أَنْ تَجْعَلَ القُرْآنَ رَبِيعَ قَلْبِي ، وَنُورَ صَدْرِي ، وَجَلاءَ حَزَنِي ، وَذَهَابَ هَمِّي. اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوراً ، وَفِي سَمْعِي نُوراً ، وَفِي بَصَرِي نُوراً ، وَعَنْ يَمِينِي نُوراً ، وَعَنْ شِمَالِي نُوراً ، وَمِنْ بَيْنَ يَدَيَّ نُوراً ، وَمِنْ خَلْفِي نُوراً ، وَمِنْ فَوقِي نُوراً ، وَمِنْ تَحْتِي نُوراً ، وَاجْعَلْ لِي نُوراً ، وَأَعْظِمْ لِي نُوراً. اللَّهُمَّ أَغْنِنِي بِالعِلْمِ ، وَزَيِّنِّي بِالحِلْمِ ، وَأَكْرِمْنِي بِالتَّقْوَى ، وَجَمِّلْنِي بِالعَافِيَةِ.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ ثَبِّتْنِي وَاجْعَلْنِي هَادِياً مَهْدِيّاً. اللَّهُمَّ لَكَ أَسْلَمْتُ ، وَبِكَ آمَنْتُ ، وَعَلَيكَ تَوَكَّلْتُ ، وَإِلَيكَ أَنَبْتُ ، وَبِكَ خَاصَمْتُ، أَعُوذُ بِعِزَّتِكَ ، لا إِلَهَ إِلاَّ أَنْتَ ، أَنْ تُضِلَّنِي ، أَنْتَ الحَيُّ الَّذِي لا يَمُوتُ ، وَالجِنُّ وَالإنْسُ يَمُوتُونَ. اللَّهُمَّ اهْدِنِي لأَحْسَنِ الأَخْلاَقِ لا يَهْدِي لأَحْسَنِهَا إِلاَّ أَنْتَ ، وَاصْرِفْ عَنِّي سَيِّئَها لا يَصْرِفُ عَنِّي سَيِّئَهَا إِلاَّ أَنْتَ. اللَّهُمَّ كَمَا أَحْسَنْتَ خَلْقِي فَأَحْسِنْ خُلُقِي. اللَّهُمَّ فَالِقَ الحَبِّ وَالنَّوَى ، وَمُخْرِجَ الحَيِّ مِنَ المَيِّتِ وَمُخْرِجَ المَيِّتِ مِنَ الحَيِّ ، فَالِقَ الإِصْبَاحِ ، وَجَاعِلَ اللَّيلِ سَكَناً ، وَالشَّمْسَ والقَمَرَ حُسْبَاناً ، يَا مَنْ جَعَلَ لَنَا النُّجُومَ لِنَهْتَدِيَ بِهَا فِي ظُلُمَاتِ الْبَرِّ وَالبَحْرِ.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ ثَبِّتْنِي وَاجْعَلْنِي هَادِياً مَهْدِيّاً. اللَّهُمَّ لَكَ أَسْلَمْتُ ، وَبِكَ آمَنْتُ ، وَعَلَيكَ تَوَكَّلْتُ ، وَإِلَيكَ أَنَبْتُ ، وَبِكَ خَاصَمْتُ، أَعُوذُ بِعِزَّتِكَ ، لا إِلَهَ إِلاَّ أَنْتَ ، أَنْ تُضِلَّنِي ، أَنْتَ الحَيُّ الَّذِي لا يَمُوتُ ، وَالجِنُّ وَالإنْسُ يَمُوتُونَ. اللَّهُمَّ اهْدِنِي لأَحْسَنِ الأَخْلاَقِ لا يَهْدِي لأَحْسَنِهَا إِلاَّ أَنْتَ ، وَاصْرِفْ عَنِّي سَيِّئَها لا يَصْرِفُ عَنِّي سَيِّئَهَا إِلاَّ أَنْتَ. اللَّهُمَّ كَمَا أَحْسَنْتَ خَلْقِي فَأَحْسِنْ خُلُقِي. اللَّهُمَّ فَالِقَ الحَبِّ وَالنَّوَى ، وَمُخْرِجَ الحَيِّ مِنَ المَيِّتِ وَمُخْرِجَ المَيِّتِ مِنَ الحَيِّ ، فَالِقَ الإِصْبَاحِ ، وَجَاعِلَ اللَّيلِ سَكَناً ، وَالشَّمْسَ والقَمَرَ حُسْبَاناً ، يَا مَنْ جَعَلَ لَنَا النُّجُومَ لِنَهْتَدِيَ بِهَا فِي ظُلُمَاتِ الْبَرِّ وَالبَحْرِ.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ جَلَّتْ قُدْرَتُكَ ، وَتَعَالَتْ حِكْمَتُكَ ، وَتَبَارَكَ اسْمُكَ ، وَتَعَالَى جَدُّكَ ، وَلا إِلَهَ غَيْرُكَ. اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الحَمْدَ ، لا إِلَهَ إِلاَّ أَنْتَ ، المَنَّانُ ، بَدِيعُ السَّمَاوَات وَالأَرْضِ، ذُو الجَلالِ وَالإِكْرَامِ ، يَا حَيُّ يَا قَيُّومُ. اللَّهُمَّ ارْزُقْنَا رِزْقًا يَزِيدُنَا لَكَ شُكْراً ، وَإِلَيكَ فَاقَةً وَفَقْراً ، وَبِكَ عَمَّنْ سِوَاكَ غِنىً. اللَّهُمَّ اجْعَلْ أَوْسَعَ رِزْقِكَ عَلَيَّ عِنْدَ كِبَرِ سِنِّي ، وَانْقِطَاعِ عُمُرِي. اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَرَحْمَتِكَ فَإِنَّهُ لا يَمْلِكُهَا إِلاَّ أَنْتَ.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ جَلَّتْ قُدْرَتُكَ ، وَتَعَالَتْ حِكْمَتُكَ ، وَتَبَارَكَ اسْمُكَ ، وَتَعَالَى جَدُّكَ ، وَلا إِلَهَ غَيْرُكَ. اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الحَمْدَ ، لا إِلَهَ إِلاَّ أَنْتَ ، المَنَّانُ ، بَدِيعُ السَّمَاوَات وَالأَرْضِ، ذُو الجَلالِ وَالإِكْرَامِ ، يَا حَيُّ يَا قَيُّومُ. اللَّهُمَّ ارْزُقْنَا رِزْقًا يَزِيدُنَا لَكَ شُكْراً ، وَإِلَيكَ فَاقَةً وَفَقْراً ، وَبِكَ عَمَّنْ سِوَاكَ غِنىً. اللَّهُمَّ اجْعَلْ أَوْسَعَ رِزْقِكَ عَلَيَّ عِنْدَ كِبَرِ سِنِّي ، وَانْقِطَاعِ عُمُرِي. اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَرَحْمَتِكَ فَإِنَّهُ لا يَمْلِكُهَا إِلاَّ أَنْتَ.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ رَبِّ لا تَذَرْنِي فَرْداً وَأَنْتَ خَيْرُ الْوَارِثِينَ. اللَّهُمَّ رَبِّ هَبْ لِيْ مِنَ الصَّالِحِينَ. اللَّهُمَّ قَنِّعْنِي بِمَا رَزَقْتَنِي ، وَبَارِكْ لِي فِيْهِ ، وَاخْلُفْ عَلَيَّ كُلّ غَائِبَةٍ لِي مِنْكَ بِخَيرٍ. اللَّهُمَّ رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّة أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَاماً. اللَّهُمَّ يَا مَنْ تُسَبِّحُ لَهُ السَّمَاوَاتُ بِنُجُومِهَا وَأَبْرَاجِهَا ، وَالأَرْضُ بِسُهُولِـــهَا وَفِجَاجِهَا ، وَالبِحَارُ بِأَحْيَائِهَا وَأَمْوَاجِهَا ، وَالجِبَالُ بِقِمَمِهَا وَأَوْتَادِهَا ، وَالأَشْجَارُ بِفُرُوعِهَا وَثِمَارِهَا ، وَالسِّبَاعُ فِي فَلَوَاتِهَا ، وَالطَّيْرُ فِي وَكَنَاتِهَا ، يَا مَنْ تُسَبِّحُ لَهُ الذَّرَّاتُ عَلَى صِغََرِهَا ، وَالمَجَرَّاتُ عَلَى كِبَرِهَـا ، يَا مَنْ تُسَبِّحُ لَهُ السَّمَاوَاتُ السَّبْعُ وَالأَرْضُ وَمَنْ فِيهِنَّ ، وِإنْ مِنْ شَيءٍ إِلاَّ يُسَبِّحُ بِحَمْدِه.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ رَبِّ لا تَذَرْنِي فَرْداً وَأَنْتَ خَيْرُ الْوَارِثِينَ. اللَّهُمَّ رَبِّ هَبْ لِيْ مِنَ الصَّالِحِينَ. اللَّهُمَّ قَنِّعْنِي بِمَا رَزَقْتَنِي ، وَبَارِكْ لِي فِيْهِ ، وَاخْلُفْ عَلَيَّ كُلّ غَائِبَةٍ لِي مِنْكَ بِخَيرٍ. اللَّهُمَّ رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّة أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَاماً. اللَّهُمَّ يَا مَنْ تُسَبِّحُ لَهُ السَّمَاوَاتُ بِنُجُومِهَا وَأَبْرَاجِهَا ، وَالأَرْضُ بِسُهُولِـــهَا وَفِجَاجِهَا ، وَالبِحَارُ بِأَحْيَائِهَا وَأَمْوَاجِهَا ، وَالجِبَالُ بِقِمَمِهَا وَأَوْتَادِهَا ، وَالأَشْجَارُ بِفُرُوعِهَا وَثِمَارِهَا ، وَالسِّبَاعُ فِي فَلَوَاتِهَا ، وَالطَّيْرُ فِي وَكَنَاتِهَا ، يَا مَنْ تُسَبِّحُ لَهُ الذَّرَّاتُ عَلَى صِغََرِهَا ، وَالمَجَرَّاتُ عَلَى كِبَرِهَـا ، يَا مَنْ تُسَبِّحُ لَهُ السَّمَاوَاتُ السَّبْعُ وَالأَرْضُ وَمَنْ فِيهِنَّ ، وِإنْ مِنْ شَيءٍ إِلاَّ يُسَبِّحُ بِحَمْدِه.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ يَا مَنْ خَلَقَ الأَرْضَ وَالسَّمَاوَاتِ العُلَى ، يَا رَحْمَاناً عَلَى العَرْشِ اسْتَوَى ، يَا مَنْ لَهُ مَا فِي السَّمَاوَات وَمَا فِي الأَرْضِ وَمَا بَيْنَهُمَا ، وَمَا تَحْتَ الثَّرَى ، يَا مَنْ يَعْلَمُ السِّرَ وَأَخْفَى، يَا مَنْ لَهُ الأَسْمَاءُ الحُسْنَى ، يَا مَنْ مَعَ عِبَادِهِ يَسْمَعُ وَيَرَى ، يَا مَنْ أَعْطَى كُلّ شَيءٍ خَلْقَهُ ثُمَّ هَدَى. اللَّهُمَّ أَنْتَ البَادِئُ بِالإِحْسَانِ مِنْ قَبْلِ تَوَجُّهِ العَابِدِينَ ، وَأَنْتَ البَادِئُ بِالعَطَايَا قَبْلَ طَلَبِ الطَّالِبِينَ وَأَنْتَ الوَهَّابُ. اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّة وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ وَعَمَلٍ ، وَأَعُوذُ بِكَ مَنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ وَعَمَلٍ. اللَّهُمَّ رَبِّ ابْنِ لِي عِنْدَكَ بَيْتاً فِي الجَنَّةِ. اللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالجَنَّةَ ، وَأَعُوذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ يَا مَنْ خَلَقَ الأَرْضَ وَالسَّمَاوَاتِ العُلَى ، يَا رَحْمَاناً عَلَى العَرْشِ اسْتَوَى ، يَا مَنْ لَهُ مَا فِي السَّمَاوَات وَمَا فِي الأَرْضِ وَمَا بَيْنَهُمَا ، وَمَا تَحْتَ الثَّرَى ، يَا مَنْ يَعْلَمُ السِّرَ وَأَخْفَى، يَا مَنْ لَهُ الأَسْمَاءُ الحُسْنَى ، يَا مَنْ مَعَ عِبَادِهِ يَسْمَعُ وَيَرَى ، يَا مَنْ أَعْطَى كُلّ شَيءٍ خَلْقَهُ ثُمَّ هَدَى. اللَّهُمَّ أَنْتَ البَادِئُ بِالإِحْسَانِ مِنْ قَبْلِ تَوَجُّهِ العَابِدِينَ ، وَأَنْتَ البَادِئُ بِالعَطَايَا قَبْلَ طَلَبِ الطَّالِبِينَ وَأَنْتَ الوَهَّابُ. اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّة وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ وَعَمَلٍ ، وَأَعُوذُ بِكَ مَنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ وَعَمَلٍ. اللَّهُمَّ رَبِّ ابْنِ لِي عِنْدَكَ بَيْتاً فِي الجَنَّةِ. اللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالجَنَّةَ ، وَأَعُوذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ أَحْسِنْ عَاقِبَتِنَا فِي الأُمُورِ كُلِّهَا ، وَأَجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الآخِرَةِ. اللَّهُمَّ رَبَّنَا اصْرِفْ عَنَّا عَذَاب جَهَنَّم إِنَّ عَذَابَهَا كَانَ غَرَاماً. اللَّهُمَّ رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَاب النَّارِ. اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّةَ ، وَأسْتَجِيرُ بِكَ مِنَ النَّارِ. اللَّهُمَّ رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَى رُسِلِكَ وَلا تُخْزِنَا يَومَ القِيامَة إِنَّكَ لا تُخْلِفُ المِيعَادِ.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ أَحْسِنْ عَاقِبَتِنَا فِي الأُمُورِ كُلِّهَا ، وَأَجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الآخِرَةِ. اللَّهُمَّ رَبَّنَا اصْرِفْ عَنَّا عَذَاب جَهَنَّم إِنَّ عَذَابَهَا كَانَ غَرَاماً. اللَّهُمَّ رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَاب النَّارِ. اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّةَ ، وَأسْتَجِيرُ بِكَ مِنَ النَّارِ. اللَّهُمَّ رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَى رُسِلِكَ وَلا تُخْزِنَا يَومَ القِيامَة إِنَّكَ لا تُخْلِفُ المِيعَادِ.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ حَاسِبْنِي حِسَاباً يَسِيراً. اللَّهُمَّ إِنَّا نَعُوذُ بِكَ أَنْ نُشْرِكَ بِكَ شَيْئاً نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لا نَعْلَمُهُ. اللَّهُمَّ إنِّيْ أعُوذُ بِكَ مِنْ جَهْدِ البَلاء ، ودَرَكِ الشّــَقَاء ، وســوء القضاء ، وشَمَاتَة الأعْدَاء ، يَا سَمِيْع الدُّعَاء. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ ، وَمِنْ عَذَابِ القَبْرِ ، وَمِنْ فِتْنَةِ المَحْيَا وَالمَمَـاتِ ، وَمِنْ فِتْنَةِ المَسِيحِ الدَّجَّالِ ، وَأَعُوذُ بِكَ مِنَ المَأْثَمِ وَالمَغْرَمِ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ ، وَفِتْنَةِ القَبْرِ ، وَعَذَابِ القَبْرِ ، وَشَرِّ فِتْنَةِ الغِنَى ، وَشَرِّ فِتْنَةِ الفَقْرِ ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ فِتْنَةِ المَسِيحِ الدَّجَّالِ.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ حَاسِبْنِي حِسَاباً يَسِيراً. اللَّهُمَّ إِنَّا نَعُوذُ بِكَ أَنْ نُشْرِكَ بِكَ شَيْئاً نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لا نَعْلَمُهُ. اللَّهُمَّ إنِّيْ أعُوذُ بِكَ مِنْ جَهْدِ البَلاء ، ودَرَكِ الشّــَقَاء ، وســوء القضاء ، وشَمَاتَة الأعْدَاء ، يَا سَمِيْع الدُّعَاء. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ ، وَمِنْ عَذَابِ القَبْرِ ، وَمِنْ فِتْنَةِ المَحْيَا وَالمَمَـاتِ ، وَمِنْ فِتْنَةِ المَسِيحِ الدَّجَّالِ ، وَأَعُوذُ بِكَ مِنَ المَأْثَمِ وَالمَغْرَمِ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ ، وَفِتْنَةِ القَبْرِ ، وَعَذَابِ القَبْرِ ، وَشَرِّ فِتْنَةِ الغِنَى ، وَشَرِّ فِتْنَةِ الفَقْرِ ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ فِتْنَةِ المَسِيحِ الدَّجَّالِ.'),
  const AthkarEntity(
      name:
          'اللهم اغسل قلبي بماء الثلج والبرد ، ونق قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس ، وباعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب. اللهم إني أعوذ بك من الكسل والمأثم والمغرم. اللهم رب جبرائيل ، وميكائيل ، ورب إسرافيل ، أعوذ بك من حر النار ومن عذاب القبر. اللهم إني أعوذ بك من جار السوء في دار المقامة ، فإن جار البادية يتحول. اللهم إني أعوذ بك من العجز والكسل ، والجبن والبخل ، والهرم والقسوة ، والغفلة والعيلة والذلة ، والمسكنة ، وأعوذ بك من الفقر والكفر ، والفسوق والشقاق والنفاق، والسمعة والرياء ، وأعوذ بك من الصمم والبكم ، والجنون ، والجذام ، والبرص ، وسيئ الأسقام.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللهم اغسل قلبي بماء الثلج والبرد ، ونق قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس ، وباعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب. اللهم إني أعوذ بك من الكسل والمأثم والمغرم. اللهم رب جبرائيل ، وميكائيل ، ورب إسرافيل ، أعوذ بك من حر النار ومن عذاب القبر. اللهم إني أعوذ بك من جار السوء في دار المقامة ، فإن جار البادية يتحول. اللهم إني أعوذ بك من العجز والكسل ، والجبن والبخل ، والهرم والقسوة ، والغفلة والعيلة والذلة ، والمسكنة ، وأعوذ بك من الفقر والكفر ، والفسوق والشقاق والنفاق، والسمعة والرياء ، وأعوذ بك من الصمم والبكم ، والجنون ، والجذام ، والبرص ، وسيئ الأسقام.'),
  const AthkarEntity(
      name:
          'اللهم إني أعوذ بك من العجز والكسل ، والجبن ، والبخل ، والهرم ، وعذاب القبر، اللهم آت نفسي تقواها ، وزكها أنت خير من زكاها ، أنت وليها ومولاها. اللهم إني أعوذ بك من علم لا ينفع ، ومن قلب لا يخشع ، ومن نفس لا تشبع ، ومن دعوة لا يستجاب لها. اللهم إني أعوذ بك من منكرات الأخلاق والأعمال والأهواء والأدواء. اللهم إني أعوذ بك أن تحسن في لوائح العيون علانيتي ، وتقبح في خفيات العيون سريرتي ، اللهم كما أسأت وأحسنت إلي ، فإذا عدت فعد علي. اللهم إني أعوذ بك من شر سمـعي ، ومن شر بصــري ، ومن شــر لسـاني ، ومن شر قـلـبي ، ومن شـر منيي.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللهم إني أعوذ بك من العجز والكسل ، والجبن ، والبخل ، والهرم ، وعذاب القبر، اللهم آت نفسي تقواها ، وزكها أنت خير من زكاها ، أنت وليها ومولاها. اللهم إني أعوذ بك من علم لا ينفع ، ومن قلب لا يخشع ، ومن نفس لا تشبع ، ومن دعوة لا يستجاب لها. اللهم إني أعوذ بك من منكرات الأخلاق والأعمال والأهواء والأدواء. اللهم إني أعوذ بك أن تحسن في لوائح العيون علانيتي ، وتقبح في خفيات العيون سريرتي ، اللهم كما أسأت وأحسنت إلي ، فإذا عدت فعد علي. اللهم إني أعوذ بك من شر سمـعي ، ومن شر بصــري ، ومن شــر لسـاني ، ومن شر قـلـبي ، ومن شـر منيي.'),
  const AthkarEntity(
      name:
          'اللهم إني أعوذ بك أن أقول زورا ، أو أغشى فجورا ، أو أكون بك مغرورا. اللهم إني أعوذ بك من الشقاق والنفاق ، وسوء الأخلاق. اللهم إني أعوذ برضاك من سخطك ، وبمعافاتك من عقوبتك ، وبك منك ، لا أحصى ثناء عليك ، أنت كما أثنيت على نفسك. اللهم رب السماوات السبع ورب الأرض ، ورب العرش العظيم ، ربنا ورب كل شيء ، فالق الحب والنوى ، ومنزل التوراة والإنجيل والفرقان ، أعوذ بك من شر كل شيء أنت آخذ بناصيته ، اللهم أنت الأول فليس قبلك شيء ، وأنت الآخر فليس بعدك شيء ، وأنت الظاهر فليس فوقك شيء ، اقض عنا الدين وأغننا من الفقر. اللهم إني أعوذ بك من غلبة الدين ، وغلبة العدو ، وشماتة الأعداء.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللهم إني أعوذ بك أن أقول زورا ، أو أغشى فجورا ، أو أكون بك مغرورا. اللهم إني أعوذ بك من الشقاق والنفاق ، وسوء الأخلاق. اللهم إني أعوذ برضاك من سخطك ، وبمعافاتك من عقوبتك ، وبك منك ، لا أحصى ثناء عليك ، أنت كما أثنيت على نفسك. اللهم رب السماوات السبع ورب الأرض ، ورب العرش العظيم ، ربنا ورب كل شيء ، فالق الحب والنوى ، ومنزل التوراة والإنجيل والفرقان ، أعوذ بك من شر كل شيء أنت آخذ بناصيته ، اللهم أنت الأول فليس قبلك شيء ، وأنت الآخر فليس بعدك شيء ، وأنت الظاهر فليس فوقك شيء ، اقض عنا الدين وأغننا من الفقر. اللهم إني أعوذ بك من غلبة الدين ، وغلبة العدو ، وشماتة الأعداء.'),
  const AthkarEntity(
      name:
          'اللهم إني أعوذ بك من الفقر والقلة والذلة ، وأعوذ بك من أن أظلم أو أظلم. اللهم إني أعوذ بك من شر فتنة الغنى ، ومن شر فتنة الفقر. اللهم إني أعوذ بك من زوال نعمتك ، وتحول عافيتك ، وفجاءة نقمتك ، وجميع سخطك. اللهم إني أعوذ بك من يوم السوء ، ومن ليلة السوء ، ومن ساعة السوء ، ومن صاحب السوء ، ومن جار السوء ، في دار المقامة. اللهم إني أعوذ بك من قلب لا يخشع ، ومن دعاء لا يسمع ، ومن نفس لا تشبع ، ومن علم لا ينفع ، أعوذ بك من هؤلاء الأربع.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللهم إني أعوذ بك من الفقر والقلة والذلة ، وأعوذ بك من أن أظلم أو أظلم. اللهم إني أعوذ بك من شر فتنة الغنى ، ومن شر فتنة الفقر. اللهم إني أعوذ بك من زوال نعمتك ، وتحول عافيتك ، وفجاءة نقمتك ، وجميع سخطك. اللهم إني أعوذ بك من يوم السوء ، ومن ليلة السوء ، ومن ساعة السوء ، ومن صاحب السوء ، ومن جار السوء ، في دار المقامة. اللهم إني أعوذ بك من قلب لا يخشع ، ومن دعاء لا يسمع ، ومن نفس لا تشبع ، ومن علم لا ينفع ، أعوذ بك من هؤلاء الأربع.'),
  const AthkarEntity(
      name:
          'اللهم إني أعوذ بك من التـردي ، والهدم ، والغرق ، والحرق وأعوذ بك أن يتخبطني الشيطان عند الموت ، وأعوذ بك من أن أموت في سبيلك مدبرا ، وأعوذ بك أن أموت لديغا. اللهم رب أعوذ بك من همزات الشياطين ، وأعوذ بك رب أن يحضرون. اللهم إني أعوذ بك من شر الأشرار ، ومن كيد الفجار ، ومن طوارق الليل والنهار إلا طارقا يطرق بخير يا رحمن. اللهم رب أعوذ بك من أعين العائنين ، ومن سحر الساحرين ، ومن شر كل ذي شر. اللهم إني أعوذ بك من الجوع ، فإنه بئس الضجيع ، وأعوذ بك من الخيانة ، فإنها بئست البطانة.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللهم إني أعوذ بك من التـردي ، والهدم ، والغرق ، والحرق وأعوذ بك أن يتخبطني الشيطان عند الموت ، وأعوذ بك من أن أموت في سبيلك مدبرا ، وأعوذ بك أن أموت لديغا. اللهم رب أعوذ بك من همزات الشياطين ، وأعوذ بك رب أن يحضرون. اللهم إني أعوذ بك من شر الأشرار ، ومن كيد الفجار ، ومن طوارق الليل والنهار إلا طارقا يطرق بخير يا رحمن. اللهم رب أعوذ بك من أعين العائنين ، ومن سحر الساحرين ، ومن شر كل ذي شر. اللهم إني أعوذ بك من الجوع ، فإنه بئس الضجيع ، وأعوذ بك من الخيانة ، فإنها بئست البطانة.'),
  const AthkarEntity(
      name:
          'اللهم إني أعوذ بك من عقوق الأبناء ، ومن قطيعة الأقرباء ، ومن جفوة الأحياء ، ومن تغير الأصدقاء ، ومن شماتة الأعداء. اللهم إني أعوذ بك من أن أزل أو أزل ، أو أضل أو أضل ، أو أظلم أو أظلم ، أو أجهل أو يجهل علي. اللهم إنا نستعينك ونستهديك، ونستغفرك ونتوب إليك ونؤمن بك ، ونتوكل عليك ، ونثني عليك الخير كله ، نشكرك ولا نكفرك ، ونخلع ونترك من يفجرك ، اللهم إياك نعبد ، ولك نصلي ونسجد ، وإليك نسعى ونحفد ، نرجو رحمتك ، ونخشى عذابك ، إن عذابك الجد بالكفار ملحق. اللهم ربنا أعزنا بالإسلام ، وأعز بنا الإسلام ، اللهم أعل بنا كلمة الإسلام ، وارفع بنا راية القرآن. اللهم منزل الكتاب ، ومجري السحاب وهازم الأحزاب ، عالم الغيب والشهادة أسألك باسمك الأعظم الذي إذا دعيت به أجبت وإذا سئلت به أعطيت.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللهم إني أعوذ بك من عقوق الأبناء ، ومن قطيعة الأقرباء ، ومن جفوة الأحياء ، ومن تغير الأصدقاء ، ومن شماتة الأعداء. اللهم إني أعوذ بك من أن أزل أو أزل ، أو أضل أو أضل ، أو أظلم أو أظلم ، أو أجهل أو يجهل علي. اللهم إنا نستعينك ونستهديك، ونستغفرك ونتوب إليك ونؤمن بك ، ونتوكل عليك ، ونثني عليك الخير كله ، نشكرك ولا نكفرك ، ونخلع ونترك من يفجرك ، اللهم إياك نعبد ، ولك نصلي ونسجد ، وإليك نسعى ونحفد ، نرجو رحمتك ، ونخشى عذابك ، إن عذابك الجد بالكفار ملحق. اللهم ربنا أعزنا بالإسلام ، وأعز بنا الإسلام ، اللهم أعل بنا كلمة الإسلام ، وارفع بنا راية القرآن. اللهم منزل الكتاب ، ومجري السحاب وهازم الأحزاب ، عالم الغيب والشهادة أسألك باسمك الأعظم الذي إذا دعيت به أجبت وإذا سئلت به أعطيت.'),
  const AthkarEntity(
      name:
          'اللهم ياحي يا قيوم ، ياحي ياقيوم ، ياحي يا قيوم ، اللهم أظلني في ظل عرشك يوم لا ظل إلا ظلك. اللهم أظهر دينك على الدين كله ولو كره المشركون. اللهم يا من يجيب المضطر إذا دعاه ، ويكشف السوء ، اكشف السوء عن إخواننا الأسارى والمسجونين والمعتقلين ، اللهم افكك بقوتك أسرهم ، واجبر برحمتك كسرهم ، وتول بعنايتك أمرهم ، وردهم إلى أهليهم سالمين غانمين. اللهم كن للمسلمين والمستضعفين في كل مكان ؛ فرج همهم ، ونفس كربهم ، وأقل عثرتهم وتول بنفسك أمرهم. اللهم ارفع رايتهم ، واكبت عدوهم.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللهم ياحي يا قيوم ، ياحي ياقيوم ، ياحي يا قيوم ، اللهم أظلني في ظل عرشك يوم لا ظل إلا ظلك. اللهم أظهر دينك على الدين كله ولو كره المشركون. اللهم يا من يجيب المضطر إذا دعاه ، ويكشف السوء ، اكشف السوء عن إخواننا الأسارى والمسجونين والمعتقلين ، اللهم افكك بقوتك أسرهم ، واجبر برحمتك كسرهم ، وتول بعنايتك أمرهم ، وردهم إلى أهليهم سالمين غانمين. اللهم كن للمسلمين والمستضعفين في كل مكان ؛ فرج همهم ، ونفس كربهم ، وأقل عثرتهم وتول بنفسك أمرهم. اللهم ارفع رايتهم ، واكبت عدوهم.'),
  const AthkarEntity(
      name:
          'اللهم وحد صفهم ، واجمع كلمتهم ، وردهم إليك ردا جميلا. اللهم لا أبر بهم منك ، ولا أرحم بهم منك، ولا أرأف بهم منك.. اللهم هم منك وإليك.. اللهم فاجعل الدائرة لهم لا عليهم والنصر حليفهم.. يا رب. اللهم يا خير من سئل ، وأجود من أعطى ، وأكرم من عفا ، وأعظم من غفر ، وأعدل من حكم ، وأصدق من حدث ، وأوفى من وعد ، وأبصر من راقب ، وأسرع من حاسب ، وأرحم من عاقب ، وأحسن من خلق ، وأحكم من شرع ، وأحق من عبد ، وأولى من دعي ، وأبر من أجاب. اللهم إني أسألك خير المسألة ، وخير الدعاء ، وخير النجاح ، وخير العمل ، وخير الثواب ، وخير الحياة ، وخير الممات ، وثبتني ، وثقل موازيني ، وحقق إيماني ، وارفع درجاتي ، وتقبل صلاتي ، واغفر خطيئتي ، وأسألك الدرجات العلى من الجنة. اللهم إني أسألك فواتح الخير ، وخواتـمه ، وجوامعه ، وأوله ، وظاهره ، وباطنه ، والدرجات العلى من الجنة آمين.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللهم وحد صفهم ، واجمع كلمتهم ، وردهم إليك ردا جميلا. اللهم لا أبر بهم منك ، ولا أرحم بهم منك، ولا أرأف بهم منك.. اللهم هم منك وإليك.. اللهم فاجعل الدائرة لهم لا عليهم والنصر حليفهم.. يا رب. اللهم يا خير من سئل ، وأجود من أعطى ، وأكرم من عفا ، وأعظم من غفر ، وأعدل من حكم ، وأصدق من حدث ، وأوفى من وعد ، وأبصر من راقب ، وأسرع من حاسب ، وأرحم من عاقب ، وأحسن من خلق ، وأحكم من شرع ، وأحق من عبد ، وأولى من دعي ، وأبر من أجاب. اللهم إني أسألك خير المسألة ، وخير الدعاء ، وخير النجاح ، وخير العمل ، وخير الثواب ، وخير الحياة ، وخير الممات ، وثبتني ، وثقل موازيني ، وحقق إيماني ، وارفع درجاتي ، وتقبل صلاتي ، واغفر خطيئتي ، وأسألك الدرجات العلى من الجنة. اللهم إني أسألك فواتح الخير ، وخواتـمه ، وجوامعه ، وأوله ، وظاهره ، وباطنه ، والدرجات العلى من الجنة آمين.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ مَا آتِي ، وَخَيْرَ مَا أَفْعَلُ ، وَخَيرَ مَا أَعْمَلُ ، وَخَيْرَ مَا بَطَنَ ، وَخَيْرَ مَا ظَهَرَ ، وَالدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ آمِينَ. اللَّهُمَّ إِنِّي أَسْأَلُكَ أَنْ تَرْفَعَ ذِِكْرِي ، وَتَضَعَ وِزْرِيَ ، وَتُصْلِحَ أَمْرِيَ ، وَتُطَهِّرَ قَلـْبِيَ ، وَتُحَصِّنَ فَرْجِيَ ، وَتُنَوِّرَ قَلْبِيَ ، وَتَغْفِرَ لِي ذَنْبِيَ ، وَأَسْأَلُكَ الدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ آمِينَ. اللَّهُمَّ إِنِّي أَسْأَلُكَ أَنْ تُبَارِكَ فِي نَفْسِي ، وَفِي سَمْعِي ، وَفِي بَصَرِي ، وَفِي رُوحِي ، وَفِي خَلْقِي ، وَفِي خُلُقِي ، وَفِي أَهْلِي ، وَفِِي مَحْيَاي ، وَفِي مَمَاتِي ، وَفِي عَمَلِي ، فَتَقَبَّلْ حَسَنَاتِي ، وَأَسْأَلُكَ الدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ آمِينَ. اللَّهُمَّ لَكَ الحَمْدُ كُلُّهُ ، اللَّهُمَّ لا قَابِضَ لِمَا بَسَطْتَ ، وَلا بَاسِطَ لِمَا قَبَضْتَ ، وَلا هَادِيَ لِمَنْ أَضْلَلْتَ وَلا مُضِلَّ لِمَنْ هَدَيْتَ ، وَلا مُعْطِي لِمَا مَنَعْتَ وَلا مَانِعَ لِمَا أَعْطَيتَ ، وَلا مُقَرِّبَ رَبِّ لِمَا بَاعَدْتَ ، وَلا مُبَاعِدَ لِمَا قَرَّبْتَ ، اللَّهُمَّ ابْسُطْ عَلَينَا مِنْ بَرَكَاتِكَ وَرَحْمَتِكَ وَفَضْلِكَ وَرِزْقِكَ ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ المُقِيمَ الَّذِي لا يَحُولُ وَلا يَـزُولُ ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ يَوْمَ العَيْلَةِ وَالأَمْنِ يَوْمَ الخَوفِ ، اللَّهُمَّ إِنِّي عَائِذٌ بِكَ مِنْ شَرِّ مَا أَعْطَيْتَنَا وَشَرِّ مَا مَنَعْتَنَا. اللَّهُمَّ حَبِّبْ إِلَينَا الإِيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا وَكَرِّه إِلَيْنَا الكُفْرَ وَالفُسُوقَ وَالعِصْيانَ ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ ، اللَّهُمَّ تَوَفَّنَا مُسْـلِمِينَ ، وَأَحْينَا مُسْلِمِينَ ، وَأَلْحِقْنَا بِالصَّالِحِينَ غَيرَ خَزَايَا وَلاَ مَفْتُونِينَ ، اللَّهُمَّ قَاتِلِ الكَفَرَةَ الَّذِينَ يُكَذِّبُونَ رُسُلَكَ ، وَيَصُدُّونَ عَنْ سَبِيلِكَ ، وَاجْعَلْ عَلَيهِم رِجْزَكَ وَعَذَابَكَ ، اللَّهُمَّ قَاتِلِ الكَفَرَةَ الَّذِينَ أُوتُوا الكِتَابَ ، إِلَهَ الحَقِّ.. آمِينَ.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ مَا آتِي ، وَخَيْرَ مَا أَفْعَلُ ، وَخَيرَ مَا أَعْمَلُ ، وَخَيْرَ مَا بَطَنَ ، وَخَيْرَ مَا ظَهَرَ ، وَالدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ آمِينَ. اللَّهُمَّ إِنِّي أَسْأَلُكَ أَنْ تَرْفَعَ ذِِكْرِي ، وَتَضَعَ وِزْرِيَ ، وَتُصْلِحَ أَمْرِيَ ، وَتُطَهِّرَ قَلـْبِيَ ، وَتُحَصِّنَ فَرْجِيَ ، وَتُنَوِّرَ قَلْبِيَ ، وَتَغْفِرَ لِي ذَنْبِيَ ، وَأَسْأَلُكَ الدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ آمِينَ. اللَّهُمَّ إِنِّي أَسْأَلُكَ أَنْ تُبَارِكَ فِي نَفْسِي ، وَفِي سَمْعِي ، وَفِي بَصَرِي ، وَفِي رُوحِي ، وَفِي خَلْقِي ، وَفِي خُلُقِي ، وَفِي أَهْلِي ، وَفِِي مَحْيَاي ، وَفِي مَمَاتِي ، وَفِي عَمَلِي ، فَتَقَبَّلْ حَسَنَاتِي ، وَأَسْأَلُكَ الدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ آمِينَ. اللَّهُمَّ لَكَ الحَمْدُ كُلُّهُ ، اللَّهُمَّ لا قَابِضَ لِمَا بَسَطْتَ ، وَلا بَاسِطَ لِمَا قَبَضْتَ ، وَلا هَادِيَ لِمَنْ أَضْلَلْتَ وَلا مُضِلَّ لِمَنْ هَدَيْتَ ، وَلا مُعْطِي لِمَا مَنَعْتَ وَلا مَانِعَ لِمَا أَعْطَيتَ ، وَلا مُقَرِّبَ رَبِّ لِمَا بَاعَدْتَ ، وَلا مُبَاعِدَ لِمَا قَرَّبْتَ ، اللَّهُمَّ ابْسُطْ عَلَينَا مِنْ بَرَكَاتِكَ وَرَحْمَتِكَ وَفَضْلِكَ وَرِزْقِكَ ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ المُقِيمَ الَّذِي لا يَحُولُ وَلا يَـزُولُ ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ يَوْمَ العَيْلَةِ وَالأَمْنِ يَوْمَ الخَوفِ ، اللَّهُمَّ إِنِّي عَائِذٌ بِكَ مِنْ شَرِّ مَا أَعْطَيْتَنَا وَشَرِّ مَا مَنَعْتَنَا. اللَّهُمَّ حَبِّبْ إِلَينَا الإِيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا وَكَرِّه إِلَيْنَا الكُفْرَ وَالفُسُوقَ وَالعِصْيانَ ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ ، اللَّهُمَّ تَوَفَّنَا مُسْـلِمِينَ ، وَأَحْينَا مُسْلِمِينَ ، وَأَلْحِقْنَا بِالصَّالِحِينَ غَيرَ خَزَايَا وَلاَ مَفْتُونِينَ ، اللَّهُمَّ قَاتِلِ الكَفَرَةَ الَّذِينَ يُكَذِّبُونَ رُسُلَكَ ، وَيَصُدُّونَ عَنْ سَبِيلِكَ ، وَاجْعَلْ عَلَيهِم رِجْزَكَ وَعَذَابَكَ ، اللَّهُمَّ قَاتِلِ الكَفَرَةَ الَّذِينَ أُوتُوا الكِتَابَ ، إِلَهَ الحَقِّ.. آمِينَ.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ بِعِلْمِكَ الغَيبِ ، وَقُدْرَتِكَ عَلَى الخَلْقِ ؛ أَحْيِنِي مَا عَلِمْتَ الحَيَاةَ خَيْراً لِي ، وَتَوَفَّنِي إِذَا عَلِمْتَ الوَفَاةَ خَيْراً لِي ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الغَيْبِ وَالشَّهَادَةِ ، وَأَسْأَلُكَ كَلِمَةَ الحَقِّ فِي الرِّضَا وَالغَضَبِ ، وَأَسْأَلُكَ القَصْدَ فِي الغِنَى وَالفَقْرِ ، وَأَسْأَلُكَ نَعِيماً لا يَنْفَدُ ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لا تَنْقَطُعُ ، وَأَسْأَلُكَ الرِّضَا بَعْدَ القَضَاءِ ، وَأَسْأَلُكَ بَرْدَ العَيْشِ بَعْدَ المَوْتِ ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ ، وَالشَّوْقَ إِلَى لِقَائِكَ ، فِي غَيْرِ ضَرَّاءَ مُضِرَّةَ وَلا فِتْنَةً مُضِلَّةَ ، اللَّهُمَّ زَيِّنَّا بِزِينَةِ الإِيمَانِ ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ. اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الخَيْرَاتِ ، وَتَرْكَ المُنْكَرَاتِ ، وَحُبَّ المَسَاكِينَ ، وَأَنْ تَغْفِرَ لِي وَتَرْحَمَنِي ، وَإذَا أَرَدْتَ فِتْنَةَ قَومٍ فَتَوَفَّنِي غَيْرَ مَفْتُونٍ ، وَأَسْأَلُكَ حُبَّكَ ، وَحُبَّ مَنْ يُحِبّـُكَ ، وَحُبَّ كل عَمَلٍ يُقَرِّبُنِي إِلَى حُبِّـكَ. اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الخَيْرِ كُلِّهُ ؛ عَاجِلِهِ وَآجِلِهِ ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ ، وَأَعُوذُ بِكَ مِنْ الشَّرِّ كُلِّهُ عَاجِلِهِ وَآجِلِهِ ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ. اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ محمد ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ بِكَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ محمد. اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّة ، وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ ، وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ ، وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْراً.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ بِعِلْمِكَ الغَيبِ ، وَقُدْرَتِكَ عَلَى الخَلْقِ ؛ أَحْيِنِي مَا عَلِمْتَ الحَيَاةَ خَيْراً لِي ، وَتَوَفَّنِي إِذَا عَلِمْتَ الوَفَاةَ خَيْراً لِي ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الغَيْبِ وَالشَّهَادَةِ ، وَأَسْأَلُكَ كَلِمَةَ الحَقِّ فِي الرِّضَا وَالغَضَبِ ، وَأَسْأَلُكَ القَصْدَ فِي الغِنَى وَالفَقْرِ ، وَأَسْأَلُكَ نَعِيماً لا يَنْفَدُ ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لا تَنْقَطُعُ ، وَأَسْأَلُكَ الرِّضَا بَعْدَ القَضَاءِ ، وَأَسْأَلُكَ بَرْدَ العَيْشِ بَعْدَ المَوْتِ ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ ، وَالشَّوْقَ إِلَى لِقَائِكَ ، فِي غَيْرِ ضَرَّاءَ مُضِرَّةَ وَلا فِتْنَةً مُضِلَّةَ ، اللَّهُمَّ زَيِّنَّا بِزِينَةِ الإِيمَانِ ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ. اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الخَيْرَاتِ ، وَتَرْكَ المُنْكَرَاتِ ، وَحُبَّ المَسَاكِينَ ، وَأَنْ تَغْفِرَ لِي وَتَرْحَمَنِي ، وَإذَا أَرَدْتَ فِتْنَةَ قَومٍ فَتَوَفَّنِي غَيْرَ مَفْتُونٍ ، وَأَسْأَلُكَ حُبَّكَ ، وَحُبَّ مَنْ يُحِبّـُكَ ، وَحُبَّ كل عَمَلٍ يُقَرِّبُنِي إِلَى حُبِّـكَ. اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الخَيْرِ كُلِّهُ ؛ عَاجِلِهِ وَآجِلِهِ ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ ، وَأَعُوذُ بِكَ مِنْ الشَّرِّ كُلِّهُ عَاجِلِهِ وَآجِلِهِ ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ. اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ محمد ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ بِكَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ محمد. اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّة ، وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ ، وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ ، وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْراً.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا تَحُولُ بِهِ بَيْنَنَا وَبَيْنَ مَعَاصِيكَ ، وَمِنْ طَاعَتِكَ مَا تُبَلِّغْنَا بِهِ جَنَّتَكَ ، وَمِنَ اليَقِينِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مَصَائِبَ الدُّنْيَا ، اللَّهُمَّ مَتِّعْنَا بِأَسْمَاعِنَا ، وَأَبْصَارِنَا ، وَقُوَّاتِنَا مَا أَحْيَيْتَنَا ، وَاجْعَلْهُ الوَارِثَ مِنَّا ، وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا ، وَانْصُرْنَا عَلَى مَنْ عَادَانَا ، وَلا تَجْعَلْ مُصِيبَتَنَا فِي دِينِنَا وَلا تَجْعَلْ الدُّنْيَا أَكْبَرَ هَمِّنَا ، وَلا مَبْلَغَ عِلْمِنَا ، وَلا تُسَلِّطْ عَلَيْنَا مَنْ لا يَرْحَمْنَا. اللَّهُمَّ إِنَّا نَسْألُكَ مُوجِبَاتِ رَحْمَتِكَ ، وَعَزَائِمَ مَغْفِرَتِكَ ، وَالسَّلامَةَ مِنْ كُلِّ إثْمٍ ، وَالغَنِيمَةَ مِنْ كُلِّ بِرِّ ، وَالفَوْزَ بِالجَنَّةِ ، وَالنَّجَاةَ مِنَ النَّارِ. اللَّهُمَّ لا تَدَعْ لَنَا ذَنْبًا إِلاَّ غَفَرْتَهُ ، وَلا هَمًّا إِلاَّ فَرَّجْتَهُ ، وَلا دَيْنًا إِلاَّ قَضَيْتَهُ ، وَلا مَرِيضاً إِلاَّ شَفَيْتَهُ ، وَلا مُبْتَلَى إِلاَّ عَافَيْتَهُ ، وَلا ضَالاً إِلاَّ هَدَيْتَهُ ، وَلا غَائِباً إِلاَّ رَدَدْتَهُ ، وَلا مَظْلُوماً إِلاَّ نَصَرْتَهُ ، وَلا أَسِيراً إِلاَّ فَكَكْتَهُ ، وَلا مَيِّتاً إِلاَّ رَحِمْتَهُ ، وَلا حَاجَةً لَنَا فِيهَا صَلاحٌ وَلَكَ فِيهَا رِضاً إِلاَّ قَضَيْتَهَا وَيَسَّرْتَهَا بِفَضْلِكَ يَا أَكْرَمَ الأَكْرَمِينَ. اللَّهُمَّ رَبِّ أَعِنِّي وَلا تُعِنْ عَلَيَّ ، وَانْصُرْنِي وَلا تَنْصُرْ عَلَيَّ ، وَامْكُرْ لِي وَلا تَمْكُرْ عَلَيَّ ، وَاهْدِنِي وَيَسِّرِ الهُدَى إِلَيَّ ، وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ. اللَّهُمَّ رَبِّ اجْعَلْنِي لَكَ شَكَّاراً ، لَكَ ذَكَّاراً ، لَكَ رَهَّاباً ، لَكَ مِطْـوَاعاً ، إِلَيْكَ مُخْبِتاً أَوَّاهاً مُنِيباً ، رَبِّ تَقَبَّلْ تَوْبَتِي ، وَاغْسِلْ حَوْبَتِي ، وَأَجِبْ دَعْوَتِي ، وَثَبِّتْ حُجَّتِي ، وَاهْدِ قَلْبِي ، وَسَدِّدْ لِسَانِي ، وَاسْلُلْ سَخِيمَةَ قَلْبِي.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا تَحُولُ بِهِ بَيْنَنَا وَبَيْنَ مَعَاصِيكَ ، وَمِنْ طَاعَتِكَ مَا تُبَلِّغْنَا بِهِ جَنَّتَكَ ، وَمِنَ اليَقِينِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مَصَائِبَ الدُّنْيَا ، اللَّهُمَّ مَتِّعْنَا بِأَسْمَاعِنَا ، وَأَبْصَارِنَا ، وَقُوَّاتِنَا مَا أَحْيَيْتَنَا ، وَاجْعَلْهُ الوَارِثَ مِنَّا ، وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا ، وَانْصُرْنَا عَلَى مَنْ عَادَانَا ، وَلا تَجْعَلْ مُصِيبَتَنَا فِي دِينِنَا وَلا تَجْعَلْ الدُّنْيَا أَكْبَرَ هَمِّنَا ، وَلا مَبْلَغَ عِلْمِنَا ، وَلا تُسَلِّطْ عَلَيْنَا مَنْ لا يَرْحَمْنَا. اللَّهُمَّ إِنَّا نَسْألُكَ مُوجِبَاتِ رَحْمَتِكَ ، وَعَزَائِمَ مَغْفِرَتِكَ ، وَالسَّلامَةَ مِنْ كُلِّ إثْمٍ ، وَالغَنِيمَةَ مِنْ كُلِّ بِرِّ ، وَالفَوْزَ بِالجَنَّةِ ، وَالنَّجَاةَ مِنَ النَّارِ. اللَّهُمَّ لا تَدَعْ لَنَا ذَنْبًا إِلاَّ غَفَرْتَهُ ، وَلا هَمًّا إِلاَّ فَرَّجْتَهُ ، وَلا دَيْنًا إِلاَّ قَضَيْتَهُ ، وَلا مَرِيضاً إِلاَّ شَفَيْتَهُ ، وَلا مُبْتَلَى إِلاَّ عَافَيْتَهُ ، وَلا ضَالاً إِلاَّ هَدَيْتَهُ ، وَلا غَائِباً إِلاَّ رَدَدْتَهُ ، وَلا مَظْلُوماً إِلاَّ نَصَرْتَهُ ، وَلا أَسِيراً إِلاَّ فَكَكْتَهُ ، وَلا مَيِّتاً إِلاَّ رَحِمْتَهُ ، وَلا حَاجَةً لَنَا فِيهَا صَلاحٌ وَلَكَ فِيهَا رِضاً إِلاَّ قَضَيْتَهَا وَيَسَّرْتَهَا بِفَضْلِكَ يَا أَكْرَمَ الأَكْرَمِينَ. اللَّهُمَّ رَبِّ أَعِنِّي وَلا تُعِنْ عَلَيَّ ، وَانْصُرْنِي وَلا تَنْصُرْ عَلَيَّ ، وَامْكُرْ لِي وَلا تَمْكُرْ عَلَيَّ ، وَاهْدِنِي وَيَسِّرِ الهُدَى إِلَيَّ ، وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ. اللَّهُمَّ رَبِّ اجْعَلْنِي لَكَ شَكَّاراً ، لَكَ ذَكَّاراً ، لَكَ رَهَّاباً ، لَكَ مِطْـوَاعاً ، إِلَيْكَ مُخْبِتاً أَوَّاهاً مُنِيباً ، رَبِّ تَقَبَّلْ تَوْبَتِي ، وَاغْسِلْ حَوْبَتِي ، وَأَجِبْ دَعْوَتِي ، وَثَبِّتْ حُجَّتِي ، وَاهْدِ قَلْبِي ، وَسَدِّدْ لِسَانِي ، وَاسْلُلْ سَخِيمَةَ قَلْبِي.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ إِنَّا نَسْألكَ يُسْراً لَيْسَ بَعْدَهُ عُسْرٌ ، وَغِنىً لَيْسَ بَعْدَهُ فَقْرٌ ، وَأَمْناً لَيْسَ بَعْدَهُ خَوْفٌ ، وَسَعَادَةً لَيْسَ بَعْدَهَا شَقَاءٌ. اللَّهُمَّ ألِّفْ بَيْنَ قُلُوبِنَا ، وَأَصْلِحْ ذَاتَ بَيْنِـنَا ، وَاهْدِنَا سُبُلَ السَّلامِ ، وَنَجِّنَا مِنَ الظُّلُمَاتِ إِلَى النُّورِ ، وَجَنِّبْنَا الفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ ، وَبَارِكْ لَنَا فِي أَسْمَاعِـنَا ، وَأَبْصَارِنَا ، وَقُلُوبِنَا ، وَأَزْوَاجِـنَا ، وَذُرِّيَّاتِنَا ، وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ ، وَاجْعَلْنَا شَاكِرِينَ لِنِعَمِكَ مُثْنِينَ بِهَا عَلَيْكَ قَابِلِينَ لَهَا وَأَتْمِمْهَا عَلَيْنَا. اللَّهُمَّ يَا مُقَلِّبَ القُلُوبِ وَالأَبْصَارِ ، ثَبِّتْ قُلُوبَنَا عَلَى طَاعَتِكَ ، وَلا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا ، ولا تَفْتِنَّا فِي دِينِنَا ، وَاجْعَلْ يَوْمَنَا خَيْراً مِنْ أَمْسِنَا ، وَاجْعَلْ غَدَنَا خَيْراً مِنْ يَوْمـِنَا ، وَاجْعَلْ خَيْرَ أَعْمَارِنَا أَوَاخِرَهَا ، وَخَيْرَ أَعْمَالِنَا خَوَاتِيمَهَا ، وَخَيْرَ أَيَّامِنَا يَوْمَ نَلْقَاكَ وَأَنْتَ رَاضٍ عَنَّا. اللَّهُمَّ أَنْتَ الَّذِي خَلَقْتَنِي فَأَنْتَ تَهْدِينِ ، وَأَنْتَ الَّذِي تُطْعِمُنِي وَتَسْقِينِ ، وَإذَا مَرِضْتُ فَأَنْتَ تَشْفِينِ ، وَأَنْتَ الَّذِي تُمِيتُنِي ثُمَّ تُحْـيِينِ ، وَأَنْتَ الَّذِي أَطْمَعُ أَنْ يَغْفِرَ لِي خَطِيئَتِي يَوْمَ الدِّينِ ، رَبِّ هَبْ لِي حُكْماً وَأَلْحِقْنِي بِالصَّالِحِينَ ، وَاجْعَلْ لِي لِسَانَ صِدْقٍ فِي الآخِرِينَ ، وَاجْعَلْنِي مِنْ وَرَثَةِ جَنَّةِ النَّعِيمِ ، وَاغْفِرْ لآبَائِنَا وَأُمَّهَاتِنَا مِنَ المُسْلِمِينَ وَلا تُخْزِنِي يَوْمَ يُبْعَثُونَ ، يَوْمَ لا يَنْفَعُ مَالٌ وَلا بَنُونَ ، إِلاَّ مَنْ أَتَى اللهَ بِقَلْبٍ سَلِيمٍ. اللَّهُمَّ احْفَظْنِي بِالإسْلاَمِ قَائِماً ، وَاحْفَظْنِي بِالإِسْلاَمِ قَاعِداً ، وَاحْفَظْنِي بِالإِسْلامِ رَاقِداً ، وَلاَ تُشْمِتْ بِي عَدُوّاً وَلا حَاسِداً.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ إِنَّا نَسْألكَ يُسْراً لَيْسَ بَعْدَهُ عُسْرٌ ، وَغِنىً لَيْسَ بَعْدَهُ فَقْرٌ ، وَأَمْناً لَيْسَ بَعْدَهُ خَوْفٌ ، وَسَعَادَةً لَيْسَ بَعْدَهَا شَقَاءٌ. اللَّهُمَّ ألِّفْ بَيْنَ قُلُوبِنَا ، وَأَصْلِحْ ذَاتَ بَيْنِـنَا ، وَاهْدِنَا سُبُلَ السَّلامِ ، وَنَجِّنَا مِنَ الظُّلُمَاتِ إِلَى النُّورِ ، وَجَنِّبْنَا الفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ ، وَبَارِكْ لَنَا فِي أَسْمَاعِـنَا ، وَأَبْصَارِنَا ، وَقُلُوبِنَا ، وَأَزْوَاجِـنَا ، وَذُرِّيَّاتِنَا ، وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ ، وَاجْعَلْنَا شَاكِرِينَ لِنِعَمِكَ مُثْنِينَ بِهَا عَلَيْكَ قَابِلِينَ لَهَا وَأَتْمِمْهَا عَلَيْنَا. اللَّهُمَّ يَا مُقَلِّبَ القُلُوبِ وَالأَبْصَارِ ، ثَبِّتْ قُلُوبَنَا عَلَى طَاعَتِكَ ، وَلا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا ، ولا تَفْتِنَّا فِي دِينِنَا ، وَاجْعَلْ يَوْمَنَا خَيْراً مِنْ أَمْسِنَا ، وَاجْعَلْ غَدَنَا خَيْراً مِنْ يَوْمـِنَا ، وَاجْعَلْ خَيْرَ أَعْمَارِنَا أَوَاخِرَهَا ، وَخَيْرَ أَعْمَالِنَا خَوَاتِيمَهَا ، وَخَيْرَ أَيَّامِنَا يَوْمَ نَلْقَاكَ وَأَنْتَ رَاضٍ عَنَّا. اللَّهُمَّ أَنْتَ الَّذِي خَلَقْتَنِي فَأَنْتَ تَهْدِينِ ، وَأَنْتَ الَّذِي تُطْعِمُنِي وَتَسْقِينِ ، وَإذَا مَرِضْتُ فَأَنْتَ تَشْفِينِ ، وَأَنْتَ الَّذِي تُمِيتُنِي ثُمَّ تُحْـيِينِ ، وَأَنْتَ الَّذِي أَطْمَعُ أَنْ يَغْفِرَ لِي خَطِيئَتِي يَوْمَ الدِّينِ ، رَبِّ هَبْ لِي حُكْماً وَأَلْحِقْنِي بِالصَّالِحِينَ ، وَاجْعَلْ لِي لِسَانَ صِدْقٍ فِي الآخِرِينَ ، وَاجْعَلْنِي مِنْ وَرَثَةِ جَنَّةِ النَّعِيمِ ، وَاغْفِرْ لآبَائِنَا وَأُمَّهَاتِنَا مِنَ المُسْلِمِينَ وَلا تُخْزِنِي يَوْمَ يُبْعَثُونَ ، يَوْمَ لا يَنْفَعُ مَالٌ وَلا بَنُونَ ، إِلاَّ مَنْ أَتَى اللهَ بِقَلْبٍ سَلِيمٍ. اللَّهُمَّ احْفَظْنِي بِالإسْلاَمِ قَائِماً ، وَاحْفَظْنِي بِالإِسْلاَمِ قَاعِداً ، وَاحْفَظْنِي بِالإِسْلامِ رَاقِداً ، وَلاَ تُشْمِتْ بِي عَدُوّاً وَلا حَاسِداً.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ كُلِّ خَيْرٍ خَزَائِنُهُ بِيَدِكَ ، وَأَعُوذُ بِكَ مِنْ كُلِّ شَرٍّ خَزَائِنُهُ بِيَـدِكَ. اللَّهُمَّ يَا ذَا الحَبْلِ الشَّدِيدِ ، وَالأَمْرِ الرَّشِيـدِ ، أَسْأَلُكَ الأَمْنَ يَوْمَ الوَعِيدِ ، وَالجَنَّةَ دَاْر الخُلُودِ ، مَعَ المُقَرَّبِينَ الشُّهُودِ ، الرُّكَّعِ السُّجُودِ ، المُوفِينَ بِالعُهُودِ ، إِنَّكَ رَحِيمٌ وَدُودٌ ، وَإِنَّكَ تَفْعَلُ مَا تُرِيدُ. اللَّهُمَّ اجْعَلْنَا هَادِينَ مُهْتَدِينَ ، غَيْرَ ضَالِّيْنَ وَلا مُضِلِّينَ ، سِلْماً لأَوْلِيائِكَ ، وَحَرْباً على أَعْدَائِكَ ، نُحِبُّ بِحُبِّكَ مَنْ أَحَبَّكَ ، وَنُعَادِي بِعَدَاوَتِكَ مَنْ خَالَفَكَ.اللَّهُمَّ هَذَا الدُّعَاءُ وَمِنْكَ الإِجَابَةُ ، اللَّهُمَّ هَذَا الجُهْدُ وَعَلَيْكَ التُّكْلانُ. اللَّهُمَّ إِنِّي أَسْأَلُكَ إِيمَاناً لا يَرْتَدُّ ، وَنَعِيماً لا يَنْفَدُ ، وَمُرَافَقَةَ نَبِيِّكَ مُحَمَّدٍ فِي أَعْلَى جَنَّةِ الخُلْدِ. اللَّهُمَّ آتِنِي الحِكْمَةَ الَّتِي مَنْ أُوتِيَهَا فَقَدْ أُوْتِيَ خَيْراً كَثِيراً.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ كُلِّ خَيْرٍ خَزَائِنُهُ بِيَدِكَ ، وَأَعُوذُ بِكَ مِنْ كُلِّ شَرٍّ خَزَائِنُهُ بِيَـدِكَ. اللَّهُمَّ يَا ذَا الحَبْلِ الشَّدِيدِ ، وَالأَمْرِ الرَّشِيـدِ ، أَسْأَلُكَ الأَمْنَ يَوْمَ الوَعِيدِ ، وَالجَنَّةَ دَاْر الخُلُودِ ، مَعَ المُقَرَّبِينَ الشُّهُودِ ، الرُّكَّعِ السُّجُودِ ، المُوفِينَ بِالعُهُودِ ، إِنَّكَ رَحِيمٌ وَدُودٌ ، وَإِنَّكَ تَفْعَلُ مَا تُرِيدُ. اللَّهُمَّ اجْعَلْنَا هَادِينَ مُهْتَدِينَ ، غَيْرَ ضَالِّيْنَ وَلا مُضِلِّينَ ، سِلْماً لأَوْلِيائِكَ ، وَحَرْباً على أَعْدَائِكَ ، نُحِبُّ بِحُبِّكَ مَنْ أَحَبَّكَ ، وَنُعَادِي بِعَدَاوَتِكَ مَنْ خَالَفَكَ.اللَّهُمَّ هَذَا الدُّعَاءُ وَمِنْكَ الإِجَابَةُ ، اللَّهُمَّ هَذَا الجُهْدُ وَعَلَيْكَ التُّكْلانُ. اللَّهُمَّ إِنِّي أَسْأَلُكَ إِيمَاناً لا يَرْتَدُّ ، وَنَعِيماً لا يَنْفَدُ ، وَمُرَافَقَةَ نَبِيِّكَ مُحَمَّدٍ فِي أَعْلَى جَنَّةِ الخُلْدِ. اللَّهُمَّ آتِنِي الحِكْمَةَ الَّتِي مَنْ أُوتِيَهَا فَقَدْ أُوْتِيَ خَيْراً كَثِيراً.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنَ عِبَادَتِكَ. اللَّهُمَّ ارْحَمْنِي ، فَأَنْتَ خَيْرُ الرَّاحِمِينَ ، وَارْزُقْنِي ، فَأَنْتَ خَيْرُ الرَّازِقِينَ ، وَاغْفِرْ لِي فَأَنْتَ خَيْرُ الغَافِرِينَ ، وَانْصُرْنِي ، فَأَنْتَ خَيْرُ النَّاصِرِينَ. اللَّهُمَّ رَحْمَتَكَ أَرْجُو فَلا تَكِلْني إِلى نَفْسِي طَرْفَةَ عَيْنٍ ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ ، لا إِلَهَ إِلاَّ أَنْتَ. اللَّهُمَّ زِدْنَا وَلا تَنْقُصْنَا ، وَأَكْرِمْنَا وَلا تُـهِنَّا ، وَأَعْطِنَا وَلا تَحْرِمْنَا ، وَآثِرْنَا وَلا تُؤْثِرْ عَلَينَا ، وَأَرْضِنَا وَارْضَ عَنَّا. اللَّهُمَّ إِنِّي أَسْأَلُكَ عِيشَةً نَقِيَّةً ، وَمِيتَةً سَـوِيَّةً ، وَمَرَدّاً غَيْرَ مُخْزٍ وَلا فَاضِحٍ.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنَ عِبَادَتِكَ. اللَّهُمَّ ارْحَمْنِي ، فَأَنْتَ خَيْرُ الرَّاحِمِينَ ، وَارْزُقْنِي ، فَأَنْتَ خَيْرُ الرَّازِقِينَ ، وَاغْفِرْ لِي فَأَنْتَ خَيْرُ الغَافِرِينَ ، وَانْصُرْنِي ، فَأَنْتَ خَيْرُ النَّاصِرِينَ. اللَّهُمَّ رَحْمَتَكَ أَرْجُو فَلا تَكِلْني إِلى نَفْسِي طَرْفَةَ عَيْنٍ ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ ، لا إِلَهَ إِلاَّ أَنْتَ. اللَّهُمَّ زِدْنَا وَلا تَنْقُصْنَا ، وَأَكْرِمْنَا وَلا تُـهِنَّا ، وَأَعْطِنَا وَلا تَحْرِمْنَا ، وَآثِرْنَا وَلا تُؤْثِرْ عَلَينَا ، وَأَرْضِنَا وَارْضَ عَنَّا. اللَّهُمَّ إِنِّي أَسْأَلُكَ عِيشَةً نَقِيَّةً ، وَمِيتَةً سَـوِيَّةً ، وَمَرَدّاً غَيْرَ مُخْزٍ وَلا فَاضِحٍ.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ ، وَأَنْ أَعْمَلَ صَالِحَاً تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ. اللَّهُمَّ إِنِّي أَسْأَلُكَ العَفْوَ وَالعَافِيَةَ وَالمُعَافَاةَ فِي الدُّنْيَا وَالآخِرَةِ. اللَّهُمَّ إِنِّي أَسْأَلُكَ الهُدَى ، وَالتُّقَى ، وَالعَفَافَ وَالغِنَى. اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعَاً ، وَرِزْقاً طَـيِّباً ، وَعَمَلاً مُتَقَبَّلاً. اللَّهُمَّ اغْفِرْ لِي ، وَاهْدِنِي وَارْزُقْنِي ، وَعَافِنِي ، أَعُوذُ بِاللهِ مِنْ ضِيقِ المَقَامِ يَوْمَ القِيامَةِ.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ ، وَأَنْ أَعْمَلَ صَالِحَاً تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ. اللَّهُمَّ إِنِّي أَسْأَلُكَ العَفْوَ وَالعَافِيَةَ وَالمُعَافَاةَ فِي الدُّنْيَا وَالآخِرَةِ. اللَّهُمَّ إِنِّي أَسْأَلُكَ الهُدَى ، وَالتُّقَى ، وَالعَفَافَ وَالغِنَى. اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعَاً ، وَرِزْقاً طَـيِّباً ، وَعَمَلاً مُتَقَبَّلاً. اللَّهُمَّ اغْفِرْ لِي ، وَاهْدِنِي وَارْزُقْنِي ، وَعَافِنِي ، أَعُوذُ بِاللهِ مِنْ ضِيقِ المَقَامِ يَوْمَ القِيامَةِ.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ قِنِي شَرَّ نَفْسِي ، وَاعْزِمْ لِي عَلَى أَرْشَدِ أَمْرِي ، اللَّهُمَّ اغْفِرْ لِي مَا أَسْرَرْتُ ، وَمَا أَعْلَنْتُ وَمَا أَخْطَأْتُ ، وَمَا عَمَدْتُ ، وَمَا عَلِمْتُ ، وَمَا جَهِلُتُ. اللَّهُمَّ أَكْثِرْ مَالِي ، وَوَلَدِي ، وَبَارِكْ لِي فِيمَا أَعْطَيْتَنِي ، وَأَطِلْ حَيَاتِي عَلَى طَاعَتِكَ ، وَأَحْسِنْ عَمَلِي وَاغْفِرْ لِي. اللَّهُمَّ اسْتُرْ عَوَرَاتِي ، وَآمِنْ رَوْعَاتِي ، وَاحْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي ، وَعَنْ يَمِينِي وَعَنْ شِمَالِي ، وَمِنْ فَوْقِي ، وَأَعُوذُ بِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي. اللَّهُمَّ أَكْرِمْنِي وَلا تُهِنِّي ، وَأَعْطِنِي وَلا تَحْرِمْنِي ، وَزِدْنِي وَلا تَنْقُصْنِي ، وَآثِرْنِي وَلا تُؤْثِرْ عَلَيَّ ، وَارْضَ عَنِّي وَأَرْضِنِي. اللَّهُمَّ افْتَحْ لَنَا فَتْحاً مُبِيناً ، وَاهْدِنَا صِرَاطاً مُسْتَقِيماً ، وَانْصُرْنَا نَصْراً عَزِيزاً، وَأَتِمَّ عَلَيْنَا نَعْمَتَكَ ، وَأَنْزِلْ فِي قُلُوبِنَا سَكِينَتَكَ ، وَانْشُرْ عَلَيْنَا فَضْلَكَ وَرَحْمَتَكَ.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ قِنِي شَرَّ نَفْسِي ، وَاعْزِمْ لِي عَلَى أَرْشَدِ أَمْرِي ، اللَّهُمَّ اغْفِرْ لِي مَا أَسْرَرْتُ ، وَمَا أَعْلَنْتُ وَمَا أَخْطَأْتُ ، وَمَا عَمَدْتُ ، وَمَا عَلِمْتُ ، وَمَا جَهِلُتُ. اللَّهُمَّ أَكْثِرْ مَالِي ، وَوَلَدِي ، وَبَارِكْ لِي فِيمَا أَعْطَيْتَنِي ، وَأَطِلْ حَيَاتِي عَلَى طَاعَتِكَ ، وَأَحْسِنْ عَمَلِي وَاغْفِرْ لِي. اللَّهُمَّ اسْتُرْ عَوَرَاتِي ، وَآمِنْ رَوْعَاتِي ، وَاحْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي ، وَعَنْ يَمِينِي وَعَنْ شِمَالِي ، وَمِنْ فَوْقِي ، وَأَعُوذُ بِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي. اللَّهُمَّ أَكْرِمْنِي وَلا تُهِنِّي ، وَأَعْطِنِي وَلا تَحْرِمْنِي ، وَزِدْنِي وَلا تَنْقُصْنِي ، وَآثِرْنِي وَلا تُؤْثِرْ عَلَيَّ ، وَارْضَ عَنِّي وَأَرْضِنِي. اللَّهُمَّ افْتَحْ لَنَا فَتْحاً مُبِيناً ، وَاهْدِنَا صِرَاطاً مُسْتَقِيماً ، وَانْصُرْنَا نَصْراً عَزِيزاً، وَأَتِمَّ عَلَيْنَا نَعْمَتَكَ ، وَأَنْزِلْ فِي قُلُوبِنَا سَكِينَتَكَ ، وَانْشُرْ عَلَيْنَا فَضْلَكَ وَرَحْمَتَكَ.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ أعِنَّا عَلَى شَهَوَاتِ أَنْفُسِنَا، وَقَسْوَةِ قُلُوبِنَا ، وَضَعْفِ إِرَادَتِنَا ، وَلا تَكِلْنَا إِلَى أَنْفُسِنَا وَلا إِلَى أَحَدٍ غَيْرَكَ. اللَّهُمَّ لا تَكِلْنَا إِلَى أَنْفُسِنَا طَرْفَةَ عَيْنٍ وَلا أَقَلَّ مِنْ ذَلِكَ. اللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ. اللَّهُمَّ اشْغَلْ قُلُوبَنَا بِحُبِّكَ ، وَأَلْسِنَتَنَا بِذِكْرِكَ ، وَأَبْدَانِنَا بِطَاعَتِكَ ، وَعُقُولَنَا بِالتَّفَكُّرِ فِي خَلْقِكَ وَالتَّفَقُّهَ فِي دِينِكَ. اللَّهُمَّ اشْفِ مَرْضَانَا ، وَارْحَمْ مَوْتَانَا ، وعَافِ مُبْتَلاَنَاْ ، وَفُكَّ أَسْرَانَا ، وَاجْبُرْ كَسْرَانَا.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ أعِنَّا عَلَى شَهَوَاتِ أَنْفُسِنَا، وَقَسْوَةِ قُلُوبِنَا ، وَضَعْفِ إِرَادَتِنَا ، وَلا تَكِلْنَا إِلَى أَنْفُسِنَا وَلا إِلَى أَحَدٍ غَيْرَكَ. اللَّهُمَّ لا تَكِلْنَا إِلَى أَنْفُسِنَا طَرْفَةَ عَيْنٍ وَلا أَقَلَّ مِنْ ذَلِكَ. اللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ. اللَّهُمَّ اشْغَلْ قُلُوبَنَا بِحُبِّكَ ، وَأَلْسِنَتَنَا بِذِكْرِكَ ، وَأَبْدَانِنَا بِطَاعَتِكَ ، وَعُقُولَنَا بِالتَّفَكُّرِ فِي خَلْقِكَ وَالتَّفَقُّهَ فِي دِينِكَ. اللَّهُمَّ اشْفِ مَرْضَانَا ، وَارْحَمْ مَوْتَانَا ، وعَافِ مُبْتَلاَنَاْ ، وَفُكَّ أَسْرَانَا ، وَاجْبُرْ كَسْرَانَا.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ أَطْعِمْنَا مِنْ جُوعٍ ، وَآمِنَّا مِنْ خَوْفٍ، وَقَوِّنَا مِنْ ضَعْفٍ ، وَعَلِّمْنَا مِنْ جَهَالَةٍ، وَأَنْقِذْنَا مِنْ ضَلاَلَةٍ. اللَّهُمَّ اخْتِمْ بِالصَّالِحَاتِ أَعْمَالَنَا ، وَبِالسَّعَادَةِ آجَالَنَا ، وَبَلِّغْنَا مِمَّا يُرْضِـيكَ آمَالَنَا. اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي ، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي, وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي ، وَاجْعَلِ الحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ ، وَاجْعَلِ المَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ. اللَّهُمَّ اجْعَلْ خَيْرَ عُمُرِي أَوَاخِرَهُ ، وَخَيْرَ عَمَلِي خَوَاتِمَهُ ، وَخَيْرَ أَيَّامِي يَوْمَ لِقَاكَ. اللَّهُمَّ احْفَظْنِي بِالإسْلامِ قَائِماً ، وَاحْفَظْنِي بِالإسْلامِ قَاعِداً ، وَاحْفَظْنِي بِالإِسْلامِ رَاقِداً ، وَلا تُشْمِتْ بِيَ عَدُوَّاً وَلا حَاسِدَاً.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ أَطْعِمْنَا مِنْ جُوعٍ ، وَآمِنَّا مِنْ خَوْفٍ، وَقَوِّنَا مِنْ ضَعْفٍ ، وَعَلِّمْنَا مِنْ جَهَالَةٍ، وَأَنْقِذْنَا مِنْ ضَلاَلَةٍ. اللَّهُمَّ اخْتِمْ بِالصَّالِحَاتِ أَعْمَالَنَا ، وَبِالسَّعَادَةِ آجَالَنَا ، وَبَلِّغْنَا مِمَّا يُرْضِـيكَ آمَالَنَا. اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي ، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي, وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي ، وَاجْعَلِ الحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ ، وَاجْعَلِ المَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ. اللَّهُمَّ اجْعَلْ خَيْرَ عُمُرِي أَوَاخِرَهُ ، وَخَيْرَ عَمَلِي خَوَاتِمَهُ ، وَخَيْرَ أَيَّامِي يَوْمَ لِقَاكَ. اللَّهُمَّ احْفَظْنِي بِالإسْلامِ قَائِماً ، وَاحْفَظْنِي بِالإسْلامِ قَاعِداً ، وَاحْفَظْنِي بِالإِسْلامِ رَاقِداً ، وَلا تُشْمِتْ بِيَ عَدُوَّاً وَلا حَاسِدَاً.'),
  const AthkarEntity(
      name:
          'اللَّهُمَّ أَحْيِنَا مُسْلِمِينَ ، وَتَوَفَّنَا مُسْلِمِينَ ، وَأَلْحِقْنَا بِالصَّالِحِينَ. اللَّهُمَّ أَبْرِمْ لِهَذِهِ الأُمَّةِ أَمْرَ رُشْدٍ ، يُعَزُّ فِيْهِ أَهْلُ طَاعَتِكَ ، وَيُذَلُّ فِيْهِ أَهْلُ مَعْصِيَتِكَ ، وَيُؤمَرُ فِيْهِ بِالمَعْرُوفِ ، وَيُنْهَى فِيْهِ عَنِ المُنْكَرِ. اللَّهُمَّ اللهمَّ صلِّ وسلِّمْ وبارِكْ علَى عَبْدِكَ ورَسُوْلِكَ محمَّد وعلى آله وصحبه أجمعين.',
      quantity: 1,
      quantityText: 'مرة واحدة',
      description: '',
      content:
          'اللَّهُمَّ أَحْيِنَا مُسْلِمِينَ ، وَتَوَفَّنَا مُسْلِمِينَ ، وَأَلْحِقْنَا بِالصَّالِحِينَ. اللَّهُمَّ أَبْرِمْ لِهَذِهِ الأُمَّةِ أَمْرَ رُشْدٍ ، يُعَزُّ فِيْهِ أَهْلُ طَاعَتِكَ ، وَيُذَلُّ فِيْهِ أَهْلُ مَعْصِيَتِكَ ، وَيُؤمَرُ فِيْهِ بِالمَعْرُوفِ ، وَيُنْهَى فِيْهِ عَنِ المُنْكَرِ. اللَّهُمَّ اللهمَّ صلِّ وسلِّمْ وبارِكْ علَى عَبْدِكَ ورَسُوْلِكَ محمَّد وعلى آله وصحبه أجمعين.'),
];

class StaticAthkarData {
  static final List<AthkarCategory> athkarCategories = [
    AthkarCategory(
        id: 1,
        name: 'اذكار الصباح',
        athkarEntities: morningAthkarEntites,
        icon: IconPath.morningAthkarIcon),
    AthkarCategory(
        id: 2,
        name: 'اذكار النوم',
        athkarEntities: sleepingAthkarEntites,
        icon: IconPath.sleepingAthkarIcon),
    AthkarCategory(
        id: 3,
        name: 'اذكار المساء',
        athkarEntities: nightAthkarEntites,
        icon: IconPath.eveningAthkarIcon),
    AthkarCategory(
        id: 4,
        name: 'اذكار بعد الصلاة',
        athkarEntities: afterPrayerAthkarEntites,
        icon: IconPath.afterPrayerIcon),
    AthkarCategory(
        id: 5,
        name: 'التسابيح',
        athkarEntities: praisesAthkarEntities,
        icon: IconPath.praisesIcon),
    AthkarCategory(
        id: 6,
        name: 'اذكار الاستيقاظ من النوم',
        athkarEntities: wakeUpAthkarEntities,
        icon: IconPath.wakeUp),
    AthkarCategory(
        id: 7,
        name: 'اذكار الصلاة',
        athkarEntities: prayerAthkarEntities,
        icon: IconPath.pray),
    AthkarCategory(
        id: 8,
        name: 'جوامع الدعاء',
        athkarEntities: allAthkarEntities,
        icon: IconPath.handPrayer),
  ];
}
