import 'package:balady_plus/app/core/utils/constants/paths/icon_paths.dart';
import 'package:balady_plus/app/features/athkar/domain/entities/athkar_category.dart';
import 'package:balady_plus/app/features/athkar/domain/entities/athkar_entity.dart';

final List<AthkarEntity> morningAthkarEntites = [
  const AthkarEntity(
    name:
        'اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.  [آية الكرسى - البقرة 255].',
    quantity: 1,
    content:
        'الله لا إلٰه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يئوده حفظهما وهو العلي العظيم لا إكراه في الدين قد تبين الرشد من الغي فمن يكفر بالطاغوت ويؤمن بالله فقد استمسك بالعروة الوثقىٰ لا انفصام لها والله سميع عليم الله ولي الذين آمنوا يخرجهم من الظلمات إلى النور ۖ والذين كفروا أولياؤهم الطاغوت يخرجونهم من النور إلى الظلمات ۗ أولٰئك أصحاب النار ۖ هم فيها خالدون.',
  ),
  const AthkarEntity(
    name:
        'ۥقُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.',
    quantity: 3,
    content:
        'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم  \n قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.',
  ),
  const AthkarEntity(
    name:
        'قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.',
    quantity: 3,
    content:
        'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.',
  ),
  const AthkarEntity(
    name:
        'قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ',
    quantity: 3,
    content:
        ' بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ ',
  ),
  const AthkarEntity(
    name:
        'أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد',
    quantity: 1,
    content:
        'أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.',
  ),
  const AthkarEntity(
    name:
        'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت',
    quantity: 1,
    content:
        'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ ',
  ),
  //
  const AthkarEntity(
    name: 'رضيـت بالله ربـا وبالإسلام ديـنا وبمحـمد صلى الله عليه وسلم نبيـا. ',
    quantity: 3,
    content:
        'رضيـت بالله ربـا وبالإسلام ديـنا وبمحـمد صلى الله عليه وسلم نبيـا. ',
  ),
  const AthkarEntity(
      name:
          'اللهـم إنـي أصبـحت أشـهدك ، وأشـهد حملـة عـرشـك ، وملائكتك ، وجمـيع خلـقك ، أنـك أنـت الله لا إله إلا أنـت وحـدك لا شريك لـك ، وأن محمـدا عبـدك ورسـولـك. ',
      quantity: 4,
      content:
          'اللهـم إنـي أصبـحت أشـهدك ، وأشـهد حملـة عـرشـك ، وملائكتك ، وجمـيع خلـقك ، أنـك أنـت الله لا إله إلا أنـت وحـدك لا شريك لـك ، وأن محمـدا عبـدك ورسـولـك. '),
  const AthkarEntity(
    name:
        'اللهـم ما أصبـح بي مـن نعـمة أو بأحـد مـن خلـقك ، فمـنك وحـدك لا شريك لـك ، فلـك الحمـد ولـك الشكـر.',
    quantity: 1,
    content:
        'اللهـم ما أصبـح بي مـن نعـمة أو بأحـد مـن خلـقك ، فمـنك وحـدك لا شريك لـك ، فلـك الحمـد ولـك الشكـر.',
  ),
  const AthkarEntity(
    name: 'حسبـي الله لا إله إلا هو علـيه توكـلت وهو رب العرش العظـيم. ',
    quantity: 7,
    content: 'حسبـي الله لا إله إلا هو علـيه توكـلت وهو رب العرش العظـيم. ',
  ),
  //12
  const AthkarEntity(
    name:
        'بسـم الله الذي لا يضـر مع اسمـه شيء في الأرض ولا في السمـاء وهـو السمـيع العلـيم. ',
    quantity: 3,
    content:
        'بسـم الله الذي لا يضـر مع اسمـه شيء في الأرض ولا في السمـاء وهـو السمـيع العلـيم. ',
  ),
  const AthkarEntity(
    name:
        'اللهـم بك أصـبحنا وبك أمسـينا ، وبك نحـيا وبك نمـوت وإلـيك النـشور. ',
    quantity: 1,
    content:
        'اللهـم بك أصـبحنا وبك أمسـينا ، وبك نحـيا وبك نمـوت وإلـيك النـشور. ',
  ),
  const AthkarEntity(
    name:
        'أصبـحـنا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم حنيفا مسلما وما كان من المشركين. ',
    quantity: 1,
    content:
        'أصبـحـنا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم حنيفا مسلما وما كان من المشركين. ',
  ),
  const AthkarEntity(
    name:
        'سبحـان الله وبحمـده عدد خلـقه ، ورضـا نفسـه ، وزنـة عـرشـه ، ومـداد كلمـاتـه. ',
    quantity: 3,
    content:
        'سبحـان الله وبحمـده عدد خلـقه ، ورضـا نفسـه ، وزنـة عـرشـه ، ومـداد كلمـاتـه. ',
  ),
  const AthkarEntity(
    name:
        'اللهـم عافـني في بدنـي ، اللهـم عافـني في سمـعي ، اللهـم عافـني في بصـري ، لا إله إلا أنـت. ',
    quantity: 3,
    content:
        'اللهـم عافـني في بدنـي ، اللهـم عافـني في سمـعي ، اللهـم عافـني في بصـري ، لا إله إلا أنـت. ',
  ),
  //17
  const AthkarEntity(
    name:
        'اللهـم إنـي أعـوذ بك من الكـفر ، والفـقر ، وأعـوذ بك من عذاب القـبر ، لا إله إلا أنـت.',
    quantity: 3,
    content:
        'اللهـم إنـي أعـوذ بك من الكـفر ، والفـقر ، وأعـوذ بك من عذاب القـبر ، لا إله إلا أنـت.',
  ),

  const AthkarEntity(
    name:
        'اللهـم إنـي أسـألـك العـفو والعـافـية في الدنـيا والآخـرة ، اللهـم إنـي أسـألـك العـفو والعـافـية في ديني ودنـياي وأهـلي ومالـي ، اللهـم استـر عـوراتي وآمـن روعاتـي ، اللهـم احفظـني من بـين يدي ومن خلفـي وعن يمـيني وعن شمـالي ، ومن فوقـي ، وأعـوذ بعظمـتك أن أغـتال من تحتـي. ',
    quantity: 1,
    content:
        'اللهـم إنـي أسـألـك العـفو والعـافـية في الدنـيا والآخـرة ، اللهـم إنـي أسـألـك العـفو والعـافـية في ديني ودنـياي وأهـلي ومالـي ، اللهـم استـر عـوراتي وآمـن روعاتـي ، اللهـم احفظـني من بـين يدي ومن خلفـي وعن يمـيني وعن شمـالي ، ومن فوقـي ، وأعـوذ بعظمـتك أن أغـتال من تحتـي. ',
  ),
  const AthkarEntity(
    name:
        'يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طـرفة عين. ',
    quantity: 3,
    content:
        'يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طـرفة عين. ',
  ),
  const AthkarEntity(
    name:
        'أصبـحـنا وأصبـح المـلك لله رب العـالمـين ، اللهـم إنـي أسـألـك خـير هـذا الـيوم ، فـتحه ، ونصـره ، ونـوره وبـركتـه ، وهـداه ، وأعـوذ بـك مـن شـر ما فـيه وشـر ما بعـده. ',
    quantity: 1,
    content:
        'أصبـحـنا وأصبـح المـلك لله رب العـالمـين ، اللهـم إنـي أسـألـك خـير هـذا الـيوم ، فـتحه ، ونصـره ، ونـوره وبـركتـه ، وهـداه ، وأعـوذ بـك مـن شـر ما فـيه وشـر ما بعـده. ',
  ),
  const AthkarEntity(
    name:
        'اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه ، أشهـد أن لا إلـه إلا أنت ، أعـوذ بك من شـر نفسـي ومن شـر الشيـطان وشركه ، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم. ',
    quantity: 1,
    content:
        'اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه ، أشهـد أن لا إلـه إلا أنت ، أعـوذ بك من شـر نفسـي ومن شـر الشيـطان وشركه ، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم. ',
  ),
  const AthkarEntity(
      name: 'أعـوذ بكلمـات الله التـامـات من شـر ما خلـق. ',
      quantity: 3,
      content: 'أعـوذ بكلمـات الله التـامـات من شـر ما خلـق. '),
  const AthkarEntity(
    name: 'اللهم صل وسلم وبارك على نبينا محمد.',
    quantity: 10,
    content: 'اللهم صل وسلم وبارك على نبينا محمد.',
  ),
  const AthkarEntity(
    name:
        'اللهم إنا نعوذ بك من أن نشرك بك شيئا نعلمه ، ونستغفرك لما لا نعلمه. ',
    quantity: 3,
    content:
        'اللهم إنا نعوذ بك من أن نشرك بك شيئا نعلمه ، ونستغفرك لما لا نعلمه. ',
  ),
  const AthkarEntity(
    name:
        'اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدين، وقهر الرجال. ',
    quantity: 3,
    content:
        'اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدين، وقهر الرجال. ',
  ),
  const AthkarEntity(
      name: 'يا رب , لك الحمد كما ينبغي لجلال وجهك , ولعظيم سلطانك. ',
      quantity: 3,
      content: 'يا رب , لك الحمد كما ينبغي لجلال وجهك , ولعظيم سلطانك. '),
  const AthkarEntity(
    name: 'اللهم إني أسألك علما نافعا، ورزقا طيبا، وعملا متقبلا. ',
    quantity: 1,
    content: 'اللهم إني أسألك علما نافعا، ورزقا طيبا، وعملا متقبلا. ',
  ),
  const AthkarEntity(
    name:
        'اللهم أنت ربي لا إله إلا أنت ، عليك توكلت ، وأنت رب العرش العظيم , ما شاء الله كان ، وما لم يشأ لم يكن ، ولا حول ولا قوة إلا بالله العلي العظيم , أعلم أن الله على كل شيء قدير ، وأن الله قد أحاط بكل شيء علما , اللهم إني أعوذ بك من شر نفسي ، ومن شر كل دابة أنت آخذ بناصيتها ، إن ربي على صراط مستقيم. ',
    quantity: 1,
    content:
        'اللهم أنت ربي لا إله إلا أنت ، عليك توكلت ، وأنت رب العرش العظيم , ما شاء الله كان ، وما لم يشأ لم يكن ، ولا حول ولا قوة إلا بالله العلي العظيم , أعلم أن الله على كل شيء قدير ، وأن الله قد أحاط بكل شيء علما , اللهم إني أعوذ بك من شر نفسي ، ومن شر كل دابة أنت آخذ بناصيتها ، إن ربي على صراط مستقيم. ',
  ),
  const AthkarEntity(
    name:
        'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. ',
    quantity: 100,
    content:
        'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. ',
  ),
  const AthkarEntity(
    name: 'سبحـان الله وبحمـده.',
    quantity: 100,
    content: 'سبحـان الله وبحمـده.',
  ),
  const AthkarEntity(
    name: 'أستغفر الله وأتوب إليه',
    quantity: 100,
    content: 'أستغفر الله وأتوب إليه',
  ),
];
final List<AthkarEntity> sleepingAthkarEntites = [
  const AthkarEntity(
    name:
        'باسمك ربـي وضعـت جنـبي ، وبك أرفعـه، فإن أمسـكت نفسـي فارحـمها ، وإن أرسلتـها فاحفظـها بمـا تحفـظ به عبـادك الصـالحـين.',
    quantity: 1,
    content:
        'باسمك ربـي وضعـت جنـبي ، وبك أرفعـه، فإن أمسـكت نفسـي فارحـمها ، وإن أرسلتـها فاحفظـها بمـا تحفـظ به عبـادك الصـالحـين.',
  ),
  const AthkarEntity(
    name:
        'اللهـم إنـك خلـقت نفسـي وأنـت توفـاهـا لك ممـاتـها ومحـياها ، إن أحييـتها فاحفظـها ، وإن أمتـها فاغفـر لـها . اللهـم إنـي أسـألـك العـافـية.',
    quantity: 1,
    content:
        'اللهـم إنـك خلـقت نفسـي وأنـت توفـاهـا لك ممـاتـها ومحـياها ، إن أحييـتها فاحفظـها ، وإن أمتـها فاغفـر لـها . اللهـم إنـي أسـألـك العـافـية.',
  ),
  const AthkarEntity(
    name: 'اللهـم قنـي عذابـك يـوم تبـعث عبـادك.',
    quantity: 3,
    content: 'اللهـم قنـي عذابـك يـوم تبـعث عبـادك.',
  ),
  const AthkarEntity(
    name: 'باسـمك اللهـم أمـوت وأحـيا.',
    quantity: 1,
    content: 'باسـمك اللهـم أمـوت وأحـيا.',
  ),
  const AthkarEntity(
    name:
        'الـحمد لله الذي أطـعمنا وسقـانا، وكفـانا، وآوانا، فكـم ممـن لا كـافي لـه ولا مـؤوي.',
    quantity: 1,
    content:
        'الـحمد لله الذي أطـعمنا وسقـانا، وكفـانا، وآوانا، فكـم ممـن لا كـافي لـه ولا مـؤوي.',
  ),
  const AthkarEntity(
    name:
        'اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه، أشهـد أن لا إلـه إلا أنت، أعـوذ بك من شـر نفسـي، ومن شـر الشيـطان وشـركه، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم .',
    quantity: 1,
    content:
        'اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه، أشهـد أن لا إلـه إلا أنت، أعـوذ بك من شـر نفسـي، ومن شـر الشيـطان وشـركه، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم .',
  ),
  const AthkarEntity(
    name:
        'اللهـم أسـلمت نفـسي إلـيك، وفوضـت أمـري إلـيك، ووجـهت وجـهي إلـيك، وألـجـات ظهـري إلـيك، رغبـة ورهـبة إلـيك، لا ملجـأ ولا منـجـا منـك إلا إلـيك، آمنـت بكتـابك الـذي أنزلـت وبنبـيـك الـذي أرسلـت.',
    quantity: 1,
    content:
        'اللهـم أسـلمت نفـسي إلـيك، وفوضـت أمـري إلـيك، ووجـهت وجـهي إلـيك، وألـجـات ظهـري إلـيك، رغبـة ورهـبة إلـيك، لا ملجـأ ولا منـجـا منـك إلا إلـيك، آمنـت بكتـابك الـذي أنزلـت وبنبـيـك الـذي أرسلـت.',
  ),
  const AthkarEntity(
    name: 'سبحان الله.',
    quantity: 33,
    content: 'سبحان الله.',
  ),
  const AthkarEntity(
    name: 'الحمد لله. ',
    quantity: 33,
    content: 'الحمد لله. ',
  ),
  const AthkarEntity(
    name: 'الله أكبر.',
    quantity: 34,
    content: 'الله أكبر.',
  ),
  const AthkarEntity(
    name:
        'يجمع كفيه ثم ينفث فيهما والقراءة : { هو الله }  أعوذ برب الفلق أعوذ برب ومسح ما استطاع من الجسد يبدأ بهما على رأسه ووجه وما أقبل من جسده.',
    quantity: 3,
    content:
        'يجمع كفيه ثم ينفث فيهما والقراءة : { هو الله }  أعوذ برب الفلق أعوذ برب ومسح ما استطاع من الجسد يبدأ بهما على رأسه ووجه وما أقبل من جسده.',
  ),
  const AthkarEntity(
    name:
        'سورة البقرة: أعوذ بالله من الشيطان الرجيآمن الرسول بما أنزل إليه من ربه والمؤمنون ۚ كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله ۚ وقالوا سمعنا وأطعنا ۖ غفرانك ربنا وإليك المصير. لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ربنا ولا تحملنا ما لا طاقة لنا به واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين. [البقرة 285 - 286]',
    quantity: 1,
    content:
        'سورة البقرة: أعوذ بالله من الشيطان الرجيآمن الرسول بما أنزل إليه من ربه والمؤمنون ۚ كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله ۚ وقالوا سمعنا وأطعنا ۖ غفرانك ربنا وإليك المصير. لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ربنا ولا تحملنا ما لا طاقة لنا به واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين. [البقرة 285 - 286]',
  ),
  const AthkarEntity(
    name:
        'آية الكرسى: أعوذ بالله من الشيطان الرجيم الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم. [البقرة 255] ',
    quantity: 1,
    content:
        'آية الكرسى: أعوذ بالله من الشيطان الرجيم الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم. [البقرة 255] ',
  ),
  const AthkarEntity(
    name:
        'أذكار من قلق في فراشه ولم ينم عن بريدة رضي الله عنه، : شكا خالد بن الوليد رضي الله عنه إلى النبي صلى الله عليه وسلم : يا رسول ! ما أنام الليل من الأرق، فقال النبي صلى الله عليه : " أويت إلى فراشك : اللهم رب السموات السبع وما أظلت، ورب الأرضين وما أقلت، ورب الشياطين وما أضلت، كن لي جارا من خلقك كلهم جميعا أن يفرط علي أحد منهم أو أن يبغي علي، عز جارك، وجل ثناؤك ولا إله غيرك، ولا إله إلا " عن عمرو بن شعيب، عن أبيه، عن جده: أن رسول الله صلى الله عليه وسلم كان يعلمهم من الفزع  " بكلمات الله التامة من غضبه وشر عباده، ومن همزات الشياطين وأن "',
    quantity: 3,
    content:
        'أذكار من قلق في فراشه ولم ينم عن بريدة رضي الله عنه، : شكا خالد بن الوليد رضي الله عنه إلى النبي صلى الله عليه وسلم : يا رسول ! ما أنام الليل من الأرق، فقال النبي صلى الله عليه : " أويت إلى فراشك : اللهم رب السموات السبع وما أظلت، ورب الأرضين وما أقلت، ورب الشياطين وما أضلت، كن لي جارا من خلقك كلهم جميعا أن يفرط علي أحد منهم أو أن يبغي علي، عز جارك، وجل ثناؤك ولا إله غيرك، ولا إله إلا " عن عمرو بن شعيب، عن أبيه، عن جده: أن رسول الله صلى الله عليه وسلم كان يعلمهم من الفزع  " بكلمات الله التامة من غضبه وشر عباده، ومن همزات الشياطين وأن "',
  ),
  const AthkarEntity(
    name:
        'أذكار الأحلام عن أبي قتادة رضي الله عنه : قال رسول الله صلى الله عليه : وفي رواية " الحسنة من الله، والحلم من الشيطان، فمن رأى شيئا يكرهه فلينفث عن شماله ثلاثا وليتعوذ من الشيطان، فإنها لا".',
    quantity: 1,
    content:
        'أذكار الأحلام عن أبي قتادة رضي الله عنه : قال رسول الله صلى الله عليه : وفي رواية " الحسنة من الله، والحلم من الشيطان، فمن رأى شيئا يكرهه فلينفث عن شماله ثلاثا وليتعوذ من الشيطان، فإنها لا".',
  ),
];

final List<AthkarEntity> nightAthkarEntites = [
  const AthkarEntity(
    name:
        'أعوذ بالله من الشيطان الرجيم الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم. [آية الكرسى - البقرة 255].',
    quantity: 1,
    content:
        'أعوذ بالله من الشيطان الرجيم الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم. [آية الكرسى - البقرة 255].',
  ),
  const AthkarEntity(
    name:
        'أعوذ بالله من الشيطان الرجيم آمن الرسول بما أنزل إليه من ربه والمؤمنون ۚ كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله ۚ وقالوا سمعنا وأطعنا ۖ غفرانك ربنا وإليك المصير. لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينآ أو أخطأنا ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ربنا ولا تحملنا ما لا طاقة لنا به واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين. [البقرة 285 - 286].',
    quantity: 1,
    content:
        'أعوذ بالله من الشيطان الرجيم آمن الرسول بما أنزل إليه من ربه والمؤمنون ۚ كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله ۚ وقالوا سمعنا وأطعنا ۖ غفرانك ربنا وإليك المصير. لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينآ أو أخطأنا ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ربنا ولا تحملنا ما لا طاقة لنا به واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين. [البقرة 285 - 286].',
  ),
  const AthkarEntity(
    name:
        'بسم الله الرحمن الرحيم قل هو ٱلله أحد، ٱلله ٱلصمد، لم يلد ولم يولد، ولم يكن لهۥ كفوا أحدۢ.',
    quantity: 3,
    content:
        'بسم الله الرحمن الرحيم قل هو ٱلله أحد، ٱلله ٱلصمد، لم يلد ولم يولد، ولم يكن لهۥ كفوا أحدۢ.',
  ),
  const AthkarEntity(
    name:
        'بسم الله الرحمن الرحيم قل أعوذ برب ٱلفلق، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر ٱلنفٰثٰت فى ٱلعقد، ومن شر حاسد إذا حسد.',
    quantity: 3,
    content:
        'بسم الله الرحمن الرحيم قل أعوذ برب ٱلفلق، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر ٱلنفٰثٰت فى ٱلعقد، ومن شر حاسد إذا حسد.',
  ),
  const AthkarEntity(
    name:
        'بسم الله الرحمن الرحيم قل أعوذ برب ٱلناس، ملك ٱلناس، إلٰه ٱلناس، من شر ٱلوسواس ٱلخناس، ٱلذى يوسوس فى صدور ٱلناس، من ٱلجنة وٱلناس. ',
    quantity: 3,
    content:
        'بسم الله الرحمن الرحيم قل أعوذ برب ٱلناس، ملك ٱلناس، إلٰه ٱلناس، من شر ٱلوسواس ٱلخناس، ٱلذى يوسوس فى صدور ٱلناس، من ٱلجنة وٱلناس. ',
  ),
  const AthkarEntity(
    name:
        'أمسيـنا وأمسـى المـلك لله والحمد لله ، لا إله إلا الله وحده لا شريك له، له المـلك وله الحمـد، وهو على كل شيء قدير ، رب أسـألـك خـير ما في هـذه اللـيلة وخـير ما بعـدهـا ، وأعـوذ بك من شـر ما في هـذه اللـيلة وشر ما بعـدهـا ، رب أعـوذبك من الكسـل وسـوء الكـبر ، رب أعـوذ بك من عـذاب في النـار وعـذاب في القـبر. ',
    quantity: 1,
    content:
        'أمسيـنا وأمسـى المـلك لله والحمد لله ، لا إله إلا الله وحده لا شريك له، له المـلك وله الحمـد، وهو على كل شيء قدير ، رب أسـألـك خـير ما في هـذه اللـيلة وخـير ما بعـدهـا ، وأعـوذ بك من شـر ما في هـذه اللـيلة وشر ما بعـدهـا ، رب أعـوذبك من الكسـل وسـوء الكـبر ، رب أعـوذ بك من عـذاب في النـار وعـذاب في القـبر. ',
  ),
  const AthkarEntity(
    name:
        'اللهـم أنت ربـي لا إله إلا أنت ، خلقتنـي وأنا عبـدك ، وأنا علـى عهـدك ووعـدك ما استـطعـت ، أعـوذبك من شـر ما صنـعت ، أبـوء لـك بنعـمتـك علـي وأبـوء بذنـبي فاغفـر لي فإنـه لا يغـفر الذنـوب إلا أنت .',
    quantity: 1,
    content:
        'اللهـم أنت ربـي لا إله إلا أنت ، خلقتنـي وأنا عبـدك ، وأنا علـى عهـدك ووعـدك ما استـطعـت ، أعـوذبك من شـر ما صنـعت ، أبـوء لـك بنعـمتـك علـي وأبـوء بذنـبي فاغفـر لي فإنـه لا يغـفر الذنـوب إلا أنت .',
  ),
  const AthkarEntity(
    name: 'رضيـت بالله ربـا وبالإسلام ديـنا وبمحـمد صلى الله عليه وسلم نبيـا.',
    quantity: 3,
    content:
        'رضيـت بالله ربـا وبالإسلام ديـنا وبمحـمد صلى الله عليه وسلم نبيـا.',
  ),
  const AthkarEntity(
    name:
        'اللهـم إنـي أمسيت أشـهدك ، وأشـهد حملـة عـرشـك ، وملائكتك ، وجمـيع خلـقك ، أنـك أنـت الله لا إله إلا أنـت وحـدك لا شريك لـك ، وأن محمـدا عبـدك ورسـولـك.',
    quantity: 4,
    content:
        'اللهـم إنـي أمسيت أشـهدك ، وأشـهد حملـة عـرشـك ، وملائكتك ، وجمـيع خلـقك ، أنـك أنـت الله لا إله إلا أنـت وحـدك لا شريك لـك ، وأن محمـدا عبـدك ورسـولـك.',
  ),
  const AthkarEntity(
    name:
        'اللهـم ما أمسى بي مـن نعـمة أو بأحـد مـن خلـقك ، فمـنك وحـدك لا شريك لـك ، فلـك الحمـد ولـك الشكـر. ',
    quantity: 1,
    content:
        'اللهـم ما أمسى بي مـن نعـمة أو بأحـد مـن خلـقك ، فمـنك وحـدك لا شريك لـك ، فلـك الحمـد ولـك الشكـر. ',
  ),
  //
  const AthkarEntity(
      name: 'حسبـي الله لا إله إلا هو علـيه توكـلت وهو رب العرش العظـيم.',
      quantity: 7,
      content: 'حسبـي الله لا إله إلا هو علـيه توكـلت وهو رب العرش العظـيم.'),
  const AthkarEntity(
    name:
        'بسـم الله الذي لا يضـر مع اسمـه شيء في الأرض ولا في السمـاء وهـو السمـيع العلـيم. ',
    quantity: 3,
    content:
        'بسـم الله الذي لا يضـر مع اسمـه شيء في الأرض ولا في السمـاء وهـو السمـيع العلـيم. ',
  ),
  const AthkarEntity(
    name: 'اللهـم بك أمسـينا وبك أصـبحنا، وبك نحـيا وبك نمـوت وإلـيك المصير.',
    quantity: 1,
    content:
        'اللهـم بك أمسـينا وبك أصـبحنا، وبك نحـيا وبك نمـوت وإلـيك المصير.',
  ),

  const AthkarEntity(
    name:
        'أمسينا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم حنيفا مسلما وما كان من المشركين. ',
    quantity: 1,
    content:
        'أمسينا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم حنيفا مسلما وما كان من المشركين.',
  ),
  const AthkarEntity(
    name:
        'سبحـان الله وبحمـده عدد خلـقه ، ورضـا نفسـه ، وزنـة عـرشـه ، ومـداد كلمـاتـه. ',
    quantity: 3,
    content:
        'سبحـان الله وبحمـده عدد خلـقه ، ورضـا نفسـه ، وزنـة عـرشـه ، ومـداد كلمـاتـه. ',
  ),
  const AthkarEntity(
    name:
        'اللهـم عافـني في بدنـي ، اللهـم عافـني في سمـعي ، اللهـم عافـني في بصـري ، لا إله إلا أنـت.',
    quantity: 3,
    content:
        'اللهـم عافـني في بدنـي ، اللهـم عافـني في سمـعي ، اللهـم عافـني في بصـري ، لا إله إلا أنـت.',
  ),
  const AthkarEntity(
    name:
        'اللهـم إنـي أعـوذ بك من الكـفر ، والفـقر ، وأعـوذ بك من عذاب القـبر ، لا إله إلا أنـت. ',
    quantity: 3,
    content:
        'اللهـم إنـي أعـوذ بك من الكـفر ، والفـقر ، وأعـوذ بك من عذاب القـبر ، لا إله إلا أنـت. ',
  ),
  const AthkarEntity(
    name:
        'اللهـم إنـي أسـألـك العـفو والعـافـية في الدنـيا والآخـرة ، اللهـم إنـي أسـألـك العـفو والعـافـية في ديني ودنـياي وأهـلي ومالـي ، اللهـم استـر عـوراتي وآمـن روعاتـي ، اللهـم احفظـني من بـين يدي ومن خلفـي وعن يمـيني وعن شمـالي ، ومن فوقـي ، وأعـوذ بعظمـتك أن أغـتال من تحتـي.',
    quantity: 1,
    content:
        'اللهـم إنـي أسـألـك العـفو والعـافـية في الدنـيا والآخـرة ، اللهـم إنـي أسـألـك العـفو والعـافـية في ديني ودنـياي وأهـلي ومالـي ، اللهـم استـر عـوراتي وآمـن روعاتـي ، اللهـم احفظـني من بـين يدي ومن خلفـي وعن يمـيني وعن شمـالي ، ومن فوقـي ، وأعـوذ بعظمـتك أن أغـتال من تحتـي.',
  ),
  const AthkarEntity(
    name:
        'يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طـرفة عين.',
    quantity: 3,
    content:
        'يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طـرفة عين.',
  ),
  //
  const AthkarEntity(
    name:
        'أمسينا وأمسى الملك لله رب العالمين، اللهم إني أسألك خير هذه الليلة فتحها ونصرها، ونورها وبركتها، وهداها، وأعوذ بك من شر ما فيها وشر ما بعدها.',
    quantity: 1,
    content:
        'أمسينا وأمسى الملك لله رب العالمين، اللهم إني أسألك خير هذه الليلة فتحها ونصرها، ونورها وبركتها، وهداها، وأعوذ بك من شر ما فيها وشر ما بعدها.',
  ),
  const AthkarEntity(
    name:
        'اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه ، أشهـد أن لا إلـه إلا أنت ، أعـوذ بك من شـر نفسـي ومن شـر الشيـطان وشركه ، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم. ',
    quantity: 1,
    content:
        'اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه ، أشهـد أن لا إلـه إلا أنت ، أعـوذ بك من شـر نفسـي ومن شـر الشيـطان وشركه ، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم. ',
  ),
  const AthkarEntity(
    name: 'أعـوذ بكلمـات الله التـامـات من شـر ما خلـق. ',
    quantity: 3,
    content: 'أعـوذ بكلمـات الله التـامـات من شـر ما خلـق. ',
  ),
  const AthkarEntity(
    name: 'اللهم صل وسلم وبارك على نبينا محمد. ',
    quantity: 10,
    content: 'اللهم صل وسلم وبارك على نبينا محمد. ',
  ),
  const AthkarEntity(
    name: 'اللهم إنا نعوذ بك من أن نشرك بك شيئا نعلمه ، ونستغفرك لما لا نعلمه.',
    quantity: 3,
    content:
        'اللهم إنا نعوذ بك من أن نشرك بك شيئا نعلمه ، ونستغفرك لما لا نعلمه.',
  ),
  //
  const AthkarEntity(
    name:
        'اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدين، وقهر الرجال. ',
    quantity: 3,
    content:
        'اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدين، وقهر الرجال. ',
  ),
  const AthkarEntity(
    name: 'أستغفر الله العظيم الذي لا إله إلا هو، الحي القيوم، وأتوب إليه. ',
    quantity: 3,
    content: 'أستغفر الله العظيم الذي لا إله إلا هو، الحي القيوم، وأتوب إليه. ',
  ),
  const AthkarEntity(
    name: 'يا رب , لك الحمد كما ينبغي لجلال وجهك , ولعظيم سلطانك. ',
    quantity: 3,
    content: 'يا رب , لك الحمد كما ينبغي لجلال وجهك , ولعظيم سلطانك. ',
  ),
  const AthkarEntity(
    name:
        'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. ',
    quantity: 100,
    content:
        'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. ',
  ),
  const AthkarEntity(
    name:
        'اللهم أنت ربي لا إله إلا أنت ، عليك توكلت ، وأنت رب العرش العظيم , ما شاء الله كان ، وما لم يشأ لم يكن ، ولا حول ولا قوة إلا بالله العلي العظيم , أعلم أن الله على كل شيء قدير ، وأن الله قد أحاط بكل شيء علما , اللهم إني أعوذ بك من شر نفسي ، ومن شر كل دابة أنت آخذ بناصيتها ، إن ربي على صراط مستقيم. ',
    quantity: 1,
    content:
        'اللهم أنت ربي لا إله إلا أنت ، عليك توكلت ، وأنت رب العرش العظيم , ما شاء الله كان ، وما لم يشأ لم يكن ، ولا حول ولا قوة إلا بالله العلي العظيم , أعلم أن الله على كل شيء قدير ، وأن الله قد أحاط بكل شيء علما , اللهم إني أعوذ بك من شر نفسي ، ومن شر كل دابة أنت آخذ بناصيتها ، إن ربي على صراط مستقيم. ',
  ),
  const AthkarEntity(
    name: 'سبحـان الله وبحمـده.',
    quantity: 100,
    content: 'سبحـان الله وبحمـده.',
  ),
];

class StaticAthkarData {
  static final List<AthkarCategory> athkarCategories = [
    AthkarCategory(
        name: 'اذكار الصباح',
        athkarEntities: morningAthkarEntites,
        icon: IconPath.morningAthkarIcon),
    AthkarCategory(
        name: 'اذكار النوم',
        athkarEntities: sleepingAthkarEntites,
        icon: IconPath.sleepingAthkarIcon),
    AthkarCategory(
        name: 'اذكار المساء',
        athkarEntities: nightAthkarEntites,
        icon: IconPath.eveningAthkarIcon),
  ];
}
