const aboutAr = {
  70030076695941558:
      'بوليڤارد رياض سيتي يعد وجهة السيّاح المفضّلة، تحتوي على تسعة مناطق ثانوية تفوق الخيال تتميز كلّ منها بمجموعتها الخاصة من الفعاليات، والمطاعم، والمهرجانات، والمتاجر المصممة لجميع الأذواق والأعمار.',
  70030076256595855:
      'يُعد قصر المصمك المعلم التاريخي الأبرز في العاصمة الرياض لارتباطه بتاريخ تأسيس المملكة. يمكنك التجول والتعرف على تاريخ الإرث العريق الثابت، و أوجه تاريخ المملكة وتنقلاته من خلال العروض المرئية داخل القصر، كما ستشاهد بعض القطع التراثية العتيقة المعلقة على جدرانه.',
  70030076567998694:
      'حلبة كورنيش جدة هي حلبة سباق مخطط لها تم بناؤها في مدينة جدة الساحلية في منطقة الكورنيش المتاخمة للبحر الأحمر في المملكة العربية السعودية. يطلق عليه "أسرع مسار شارع" في تقويم الفورمولا 1 ، حيث يحاكي سيارات الفورمولا 1 بمتوسط سرعات تتجاوز 250 كيلومترا في الساعة (160 ميلا في الساعة). المسار هو ثاني أطول مسار في تقويم الفورمولا 1 ويستضيف سباق الجائزة الكبرى السنوي في المملكة العربية السعودية للفورمولا 1.',
  70030076527675534:
      'بوابة جدة التاريخية هي جزء من التراث الثقافي لمدينة جدة، تعتبر البوابة جزءًا من المعالم التاريخية في المدينة وتمثل رمزًا للتراث القديم والهوية الثقافية. تقدم البوابة نافذة إلى الماضي، حيث يمكن للزوار اكتشاف العمارة التقليدية والجوانب التاريخية لهذه المدينة الساحلية الحيوية.',
  70030076311234605:
      'مركز الملك عبد العزيز الثقافي العالمي (إثراء) مركز ثقافي عالمي ومبادرة من شركة أرامكو السعودية، يقع بالقرب من موقع بئر الخير. يأتي تصميمه على شكل مجموعة من الصخور المتراصة ضامًا في جنباته؛ مكتبة عصرية، ومختبراً للأفكار، ومتحفاً بقاعات متعددة، ومسرحاً، وسينما، ومعرض طاقة، وقاعة كبرى لإقامة أكبر المعارض ولاستضافة أبرز الأحداث، ومتحفاً للطفل. ويتوسطه "برج إثراء" الذي يقدم دورات تعليمية للرواد من كل الأعمار. في عام 2018 اختير من قبل مجلة «تايم» الأمريكية بصفته أحد أعظم 100 مكان في العالم.\n حاصل على شهادة "LEED" عن الفئة الذهبية للأبنية المستدامة من مجلس المباني الخضراء العالمي، وذلك لتحقيقه كافة معايير الأبنية المستدامة',
  70030076255291035:
      'المسجد الحرام هو أعظم مسجد في الإسلام ويقع في قلب مدينة مكة غرب المملكة العربية السعودية، تتوسطه الكعبة المشرفة التي هي أول بيت وضع للناس على وجه الأرض ليعبدوا الله فيه تبعاً للعقيدة الإسلامية، وهذه هي أعظم وأقدس بقعة على وجه الأرض عند المسلمين. والمسجد الحرام هو قبلة المسلمين في صلاتهم، وإليه يحجون. سمي بالمسجد الحرام لحرمة القتال فيه منذ دخول النبي محمد صلى الله عليه وسلم إلى مكة المكرمة منتصراً. ويؤمن المسلمون أن الصلاة فيه تعادل مئة ألف صلاة',
  70030076283128866:
      'المسجد النبوي هو واحد من أهم المعالم الدينية في الإسلام، ويقع في المدينة المنورة، يُعتبر المسجد النبوي ثاني أكبر مسجد في العالم بعد المسجد الحرام في مكة المكرمة، يمتد تاريخ المسجد النبوي إلى العهد النبوي حيث بُني بيت النبي محمد صلى الله عليه وسلم، وكان يُستخدم كمكان للصلاة والتعليم الديني.',
  70030076305727970:
      'مجمع الملك فهد لطباعة المصحف الشريف هو مؤسسة دينية وثقافية، تأسس المجمع في عام 1405هـ. ويعد مشروعًا ضخمًا تموله المملكة لخدمة الإسلام والمسلمين على مستوى العالم، ويعمل على إنتاج نسخ عالية الجودة من القرآن الكريم باستخدام تكنولوجيا حديثة. يُعتبر المجمع مركزًا رئيسيًا لإنتاج المصاحف والتي تُوزع على المساجد والمؤسسات الإسلامية في جميع أنحاء العالم.',
  70030076201324251:
      'بتصميمه العصري ومساحاته الفسيحة، افتتح مركز الرياض بارك في عام 2018، حيث يضم وجهات تسوّق عالميّة تواكب من خلالها عالم الجمال والموضة، إضافةً إلى تنوّع الوجهات الترفيهية، ما يتيح  قضاء أوقات مميزة برفقة الأصدقاء أو العائلة، والاستمتاع بتناول أشهى المأكولات المحليّة والعالميّة في تجربة لا مثيل لها تحت سقف  مركز تجاري كبير بالرياض.',
  70030076200168619:
      'أحد أكثر المناطق المرغوبة في وسط الرياض للمتسوقين. يتميز بتصميمه المعماري الفريد والجميل مع واجهة بانورامية ضخمة وتصميم سهل لتجربة تسوق مختلفة. يضم مجموعة واسعة من العلامات التجارية المشهورة عالميًا ، وهايبر ماركت ، وصالة سينما حديثة ، ومنطقة طعام فسيحة توفر أجواءً من الراحة والهدوء. يتميز المركز  بامتلاكه أحد أكبر مراكز الترفيه في المنطقة مع وجود صالة عرض سينما مميزة.',
  70030076201455028:
      'يعد واحدًا من المراكز التجارية المعروفة في مدينة الرياض حيث يستقطب أعدادًا كبيرة من الناس من مختلف الأعمار لما يتوفر فيه من مرافق تناسب مختلف أفراد العائلة وأماكن مخصصة للأطفال، وصالة طعام كبيرة تابعة لعدد من سلاسل المطاعم العالمية، ومحلات تجارية محلية وعالمية متخصصة ببيع مختلف أنواع البضائع.',
  70030076200176896:
      'من أقدم الأسواق والمراكز التجارية بمدينة الرياض ويضم أكثر من 350 متجرًا للملابس، والذهب، والنسيج، وغيرها..، إلى جانب المطاعم والمقاهي وملعب للأطفال.',
  70030076200177007:
      'يعتبر أحد أهم الوجهات التسوقية النسائية في مدينة الرياض، حيث يضم العديد من المحلات المتخصصة في العبايات النسائية بأنواعها المختلفة حيث يضم  أكثر من 60 محل تجاري.',
  70030076442526098: 'nan',
  70030076199377095:
      'الحمراء مول هو أحد أشهر المراكز التجارية في الرياض حيث يعتبر معلمًا سياحيًا وترفيهيًا وتجاريًا. يجمع ما بين التسوق والترفية ويضم مجموعة من المحلات التجارية المتنوعة والعديد من المطاعم والمقاهي بالإضافة إلى السينما',
  70030076203796399:
      'يعد ذا فيو مول مجمع كبير يضم متاجر ذات علامات تجارية وقاعة طعام بالإضافة إلى دار سينما ومركز ألعاب للأطفال يعتبر من المراكز التجارية التي تقع على أحد أهم الطرق الحيوية في مدينة الرياض طريق خريص مما يجعله من أسهل المراكز التجارية الذي يمكن الوصول له',
  70030076445225026:
      '" أبرز وجهات التسوق في الرياض للقيام  والتنقل بأريحية بين المحلات التجارية المفضلة، تحت سقف واحد في مراكزها التجارية المتميزة والشاملة لخيارات ترفيه مميزة، حيث يضم المركز علامات تجارية فاخرة، وتشكيلة مطاعم متنوعة بالإضافة إلى السينما، ومساحة ألعاب للأطفال، وتتوزع نوافير المياه في أرجائه لتصبغه بطابع مريح وجميل.\n"',
  70030076200414223:
      'من المراكز التجارية الشعبية المغلقة حيث يضم عدداً من محلات الذهب والمحلات التجارية المناسبة لجميع الفئات العمرية حيث يباع في محلاته التجارية أنواع مختلفة من الملابس الشعبية والمنتجات',
  70030076297020197:
      'منطقة مصممة على الطراز السلماني بالتناغم مع الهوية المحلية لمدينة الرياض، يتواجد فيها أحد أشهر فنادق الخمس نجوم "سانت ريجس الرياض"، وسبع صالات سينما راقية مع عدد من البوتيكات العالمية الحصرية في عالم الأزياء والمجوهرات والعديد من المطاعم والمقاهي العالمية لأول مرة في المملكة.',
  70030076201502157:
      'أحد أكبر مراكز التسوق الفاخر والمطاعم الراقية في مدينة الرياض كما يعد وجهة مميزة للباحثين عن التميز يقع في قلب مدينة الرياض في حي العليا بالقرب من برج الفيصلية',
  70030076443084038:
      'يعتبر أحد أهم الوجهات التسوقية النسائية في مدينة الرياض، حيث يضم العديد من المحلات المتخصصة في العبايات النسائية بأنواعها المختلفة حيث يضم أكثر من 60 محل تجاري.',
  70030076200177142:
      'يعد العليا مول واحدًا من أشهر المراكز التجارية في مدينة الرياض وأكثرها استقطابًا للزوار من مختلف الأعمار حيث يضم صالة طعام كبيرة تابعة لمجموعة من سلاسل المطاعم المحلية والعالمية المختصة بالوجبات السريعة، ومناطق مخصصة للعب الأطفال، ومجموعة من المحلات التجارية التابعة لأهم العلامات التجارية حول العالم، وغير ذلك الكثير من المرافق.',
  70030076200633394:
      'لوكالايزر مول مجمع تجارى يجمع أكثر من 90 المحلات التجارية، كما يضم المطاعم والمقاهي الفاخرة ومدينة ملاهي وملعب رملي للأطفال ونوافير مائية، بالإضافة إلى نادي للياقة يعتبر الأول من نوعه فى المملكة العربية.',
  70030076202562132:
      'أحد الأسواق الترفيهية المتكاملة الذي يحتاجه المتسوق من مرافق وخدمات، كما يوفر خدمة الواي فاي المجاني كذلك يوجد يوفر عربات مخصصةا للأطفال لتتنقل بها داخل المركز. ويوجد العديد من المحلات في مختلف المجالات. كما يوفر المركز عدداً من أفضل العلامات التجارية المحلية والعالمية.',
  70030076442524004:
      'يعد مارينا مول الرياض من أهم المولات المميزة بمساحتها الواسعة حيث يضم مجموعة من المحلات التجارية المتنوعة ، بالإضافة إلى المرافق الخدمية والمقاهي والمطاعم ومناطق لعب الأطفال التي تتناسب مع مختلف الفئات العمرية.',
  70030076201328389:
      'مركز تسوق متنوع بأكثر من مستوى يقع في شرق الرياض يضم متاجر تجزئة للعديد من العلامات التجارية الخاصة بالملابس الرجالية والنسائية والخاصة بالمواليد والأطفال كما يتضمن مركزاً ترفيهياً للأطفال بالإضافة إلى العديد من المقاهي',
  70030076203709043:
      'يتميز السلام مول بإطلالته المميزة، حيث يضم متاجر تملك العلامات التجارية الجاذبة لمتنوع الأذواق، بالإضافة إلى عدد كبير من المطاعم والمقاهي المختارة، ويعتبر الهايبر ماركت من أبرز عوامل الجذب للمول.',
  70030076201501940: 'nan',
  70030076200222067:
      'مجمع تجاري في مدينة الرياض، يجمع العلامات التجارية المختلفة حيث يقدم ما يحتاجه المتسوق بتجربة مميزة تلائم احتياجاته، ويضم المجمع عدداً من المراكز التجارية المتنوعة في موقع واحد.',
  70030076443034245:
      'ساهم حياة مول في إحداث نقلة مميزة في عالم التسوق والترفيه بمدينة الرياض بمفهوم مغاير وأداء عالمي للتسوق، حيث يجمع بين امتيازات عدة من حيث الموقع وسهولة الوصول والخروج منه ورحابة المكان وجماليته. \n وقد حاز على جائزة سيتي سكيب العالمية عام 2010م كأفضل مشروع تجاري و تجزئة بالمملكة، و يضم العديد من الخدمات والمرافق المتميزة.',
  70030076256609771:
      'مركز المملكة هو مركز التسوق الأكثر أصالة في المنطقة، حيث يقدم المركز لزواره مجموعة متنوعة من الخيارات التي تجعل من التسوق تجربة ممتعة لا تنسى حيث يتضمن العديد من العلامات التجارية العالمية بالإضافة إلى عدد من المكاتب التجارية وكذلك مطل على مدينة الرياض في أعلى المبنى',
  70030076198782342:
      'من أهم المراكز التجارية في مدينة الرياض من حيث التصميم. يضم العديد من المراكز والمحلات التجارية بالإضافة لوجود مجموعة من المطاعم والمقاهي التي تناسب كافة الزوار، ويمتاز بممشى خارجي طويل مزين بأنوار مميزة يضم على جنباته عدداً من المطاعم والمقاهي المميزة',
};
